{"id":94455,"date":"2017-02-03T15:37:36","date_gmt":"2017-02-03T15:37:36","guid":{"rendered":"https:\/\/sharpspring.com\/?post_type=resource&#038;p=14455"},"modified":"2019-10-07T15:27:31","modified_gmt":"2019-10-07T19:27:31","slug":"personal-webinar2","status":"publish","type":"resource","link":"https:\/\/sharpspring.com\/resources\/personal-webinar2\/","title":{"rendered":"Let’s Get Personal"},"content":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row&#8221; content_placement=&#8221;bottom&#8221; css=&#8221;.vc_custom_1507576953754{border-bottom-width: 5px !important;padding-top: 80px !important;padding-bottom: 80px !important;background-image: url(https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2018\/02\/single-resource-page-bg-colorol-1902&#215;496.jpg) !important;background-position: center !important;background-repeat: no-repeat !important;background-size: cover !important;border-bottom-color: #f5f5f5 !important;border-bottom-style: solid !important;}&#8221;][vc_column width=&#8221;1\/2&#8243; offset=&#8221;vc_col-lg-7 vc_col-md-6 vc_col-sm-offset-0 vc_col-xs-12&#8243; css=&#8221;.vc_custom_1504895160519{margin-top: 0px !important;margin-bottom: 0px !important;padding-top: 0px !important;padding-right: 10% !important;padding-bottom: 0px !important;}&#8221;][vc_empty_space height=&#8221;90px&#8221; el_class=&#8221;sm-hide&#8221;]<div class=\" text-left\"><div class=\" \"  ><h1 style=\"color: #ffffff !important; \">Personalized Marketing Campaigns With Buyer Personas<\/h1><\/div><\/div>[vc_empty_space height=&#8221;35px&#8221; el_class=&#8221;sm-hide&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243; offset=&#8221;vc_col-lg-5 vc_col-md-6 vc_col-xs-12&#8243;][vc_column_text css=&#8221;.vc_custom_1512065808919{margin-top: 0px !important;margin-bottom: 0px !important;padding-top: 30px !important;padding-right: 30px !important;padding-bottom: 30px !important;padding-left: 30px !important;background-color: #3a3042 !important;border-radius: 5px !important;}&#8221;]<\/p>\n<h5 style=\"text-align: center;\"><span style=\"color: #ffffff;\"><strong>On Demand Webinar<br \/>\nAir Date: <\/strong>March 1, 2017<\/span><br \/>\n<span style=\"color: #ffffff;\"><strong>Duration:<\/strong> 1 hour<\/span><\/h5>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row content_placement=&#8221;top&#8221; css=&#8221;.vc_custom_1513211434713{padding-top: 5% !important;padding-bottom: 5% !important;}&#8221;][vc_column width=&#8221;1\/2&#8243; offset=&#8221;vc_col-lg-7 vc_col-md-6 vc_col-sm-offset-0 vc_col-xs-12&#8243; css=&#8221;.vc_custom_1513210632285{margin-top: 0px !important;margin-bottom: 0px !important;padding-top: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_row_inner css=&#8221;.vc_custom_1507577013722{margin-top: -24% !important;margin-bottom: 5% !important;padding-bottom: 5% !important;}&#8221; el_class=&#8221;sm-hide&#8221;][vc_column_inner width=&#8221;1\/3&#8243;][vc_single_image image=&#8221;156947&#8243; add_caption=&#8221;yes&#8221; alignment=&#8221;center&#8221; style=&#8221;vc_box_border_circle_2&#8243; css=&#8221;.vc_custom_1508731178781{margin-bottom: 0px !important;border-bottom-width: 0px !important;padding-bottom: 0px !important;}&#8221;][\/vc_column_inner][vc_column_inner width=&#8221;1\/3&#8243;][vc_single_image image=&#8221;156753&#8243; add_caption=&#8221;yes&#8221; alignment=&#8221;center&#8221; style=&#8221;vc_box_border_circle_2&#8243; css=&#8221;.vc_custom_1508731183425{margin-bottom: 0px !important;border-bottom-width: 0px !important;padding-bottom: 0px !important;}&#8221;][\/vc_column_inner][\/vc_row_inner][vc_column_text el_class=&#8221;list-unstyled list-chevron&#8221;]<\/p>\n<h3>Leverage Buyer Personas for Personalized Marketing Campaigns<\/h3>\n<p>Personalized marketing campaigns with buyer personas is about knowing your customers, identifying their pain points, and telling them the stories that move them through the marketing funnel.<\/p>\n<p>In this webinar, SharpSpring partner Candeo Creative discusses the importance of using buyer personas within your marketing automation platform. The webinar will also cover why you need personas for personalized marketing campaigns to speak directly with different customer types and send super-personalized content that converts.<\/p>\n<p>Watch the webinar to learn:<\/p>\n<ul>\n<li>Three sample customer journeys designed carefully based on personas<\/li>\n<li>How marketing automation delivers results for all price points – from $5 to $5 million<\/li>\n<li>Why using both your CRM and marketing automation is the best measure for campaign success<\/li>\n<\/ul>\n<p>[\/vc_column_text]<div class=\" text-left\"><div class=\"m-b-30 custom-heading\"  ><h5 >Featured Presenters:<\/h5><span class=\"custom-heading-delim\" style=\"width:130px;\"><\/span><\/div><\/div><div class=\"testimonial testimonial-card lg-float-left\"> <div class=\"testimonial-image\"><img class=\"round\" src=\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2017\/10\/ZachPawlosky-1-240x240.png\" alt=\"image\"><h4>Zack Pawlosky<\/h4><p class=\"subtitle\">Candeo Creative<\/p><\/div><div class=\"testimonial-description\"><p>Zack Pawlosky brings years of experience working in marketing, advertising, branding and web development with local, regional and national brands. He was recognized as one of the 3 Overachievers Under 30 in the state of Wisconsin, and he’s won numerous awards for his entrepreneurial and marketing skills.<\/p>\n<\/div><\/div><div class=\"testimonial testimonial-card lg-float-left\"> <div class=\"testimonial-image\"><img class=\"round\" src=\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2017\/10\/Bryan-1-copy-1-240x240.png\" alt=\"image\"><h4>Bryan Tobin<\/h4><p class=\"subtitle\">Training and Usability Manager – SharpSpring<\/p><\/div><div class=\"testimonial-description\"><p>As Usability Manager, Bryan is responsible for creating content to help users get the most out of SharpSpring. This includes maintaining the support forum and creating instructional “how to” videos. Working in collaboration with Marketing, Support, and Development, Bryan helps create an exemplary experience for every user.<\/p>\n<\/div><\/div>[vc_column_text]<\/p>\n<h3><strong>No time to watch? Read the full transcript here.<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>Bryan: Let&#8217;s go ahead and get started. So, everyone, you can see my screen. This is Bryan Tobin. I&#8217;m on the product team here at SharpSpring. And we&#8217;re joined by Zack. He&#8217;s the President of Candeo Creative. He&#8217;s one of our SharpSpring agency partners. Zack is gonna be leading the majority of the presentation today. And, of course, as the title says, we&#8217;re gonna get personal, which I can&#8217;t stop hearing that song in my head of, &#8220;Let&#8217;s get personal.&#8221; And we will, of course, move on from there.<\/p>\n<p>Bryan: So, before we start, I&#8217;ll just kind of kick things off. Who&#8217;s here? So we have existing SharpSpring agency partners, some agencies that may be looking at SharpSpring as a tool for them. So, we&#8217;re, of course, a marketing automation platform that helps companies understand who is on their site and then deliver messaging that&#8217;s both compelling and captivating to their visitors. And then we also have in-house marketing professionals on the line as well. Excited to have all of you here. Now, the next thing is, you know, why are we here? What are we here to learn? So, what we wanna today is we wanna focus on this idea of buyer personas and how they can actually make our marketing a bit more impactful to our audience. So, what&#8217;s really cool is that we have Zack here, who, again, is an agency partner, who has a real-world example of how using Personas helped one of his clients that he&#8217;s been working with. And we&#8217;re gonna use just kind of like a storytelling session and go through how he has achieved these results by using not just our tool, because it&#8217;s, you know, half of it is the tool that you leverage, but the other half is what you make of that tool. So, it&#8217;s kind of Zack&#8217;s strategy of how he uses marketing automation and Personas to achieve his goals.<\/p>\n<p>Bryan: So if you&#8217;ve joined any of webinars before, you know that all of the phone lines are muted. It just helps us make sure we can keep this as quick and as efficient as possible. That being said, we do not want to prevent you from interacting. So, we, of course, have someone manning the chat window that will answer all questions that come through, so please ask them as they come up. And if there are great questions, we&#8217;re gonna tag them, we&#8217;re gonna address them at the end because we do have a Q&amp;A portion that we go through at that time. If you&#8217;d like to interact with us on social, we would love that. Our hashtag that we use on Twitter is #SharpTweet, or you can just tweet @SharpSpring. If something happens, you have to run, you know, an urgent client calls or there&#8217;s a meeting you have to go to, that&#8217;s completely fine. The webinar is recorded and the slides will be distributed after the call. So, you can have that if you like it or wanna share it with a colleague. Of course, we&#8217;re going to distribute all that information. During the call, we do have a survey that we provide at the end, really just asking you, &#8220;What can we do next?&#8221; So, if something that Zack said was really cool and insightful&#8211;and a lot of it is, I think, going to be exciting&#8211;and you wanna know about what he does, you can reach out to him. For the folks that are looking at SharpSpring from a new perspective of, &#8220;Maybe I wanna use this tool in my marketing mix,&#8221; we&#8217;re gonna give you the appropriate channel to get with our team to talk about how to become an agency partner. So, make sure to participate in that survey at the end. So, a few things coming up. For those who are our current agency partners, you know that we have the SpringBoard Live Session, that&#8217;s our weekly how-to sessions on everything about SharpSpring. So, this week, we&#8217;re gonna talk about how to actually optimize a newsletter email and make it work for you. So, we&#8217;ll touch on using dynamic content, dynamic subject lines, using data in your system to send a more relevant message to individuals, lots of cool stuff. And that is in two days, so this Friday. And then we do have an upcoming webinar for the &#8220;Five Pillars of Marketing Automation Success.&#8221; One of the things that we see folks kind of struggle with when they come to SharpSpring is there is&#8230;there&#8217;s so much in the platform, the idea comes, &#8220;Where do we start, and how do we logically progress this to our clients to make it both valuable to them and profitable for us?&#8221; So, we&#8217;re gonna talk about some pillars that we&#8217;ve organized the marketing automation space into, and how you can succeed by following kind of that strategy. If you are a partner who&#8217;s done something really cool and wants to join these sessions, you like doing presentations, you can email Nicole. She is our events manager. And we can get you on the calendar to get something set up.<\/p>\n<p>Bryan: So, quickly, we&#8217;re gonna just do a round of introductions, and I will just introduce myself. So, Bryan Tobin. I&#8217;ve been at SharpSpring about two and a half years at this point. I&#8217;m on the product team. I work with a lot of customers to make sure that you guys are getting the most out of the system. If I haven&#8217;t spoken to you before, it&#8217;s a pleasure to meet you, and if I have, it&#8217;s good to see you on this call. And I kind of lead these webinars from the SharpSpring side, and when questions come about how SharpSpring does something at the end, I go and answer them. Then with that, I&#8217;m actually gonna pass the presenter over to Zack. And Zack, if you wanna say a quick few words about yourself and then move on to presentation, that&#8217;d be great.<\/p>\n<p>Zack: Sounds great. Great to be here with you all. My name is Zack Pawlosky and I&#8217;m the Owner and the I am the President of an advertising agency based in sunny Oshkosh, Wisconsin. I am staring out of the window right now as I&#8217;m talking to you, and it looks like we&#8217;re in a snowglobe and we&#8217;re expecting around 8 to 10 inches of snow today here at Oshkosh, Wisconsin. So, if you&#8217;re somewhere warmer, anything you can do to send some heat to us would be greatly appreciated it. But more on a business level, we&#8217;ve been in business as an advertising agency for about five years. We are approaching about 40 people in staff, and a major part of what we do is digital marketing. We are a full-scale integrated advertising agency that takes place in quite a bit of strategic planning for our clients, but certainly, we get heavily involved as well when it comes to the digital end of things. And I&#8217;m excited to go over some of that today. Feel free to check me out on LinkedIn, or on Twitter as well. Always happy to connect after this as well. So that&#8217;s just a little bit about myself.<\/p>\n<p>Bryan: Okay, so let&#8217;s go on. And, Zack, if you&#8217;re ready to go, we can pass the presentation rights your way.<\/p>\n<p>Zack: Awesome. Okay. Well, thank you, again, everybody. I&#8217;m very excited to be here today. Just a little bit of background. We&#8217;ve been using as an agency, at Candeo, SharpSpring now for just about two years. We&#8217;ve looked at other marketing automation tools in the past and I will tell you, through example, and through action, and through work, we&#8217;ve been absolutely floored with the great things that we found out of SharpSpring. And my goal today is to tell the story about one of our clients and his team, some of the best success out of SharpSpring. And this is a really unique client, niche industry, niche business, with a very niche&#8230;with a very niche focus as well. Now, I am gonna pause here for just a second. If you do hear laughing in the background, or hooping, and hollering, and things like that, this is a advertising group and it gets pretty exciting over here. So, nothing out of the usual there. So, if you are interested in what that is, that&#8217;s what that is. Just so you know. All right. So, we&#8217;re gonna be talking about how do you scale something as grand as marketing automation, as large as marketing automation, from selling a $5 product to a $5 million product? And I have real examples today, real stories about how marketing automation has had a major impact on just that. So let&#8217;s go ahead and dive in.<\/p>\n<p>Zack: So, I&#8217;ll talk a little bit about our plan for the day. We&#8217;re gonna be talking about the tactics, the content, and the strategy used of how we promote items that are $5 all the way up to $5 million. And one phrase that we use here a lot within our team is that when we look at something like marketing automation, it&#8217;s like a rabbit hole. It can be as small or as big as you want it to be. So, we have some clients that use it just for a CRM, we have some clients that just use it for email content and email communications, and we have some clients that&#8230;it had such a major impact on their operations and finances. And I&#8217;m gonna be focusing on a client today that it really has a pretty significant impact on their entire operations. So I wanna talk a little bit about, tactics, content, and strategy. The second thing that I wanna make sure that we cover is how do we scale something like this through an organization? And a client that I&#8217;m gonna be talking about is an international group based in Appleton, Wisconsin, so just a half hour from here in Oshkosh, but they travel the country and they travel the world. And they certainly cater for a very niche and specific audience. And that really plays into our third objective of, you know, how we&#8217;re using marketing automation, and specifically SharpSpring, to help grow a very niche business globally. And then lastly, how are we using something like marketing automation to integrate into customer service, as well as what impact is it having on operations? What ways is it impacting the business for the client? So I&#8217;m excited to go through those objectives today and happy to speak to any more detail as we go through.<\/p>\n<p>Zack: So, that being said, some of the main points that we&#8217;re going to be talking about and covering is we&#8217;re gonna follow the path and the journey of three customers. And all of them are target audiences of this brand. So, how they integrated into the brand and how we ultimately capture, cultivate, and engage these three very different customers with this brand. We&#8217;re gonna talk about how we cater the user content and the automation experience to each target group. You know, as I&#8217;m sure that you&#8217;re all well aware, the age of large-scale content in sending the same piece of content to everybody just doesn&#8217;t work like it used to. So, sending unique and targeted information, how we did that and the strategy behind that. Point three is what are we looking at and what are we analyzing for the benchmarks? And what&#8217;s important to us as an agency as we measure success, and what&#8217;s important to our client, and how are we going through and analyzing that? And then point four is just how we&#8217;re using SharpSpring and the impact that it&#8217;s had on the operations and the finance side at Carved Stone Creations.<\/p>\n<p>Zack: So, that being said, speaking a little bit more about Carved Stone, just to paint you a picture here, Carved Stone Creations is the name of the client that we are talking about. As a quick disclaimer, their site is about five or six years old and it&#8217;s being rebuilt right now. And it&#8217;s gonna be launching in about a month. And so their old site&#8230;definitely needs a lot of improvement, but even with not the best design and set-up, we&#8217;ve still been able to cultivate people and drive business results with something like SharpSpring. So, I use that as a little bit of a disclaimer and as a point where&#8230;the great thing about SharpSpring is that it does a lot of work for you. So, we&#8217;re able to host content and landing pages and things that are right built within the SharpSpring experience. Just a little bit more about this organization. So, they specialize in building, developing, and installing fine stoneware architecture&#8230;architectural pieces, stone fountains, marble staircases. So everything&#8230;and you see this little image here is just a snippet of what they do. So, if you&#8217;ve ever been to a house, or a country club, or a museum, or something like that where it&#8217;s absolutely jaw-droppingly gorgeous and they have these big marble staircases and these big stone fountains, that&#8217;s probably done by somebody like Carved Stone Creations. And they do an excellent job at it. So, they sell and install items like this all over the nation, and actually, all over the world. Just to paint a picture for you. That little white domed piece there you see kind of in the lower right-hand corner there, you know, I mean, that&#8217;s worth quite a bit of money. So, they&#8217;re really catering to a very wealthy audience and to a very unique group of people all over the place. And it&#8217;s not just consumers and the average consumer, it&#8217;s also different organizations like hotels, and country clubs, and golf clubs, and things like that. So, they deal with a very niche percentage of the population. And when they originally came to us, they asked the question, &#8220;Well, how do we reach a very niche group and a very niche group of people all over the world?&#8221; And, you know, if you look at some of their average things that they&#8217;re selling to both businesses and consumers, they easily get up into the millions very quickly for some of their finer items. So, that just kind of gives you a little bit of a background of this organization. So, very niche, not for everybody, and they are&#8230;and they certainly have a very targeted audience based off of income level.<\/p>\n<p>Zack: And the reason Carved Stone Creations came to us originally is a lot of the traditional marketing that they were engaging with, whether it be trade shows, whether it be different print publications, large-scale email marketing or digital, just wasn&#8217;t doing it for them, and it wasn&#8217;t generating the results that they were looking for. And to that extent, they didn&#8217;t have the ability to measure and analyze the return on investment that they were receiving. So, when we brought them the solution of SharpSpring, they saw it to be incredibly valuable, not only from the ability to manage, and generate, and cultivate great profit in sales, but it was also an excellent opportunity to really understand what&#8230;you know, &#8220;From all the dollars that we&#8217;re spending, what&#8217;s having an impact and what&#8217;s not? And how can we make every marketing investment that we spend really work for the brand?&#8221; And we&#8217;re constantly going through to cut that and find out what does not work and what does. So, that&#8217;s originally how it came about. But I wanna tell you a story about the three average customers that Carved Stone Creations faces, and how we use marketing automation to really engage with these different audiences and ultimately cultivate them. And the thing that I love about this is that SharpSpring recently launched a new feature within the system called Personas. And it allows you to really identify who you wanna target, and paint a really clear picture of your target group so that you can use a tool like SharpSpring to better target them. So, as we get into the three groups, let&#8217;s start with the first person.<\/p>\n<p>Zack: The first person is called New Nozzle Nelly. So, we have this beautiful fountain, huge fountain, and it needs something, a very small, minor part. It just needs a nozzle. It needs a new nozzle because the old one broke. Our friend here, Nelly is not an existing customer of SharpSpring. In fact, she&#8217;s really not even heard of&#8230;I&#8217;m sorry. She&#8217;s not an existing customer of Carved Stone, and she&#8217;s not really heard of them before. But as she&#8217;s going out into Google, she&#8217;s beginning to search online and through her social media to find a very unique niche replacement part for a nozzle. So, she&#8217;s out there, and we&#8217;re using different digital marketing tactics and different additional advertising tactics like social media remarketing, general web retargeting, things like that to ultimately capture that person. And what we&#8217;ve done is we&#8217;ve brought Nelly into a landing page that we built in SharpSpring to educate her about all of the options in the fast shipping speeds and the pricing options for that one single part that she is looking for. And we were able to identify that by finding out that there is a large community out there that is looking for very specific parts. So, we built part of the landing page experience and the marketing automation experience through the idea of beginning to capture people who are not familiar with the Carved Stone brand and engaging with them early on. And engaging with them at a level of $5, or $10, and then eventually growing those people through the sophisticated suite of marketing automation, and cultivating that content, and turning them into eventually larger customers. So, she&#8217;s in a high-tier income household. She&#8217;s looking to replace an old part, and our goal is to capture her with fast speeds, a great price, and then begin to capture her information in the system. So, we used customized landing pages, we begin to use digital remarketing and email follow-ups generated out of SharpSpring to continue to educate this person on the offerings that Carved Stone has. And there&#8217;s really not a huge impact that it&#8217;s had operationally on the organization at all. And we&#8217;re very comfortable with the fact that, you know, it&#8217;s gonna take us a year to almost two years to convert this person to a large paying customer. So, to convert them from $5, to $5,000, to $50,000, to $500,000, it takes us a long time. So, we really have strategically tested, mapped out, we&#8217;ve done some A\/B testing on, &#8220;How do we best capture, and educate, and continue to fuel content to someone like this target person here?&#8221; So, we start at the very bottom of the scale to begin to capture somebody like New Nozzle Nelly. So, that&#8217;s one of our target groups that we really speak to and target.<\/p>\n<p>Zack: I wanted to show you some screenshots of some of the landing pages that we have built. We focus on big imagery, telling stories, building envy, you know, really playing on people&#8217;s emotions to build something beautiful in their home or outside of their home, or something like that. But we keep it really simple, within the different email content and the landing pages. They have the opportunity to tap through and learn more about specific items as well. As we&#8217;re doing that within SharpSpring, we&#8217;re tracking all of that, and we keep an eye on all of that the entire time as we&#8217;re learning more about that customer that&#8217;s going through that marketing automation experience.<\/p>\n<p>Zack: Now, the next person, the next story that I wanna tell you, is our next target audience. Our first one was New Nozzle Nelly, our next one, number two is Assistant Andy. Assistant Andy is not the check signer, he&#8217;s not the one actually making the purchasing choice, but we have found that this has been the most effective person that we have really begun to target and speak to. This is someone who works for, like, the head of an organization or a business such as a country club, or he works for somebody else, and oftentimes the person tasked with doing the research to find out what&#8217;s gonna be the best product that that person is looking for. So, often times, what will happen is the owner of a home or the owner of an organization will go to their assistant and say, &#8220;You know, I have seen a beautiful fountain or a staircase. Can you do some research out there and find me a couple of different companies that offer something like this?&#8221; And so, Andy has a lot of pressure on him. So, he&#8217;s tasked with finding the best of speed, the best quality, the best price, because the person that tasked them to do that job is going to trust that person&#8217;s instinct, Andy&#8217;s instinct on what would be the best fit for them because they&#8217;re spending quite a bit of money on these items. So, he&#8217;s oftentimes doing a lot of the online research. So, he&#8217;s not a quick sell. He&#8217;s doing a lot of reading, he&#8217;s reading a lot of reviews, he&#8217;s watching a lot of stories. So, this definitely&#8230;once we&#8217;re able to capture somebody like this through things like paid search, organic search, bring them into a SharpSpring landing page, match them up to a Persona that we have within the SharpSpring environment, this automatically kicks off the opportunity to alert somebody in sales to begin to communicate with Andy. And helping him through that daunting job of finding the information, making sure it&#8217;s accurate, finding the right price speed, location, all of those things. But when that salesperson calls Andy, they already have a great view and have learned a lot about Andy. So, they&#8217;ve looked up his LinkedIn, they&#8217;ve pulled in his Facebook, they see the information that he&#8217;s putting through the forms, where he&#8217;s been spending his time on the website. So, SharpSpring really empowers that salesperson with quite a bit of knowledge on&#8230;as they&#8217;re beginning to help Andy through that informational finding process. We definitely keep a close eye on the lead score of Andy. So, depending if Andy is looking at a piece that is worth $5 million or $50,000, that&#8217;s gonna assign him to a certain type of salesperson. So, if Andy is looking at a $50,000 fountain, then he&#8217;s gonna go to someone that&#8217;s a little bit more junior in their sales role, but if they are starting to look at something that&#8217;s more closer to the 5 million line, then he&#8217;s gonna go to the owner, or to a more senior salesperson. So, it really helps assign the right people at the right time. And I don&#8217;t know if any of you have ever encountered, or heard about, or had a tough time with the wrong salesperson or the wrong staff person being tied to the wrong opportunity. But it really helps solve some of those issues. And then we really customize the email campaign that we engage with with Andy. So, we&#8217;re very specific about the type of content that we send to Andy and give to Andy. And the content really reflects all around how we can help make the choice easier, the research easier. &#8220;Here&#8217;s all the facts. Here&#8217;s what you need to know,&#8221; really giving Andy the peace of mind that he&#8217;s gonna bring forth the right choice for the person who originally tasked him with that. So, we work fast with Andy, we&#8217;re very clear. There&#8217;s no real sales lingo at all. You know, ultimately we&#8217;re trying to build trust. And when we were talking about New Nozzle Nelly, you know, that takes us a year to two years. This takes us about three months. So, really customizing to the speed that we engage with these different target groups.<\/p>\n<p>Zack: So, I wanted to just show you an example. This is a screenshot I pulled. And the thing that we love is that when the salespeople are engaging with these different individuals and different opportunities for sales, they&#8217;re able to really take a deep dive and a deep look into, &#8220;Who is engaging with the brand? What are they reading? What are they opening? What pages are they spending time on? What forms are they filling out?&#8221; And that&#8217;s one thing that we absolutely love about SharpSpring is how visual it is, not only for ourselves, but for our accounts as well. So, here&#8217;s a real look at the lead tracking, the lead engagement that this account uses specifically.<\/p>\n<p>Zack: And the last story that I wanna tell you is about my dear friend, or I wish he was my dear friend, Millionaire Marty. So, this is our check signer. This is the guy who has no issue spending half a million dollars or more on a fountain, or a stairwell, or something like that. This guy is often over the age of 60. He cares a lot about the history of a product, the aesthetic. And to be honest, it&#8217;s really about the look and the appeal that comes with installing a unique item like that that is of such high value. So, with Millionaire Marty, we really focus on developing visual landing pages, telling story through imagery, photography, and definite unique videography. And so our multimedia team here goes through every couple of months, and we engage in different photography, videography to really build that product and the brand and to get someone like Marty excited about the posh, and the polished, and the excitement that comes with&#8230;to invest in something like this with Carved Stone. It&#8217;s a slow email campaign, very media-heavy. We&#8217;re not really asking for him to call now, or engage now, or there&#8217;s no real heavy call to action there because oftentimes Marty, we found through research, and we&#8217;ve done a lot of research on this to support this thought, is going to task the legwork of this to somebody else. So, there&#8217;s no sense for us to spend too much of our time or our resources trying to sell to Marty. And we&#8217;re just trying to sell him on the brand and the effect that the product is going to have on his life. So, we give him the ability to task it to somebody else. We keep the information very clear. We don&#8217;t talk about price at all, we just talk about experience, and we get to the actual details later on. When we capture someone like Marty, it&#8217;s not as often, but it&#8217;s escalated immediately to the highest salesperson or to the owner as an opportunity to touch base with that person or that individual.<\/p>\n<p>Zack: So, as you can see, these are two&#8230;they&#8217;re, excuse me, they&#8217;re three radically groups scaling all the way to $5 to $5 million. And when I say $5 million, I&#8217;m actually proud to say that they have sold something, the company I&#8217;m talking about has actually sold something in the past that&#8217;s worth $5 million through SharpSpring. So, it&#8217;s pretty incredible. But when you can really get to know your target audience, understand their habits, what they need, how it can make their life easier, and then do the research to support the thought behind that and then continually&#8230;excuse me, continually tweak, update, and continue to adjust your sales pipeline, your marketing automation flows. You know, every other week, every month, sit down and put it all back on the table. Ask questions about Marty, and Andy, and Nelly. You know, have their needs changed? What&#8217;s going on in the local marketplace, the national marketplace, the trends of the marketplace that are impacting the choices that these people are making? So, we spend a lot of time talking about these three. You know, we don&#8217;t spend a lot of time talking about the product, we don&#8217;t spend a lot of time talking about the process, we spend a lot of time talking about the target. And for this client in particular, it&#8217;s done very well.<\/p>\n<p>Zack: So, let&#8217;s talk a little bit about how we measure success. And between us and the account that we work with, there is a big question out there. &#8220;Gosh, we&#8217;re spending a lot of money on digital advertising and on you guys,&#8221; and &#8220;you guys&#8221; being us as an ad agency. &#8220;How can we make sure that we&#8217;re getting the most value for our dollar?&#8221; And I&#8217;ll tell you, the five years that we&#8217;ve been in business, and the other ad agencies that we have worked with, we&#8217;ve never found a tool like this in the past, where we&#8217;ve been able to demonstrate ROI as clearly as we have. And we absolutely love that. It helps give peace of mind to ourselves as well as to the accounts that we serve.<\/p>\n<p>So, from a business standpoint, it allows us to really understand, using the sales pipeline feature within SharpSpring, what sales forecasting looks like and the financial impact that it&#8217;s gonna have on your organization. So, you know, if it takes me 24 months to sell someone like Nelly, I&#8217;m able to get a really good picture of, well, what does the opportunity look like 12 months from now, or 24 months from now as well. From the salesperson&#8217;s standpoint, it helps to understand the win and loss rate. &#8220;Why did we win certain business? Why did we lose certain business? What&#8217;s the volume of sales by individual team members as well?&#8221; It&#8217;s a closer engagement between marketing and sales. And I&#8217;m sure we&#8217;ve all had a conversation struggle with it at some point, trying to build a bridge constantly between the marketing team and the sales team. And I&#8217;m pretty happy. And then we also put a lot of focus in studying what kind of revenue are we gaining from each of the three groups? So, from Nelly, Andy and from Marty, what group is bringing us the most opportunity? So, it also helps us understand the value in the three target groups as well. And then lastly, it helped us focus on the cost per acquisition. So, with all the advertising dollars that we&#8217;re spending, both in digital and traditional, how much is it costing us to convert a lead into a sale, and what does that margin ultimately look like? From a marketing standpoint, we study how qualified are the leads that we get? What is our ratio from&#8230;to convert traffic and turn them into a lead within the marketing automation cycle? How do the social analytics, remarketing analytics, search analytics correlate to the success or lack of success that we&#8217;re seeing within the SharpSpring system? What kind of page engagement are we seeing on the landing pages? What kind of engagement are we seeing within the pieces of content that we put out via email? And then we also have the pleasure of plugging in other tools as well, such as heat mapping tools, such as phone number use tools to track the amount of usage when it comes to phone numbers. Things like that. So, we are definitely seeing a lot of success when we dedicate the time and dedicate the resources to measuring the results from the business standpoint and the marketing standpoint.<\/p>\n<p>Zack: So just a couple of more things. This has definitely had a major impact on the operations and the salesforce within this organization and have helped grow that as well. So from a finance and operations standpoint, it allows for them to forecast and have a better understanding of future sales opportunities, so the plan for that. It helps them a lot with inventory. It&#8217;s not a fun thing when you have millions of dollars sitting in your inventory that&#8217;s not moving. So, this really has a huge impact on them to help them understand how to move inventory a little bit faster. And then, of course, we as an agency sit down with them to update them on the new features that seem to be constantly coming up from SharpSpring.<\/p>\n<p>From the sales and customer service standpoint, the leaders of the service side of the business sweep through to verify that we&#8217;re taking their past customers, current customers, and future customers. We work with specific sales teams to&#8230;to make sure that we&#8217;re assigning the right kind of lead and opportunity to the right salesperson. And then we really engage with the entire team at Carved Stone, everyone from the front desk operators all the way to the owner, to engage with, understand, and utilize the different features within the SharpSpring system.<\/p>\n<p>Zack: And that being said, that gives you an idea of how we&#8217;ve been using some of the targeting features and unique Persona features of how we can best utilize, engage with, and target the unique users out there for a very niche business, international business like Carved Stone. Thank you for taking the time to hear the stories today. I certainly hope that you got something from that, and I believe, we&#8217;re gonna open up to question and answer now.<\/p>\n<p>Bryan: So, some&#8230;the big thing is the idea of different approaches for different clients that we talked about earlier as far as a takeaway. So, Zack had a unique perspective of working with this customer and kind of finding their niche with this personalized content landing page and email messaging. So getting the fish on that hook, and the fish on the hook in that regard was a good segue into marketing automation. But just be open to the fact that some other customers will need different kind of entry points, but once they get in, this was such a great roadmap of how you can make the solutions sticky with them by providing value. The three average customers is fantastic. So, I know when Personas came out, a lot of questions that came in from our customers were, &#8220;Well, how is this applicable to my business?&#8221; And at the end of the day, every business has a target market. And I thought the three examples, especially kind of, again, a very niche market that you&#8217;re working with out there was valuable, because it shows that really how universal the idea of personas are. It&#8217;s just thinking about the target market. When you said that you think about who you&#8217;re selling to more than the product, that is the marketing arm is identifying the target market and then creating content to capitalize on them. And the last thing I just wanted to reiterate was the idea of revisiting the personas, as you mentioned. So, you know, everything is a process, and things are gonna change, and there&#8217;s trial and error, whether it&#8217;s the market changing, as you directly spoke to, or maybe based on the campaigns that you&#8217;ve had and you&#8217;re seeing results that kind of differ from what you were expecting. Don&#8217;t think that once you build your personas, you&#8217;re never gonna revisit them. If do you it, it&#8217;s like anything, it just sits on the shelf and it becomes stagnant and outdated. So, make sure there&#8217;s some sort of 3-month, 6-month, 12-month process, to go back in and just re-evaluate these personas that you set up, and make sure that they&#8217;re still hitting your target market.<\/p>\n<p>Bryan: So, at this point, we&#8217;re gonna open up for some Q&amp;A, and the Q&amp;A is kind of unique. Half the questions come to SharpSpring, and half of them will come to Zack, if they&#8217;re related to you. So, we&#8217;re gonna start going through them now. So, the first one that I have is, for the landing pages specifically, they are curious if you&#8217;re using the actual SharpSpring landing page builder or you&#8217;re using a separate landing page builder, then integrating that with SharpSpring and tracking it?<\/p>\n<p>Zack: We are using the SharpSpring landing page builder now. We&#8217;re a little spoiled here, in that I have a team of web developers, programmers, and artists, that can really kind of jump on that pretty quickly and has the ability to make adjustments on the fly and really spend the time to customize it. So, yes, those are built in-house. Oh, I&#8217;m sorry. Yes, those are all built in SharpSpring.<\/p>\n<p>Bryan: Yeah. And then for the folks that are&#8230;it&#8217;s kind of a great testimonial to what the landing page tool can do, but if you&#8230;for the folks here that have other tools, that you&#8217;re in love with or have a CMS like WordPress, Drupal, Joomla that you like building pages in, again, we can work with all of them. But it&#8217;s very cool to see that stuff built in SharpSpring&#8217;s own landing page tool, because, again, it provides the additional utility within it. So, Zack, the next one is for you as well. So, in addition to kind of the&#8230;the content creation that you&#8217;re using on the website and the emails, any other best practices for inbound tools that you&#8217;ve used that worked well with SharpSpring and for your clients?<\/p>\n<p>Zack: Yes. You know, and you&#8230;and you talked a little bit about this earlier. You know, I mean, we try new stuff all the time. And we really work with our clients to get them to the point where they&#8217;re comfortable to say, &#8220;You know, we&#8217;re gonna spend a little money on some risky stuff, and it might not work.&#8221; And, you know, in the age that we&#8217;re in now, you&#8217;ve gotta feel comfortable with that, to try out new forms of advertising, or even new forms of different mediums. You know, we are starting to experiment with them now on like augmented reality, virtual reality, anything just to continue to keep the brand relevant. But we use a lot of different mediums and inbound tools to keep the group&#8230;or to keep the customer intrigued, and we change that quite a bit. Organic search continues to be huge for us. I would say maybe that generates 60% of our leads. And we have taken years to really build up those rankings. And that&#8217;s been really big. We do quite a bit in digital remarketing, social remarketing. We find a lot of success through different social media outlets. And the other piece of success that we&#8217;ve had is really blending it in with their sales culture and their staff. So, we learned really quickly to not just slap on SharpSpring and, you know, and to say, &#8220;Here are some leads.&#8221; You know, it takes some legwork and some education early on to get everybody on the same page. And it&#8217;s failed for us in the past when we didn&#8217;t do it that way. So, to get people trained, to get people excited, and really blend in the operations part of it and the sales part of it as well. So, I hope that helps answer the inbound tools. So to recap real fast, primarily, organic search, a little bit of digital as well. We have built an API for a print tool that will draft something in print as well for our target group of Marty, who&#8217;s kind of a print guy still. So, we definitely haven&#8217;t turned our backs to that side as well.<\/p>\n<p>Bryan: And the key thing here they talked about with the different tactics that we&#8217;re using, track them all in SharpSpring. As Zack mentioned, organic search is still usually really valuable in getting folks to find out your brand. But especially when we&#8217;re getting people into SharpSpring and kind of understanding how to use the tool, I think you just mentioned the same thing about if we try to go this waterfall approach with customers, it can be a little bit too much and it&#8217;s overwhelming. And that&#8217;s where it gets to that point of failure. So, kind of piggybacking off this when we&#8217;re talking about the inbound strategies that we can use to make our customer&#8217;s brand more&#8230;build awareness around that brand, so kind of that top and middle of the funnel sections. Make sure we&#8217;re tracking all that because that&#8217;s a great way to start proving ROI from the tool.<\/p>\n<p>Bryan: So the next one I have is kind of a fun one, again, for you Zack. So, when you created these three personas, these three buyer types for your customer, what was your process? How did you start that conversation, how did you identify the persona types, and what was your overall methodology?<\/p>\n<p>Zack: The good news is that Carved Stone has definitely been in business for many years, so they were able to share with us some of that insight, but we really dig in with our clients to say, &#8220;Well, you know, who is really not only the buyer and the check signer, but who has the influence?&#8221; You know, one person I did not talk about is the spouse of not only New Nozzle Nelly but also Millionaire Marty as well. The spouse has huge influence in all of this. So, you know, first, we dig into what the account knows already, and we spend a lot of time with them. And we have a very set system here of how we kind of crack through that to get to the real answer. Again, we&#8217;re a little spoiled here. We do have a research team here on staff that conducts both qualitative and quantitative research to really wrap our heads around the target group. And so we conduct multiple A\/B tests, we conduct multiple polls, we do a lot of heat mapping, and we study the data on a pretty regular basis. So, you know, we spend maybe 20% of our time viewing research to kindly loosely shape up who we want to target, but then the other 80% is just start, and just jump in, and just keep going, and find out who&#8217;s finding the most value from the effort that you are&#8230;that you are putting out there and who is not. I think we started with 10 different groups that we were hoping to target, and it&#8217;s down now just to 3 people in general. So, a lot of it is just to&#8230;just to start it and to find out, and then consistently set a system of how you measure and analyze how people find that content to be valuable.<\/p>\n<p>Bryan: So, the idea of the multiple folks that then drill down to three, we actually have the same use case here at SharpSpring we were using defining our own personas, so we&#8230;that&#8217;s something, I think, a lot of us are gonna encounter, because when you ask that initial question to your client, &#8220;Who do you sell to?&#8221; you know, they hopefully have a good number of responses, and if they don&#8217;t, then we kind of probe. And one of the good questions that I found to kind of get people thinking, really Zack nailed it with the influence. So, who has the influence over the purchasing decision? And then kind of drilling down from there, what is their level of influence? So, are they&#8230;you know, if we&#8217;re using sales terms, like, are they a detractor? Are they a sponsor? Are they a power sponsor? Are they an advocate? How do they feel about whatever the product service deliverable is going to be, and how do they contribute to the idea of someone saying yes to that? So this concept of who makes or contributes to the decision is a good starting point. It could just be one individual. Say it&#8217;s like a B2C good. But then the idea comes, &#8220;Well, what is unique about our service that people want to buy it or use it, and then what are the different avenues that they would then use it for?&#8221; You know, at SharpSpring, we&#8217;re kind of spoiled because the tool does so much, so we have a very broad horizon of ways people can find out about us and learn our tool, which is good on one part because we have a good pool of personas to build from, but it&#8217;s bad because if you have too many personas, you actually don&#8217;t have any. So, we had to drill down from 20 that we started with to and we now have seven in our system. There are seven different buyer types that we use the information and the Persona tool for.<\/p>\n<p>So, the next question that we have is a&#8230;so, when you were talking about the emails, could you give us a few examples of how you changed the content around within those emails for each persona? You mentioned this about the landing pages about for the primary decision-maker but you used a lot of imagery. Is it a similar tactic in email, so changing out call to actions, using different images? Is it more copy-oriented? What is your approach there?<\/p>\n<p>Zack: Oh, that&#8217;s a great question. And we have a lot of fun with that. And I guess you need to be the own definer of your term &#8220;fun,&#8221; but we go through&#8230;and we really change that based on who we&#8217;re talking to. So, if we&#8217;re talking to Marty, you know, there&#8217;s not a lot of buttons in there, there&#8217;s no &#8220;Call now.&#8221; I mean, we&#8217;re really focusing on the brand experience. We talk about, if Marty lives in Los Angeles, &#8220;Well, here&#8217;s some other work that we just did in Los Angeles.&#8221; If we&#8217;re talking to Andy, there&#8217;s not a lot of imagery in there. It&#8217;s a lot of texts, a lot of&#8230;and they&#8217;re fast. I mean, there may be five sentences in there. He&#8217;s busy. I mean, this is one of many tasks that he has, and there&#8217;s a lot of pressure that he has on his shoulders. So we really try to get in the head of this person. When we&#8217;re talking with Nelly, we wanna grow Nelly over a year. So we&#8217;re focusing on the best way to grow that sale. So, we&#8217;re focusing on offers, sales, testimonials, things like that. So, not only do we customize the targets of these three different groups, we also really customize the speed of the emails, the frequency. You know, with Andy, we send them an email every single day. With Marty, it&#8217;s probably once a quarter. And we only learn that through starting out with&#8230;starting them all at&#8230;each starting at one email per month, and then we begin to shape based off of that. So, definitely our content in each email, the voice of content and the styling of that content will change every single time.<\/p>\n<p>Bryan: And it really is similar to how we&#8217;re setting these up for landing pages. So just think of how we&#8217;re gonna send that message to a customer. Some folks have more time than others to read messaging. We do the same thing for the executives that we send messaging to. So they have a smaller, more concise message instead of this incredibly long message that they might not read because it&#8217;s overwhelming and they don&#8217;t have the time for it. So that&#8217;s a great example of tailoring the content based on the recipient.<\/p>\n<p>So, the next one I actually kind of thought about during the call as well. So, a lot of what you were using here, it seems like you&#8217;re setting this up for your client to get their use. You know, that&#8217;s kind of your role in their marketing strategy. How does the client actually use SharpSpring? Are they using it, or is it a completely managed service offering that you&#8217;re doing it for them? And if they are using it, what parts are they actually using?<\/p>\n<p>Zack: Great question. Every client for us is a little bit different, and some are really involved and they&#8217;re in it all the time. And the client I talked about today is really in it all the time, and they love it. But there are some that are completely hands-off, and they don&#8217;t wanna touch it. And to the point where, within our agency, we have dedicated a full-time support person for the different accounts that we have involved to just support coach, manage, lead, help our different accounts externally as well as staff internally through this tool as well. But in this case, they&#8217;re in it constantly. So, for example, if a new person calls in and asks for information, the person at the front desk is gonna input that information. And they&#8217;re going to take that information and put them in as a contact within the system itself. All the way up to if the salesperson is doing some cold calling on the road, they use it as their sales manager and their CRM tool as well. So, in many ways, it&#8217;s very versatile in many different ways. And so it really depends on the needs of the client. And not all of our accounts really fully use every piece of the tool either, but we really try to drill into the accounts that we feel like this would be a good fit for is to say, &#8220;You know, hey, this isn&#8217;t a tool that you can just begin to pay for each month and, you know, kind of hangs out there. It is an operational change. And it&#8217;s a financial impact, and it&#8217;s a different way of conducting sales and marketing.&#8221; And when we explain that, they see a lot of value in that. And they definitely see a lot of value to bridge the gap between the sales team and the team when it comes to advertising and marketing because they can finally begin to work hand-in-hand on some of these jobs.<\/p>\n<p>Bryan: And that&#8217;s kind of what it&#8217;s all about, is the integration between the sales and marketing process because on the sales side it helps them out a lot more because they&#8230;even something as simple as life of the lead and understanding what people are viewing and clicking on and doing, it lets that salesperson have more effective conversations, which solves their problem because, if any of us have talked to a salesperson who had a bad lead, we know how those conversations go, and they&#8217;re not positive. And we also know the marketing side, that their job is to generate good leads. So the ability to track what leads are actually closing when they&#8217;re closing, what is the average time to close, all that information helps the marketing team optimize their process. So, the integration is kind of the key selling point of why this tool is important. But as you said, Zack, it&#8217;s some folks are gonna use certain parts, some folks are gonna use other parts. As long they&#8217;re getting value from the tool and they&#8217;re having better conversations, more personalized conversations because of it, you know, that&#8217;s what makes us happy, and that&#8217;s what makes you guys successful.<\/p>\n<p>So that was the last question that we&#8217;re taking for kind of this forum portion and everything else. We have a few more that came in just here at the end. We&#8217;re gonna answer them offline. Zack, I thought this was fantastic. Thank you so much for sharing. Any closing remarks before we go ahead and shut down?<\/p>\n<p>Zack: No. Thanks all for hanging out with me for the time that you did. It was like most of you stuck around, so I really appreciate that. Of course, if there&#8217;s anything else that I can ever do, feel free to ping anything off of me, always happy to help. It&#8217;s fantastic to work with SharpSpring. One last testimonial for them, and I promise you, they&#8217;re not paying me to say this. We&#8217;ve been floored. So, thank you for the time, thank you for the opportunity, and I definitely, sincerely wish you all much success.<\/p>\n<p>Bryan: And thank you, Zack. And that check is in the mail, so maybe we are paying you for it. Clearly, just kidding. But, guys, again, we&#8217;re big advocates of reaching out and continuing the conversation. Here&#8217;s the contact information to do so. There&#8217;s Zack&#8217;s information at the top. If you have a SharpSpring question, there&#8217;s my information at the bottom. And, again, thank you all for attending. We hope to see you on the next webinar. And, Zack, one more time, thank you again.[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/2&#8243; offset=&#8221;vc_col-lg-5 vc_col-md-6 vc_col-xs-12&#8243; css=&#8221;.vc_custom_1514495099070{margin-top: 0px !important;padding-top: 0px !important;}&#8221;][vc_column_text]<div role=\"form\" class=\"wpcf7\" id=\"wpcf7-f22224-o1\" lang=\"en-US\" dir=\"ltr\">\n<div class=\"screen-reader-response\"><\/div>\n<form action=\"\/wp-json\/wp\/v2\/resource\/94455#wpcf7-f22224-o1\" method=\"post\" class=\"wpcf7-form\" novalidate=\"novalidate\" id=\"MA22224\">\n<div style=\"display: none;\">\n<input type=\"hidden\" name=\"_wpcf7\" value=\"22224\" \/>\n<input type=\"hidden\" name=\"_wpcf7_version\" value=\"4.8.71\" \/>\n<input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" \/>\n<input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f22224-o1\" \/>\n<input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" \/>\n<input type=\"hidden\" name=\"_wpcf7_nonce\" value=\"1145ad0f22\" \/>\n<\/div>\n<div class=\"myform alternatives-form\">\n<h3 class=\"form-heading\" >Watch it now<\/h3>\n<p><label> First*<br \/>\n    <span class=\"wpcf7-form-control-wrap firstName\"><input type=\"text\" name=\"firstName\" value=\"\" size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-validates-as-required form-control\" data-cookie=\"1\" aria-required=\"true\" aria-invalid=\"false\" \/><\/span> <\/label><\/p>\n<p><label> Last*<br \/>\n    <span class=\"wpcf7-form-control-wrap lastName\"><input type=\"text\" name=\"lastName\" value=\"\" size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-validates-as-required form-control\" data-cookie=\"1\" aria-required=\"true\" aria-invalid=\"false\" \/><\/span> <\/label><\/p>\n<p><label>Email*<br \/>\n    <span class=\"wpcf7-form-control-wrap email\"><input type=\"email\" name=\"email\" value=\"\" size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email form-control\" data-cookie=\"1\" aria-required=\"true\" aria-invalid=\"false\" \/><\/span> <\/label><\/p>\n<p><label> Company*<br \/>\n    <span class=\"wpcf7-form-control-wrap company\"><input type=\"text\" name=\"company\" value=\"\" size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-validates-as-required form-control\" data-cookie=\"1\" aria-required=\"true\" aria-invalid=\"false\" \/><\/span> <\/label><\/p>\n<p><label> Phone*<br \/>\n<span class=\"wpcf7-form-control-wrap phone\"><input type=\"tel\" name=\"phone\" value=\"\" size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-tel wpcf7-validates-as-required wpcf7-validates-as-tel form-control\" data-cookie=\"1\" aria-required=\"true\" aria-invalid=\"false\" \/><\/span><\/label><\/p>\n<p>Do you work at a marketing agency?*<br \/>\n<span class=\"wpcf7-form-control-wrap marketing_firm_539daa9e7acc5\"><span class=\"wpcf7-form-control wpcf7-radio\" id=\"marketingfirm\"><span class=\"wpcf7-list-item first\"><span class=\"wpcf7-list-item-label\">yes<\/span><input type=\"radio\" name=\"marketing_firm_539daa9e7acc5\" value=\"yes\" \/><\/span><span class=\"wpcf7-list-item last\"><span class=\"wpcf7-list-item-label\">no<\/span><input type=\"radio\" name=\"marketing_firm_539daa9e7acc5\" value=\"no\" \/><\/span><\/span><\/span><\/p>\n<p>Sign up for a live demo of SharpSpring?*<br \/>\n<span class=\"wpcf7-form-control-wrap demo\"><span class=\"wpcf7-form-control wpcf7-radio\" id=\"demo\"><span class=\"wpcf7-list-item first\"><span class=\"wpcf7-list-item-label\">Yes<\/span><input type=\"radio\" name=\"demo\" value=\"Yes\" \/><\/span><span class=\"wpcf7-list-item last\"><span class=\"wpcf7-list-item-label\">No<\/span><input type=\"radio\" name=\"demo\" value=\"No\" \/><\/span><\/span><\/span><\/p>\n<input type=\"hidden\" name=\"SharpSpring_Whitepaper_Downloaded\" value=\"our on-demand webinar\" class=\"wpcf7-form-control wpcf7-hidden\" \/>\n<p class=\"nomar\"><input type=\"submit\" value=\"Watch Webinar\" class=\"wpcf7-form-control wpcf7-submit submit_button\" \/><\/p>\n<p class=\"trust\"><span>We’re committed to keeping your info safe. <a href=\"\/legal\/privacy\/\">Privacy Policy<\/a><\/span><\/p>\n<\/div>\n<div class=\"wpcf7-response-output wpcf7-display-none\"><\/div><\/form><\/div><br \/>\n  <div class=\"ik_ssnoform_scripts\" style=\"display:none;\">\n    <script type=\"text\/javascript\">\n      var __ss_noform = __ss_noform || [];\n      __ss_noform.push(['baseURI', 'https:\/\/app-724KI.marketingautomation.services\/webforms\/receivePostback\/MwYA\/']);\n      __ss_noform.push(['submitType', 'manual']);\n    <\/script>\n    <script type=\"text\/javascript\" src=\"https:\/\/koi-724KI.marketingautomation.services\/client\/noform.js?ver=1.24\" ><\/script>\n          <span class=\"ik_ssnoform_redirect way2\" data-id=\"MA22224\" data-token=\"8edac39f-c72f-4fd0-afd5-a4a8235fdb52\" data-redirectyesyes=\"\/resources\/webinar-on-demand-agency\/?referrer=webinar3117\" data-redirectyesno=\"\/resources\/webinar-on-demand-business\/?referrer=webinar3117\" data-redirectnoyes=\"\/resources\/get-a-demo-agency\/?referrer=webinar3117\" data-redirectnono=\"\/resources\/get-a-demo-business\/?referrer=webinar3117\" data-confirm=\"\"><\/span>\n      <\/div>\n  [\/vc_column_text][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; css=&#8221;.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_column]<div data-post-id='175094' class='insert-page insert-page-175094 '><style type=\"text\/css\" data-type=\"vc_custom-css\">.repeatable-module-cta-footer h3 {\r\n    font-size: 56px !important;\r\n    font-weight: 300;\r\n    line-height: 1.2;\r\n}<\/style><style type=\"text\/css\" data-type=\"vc_shortcodes-custom-css\">.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}<\/style><p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; css=&#8221;.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_column]<div class=\"jumbotron txt-dark repeatable-module-cta-footer jumbotron-center jumbotron-large jumbotron-no-border-radius\"   ><\/p>\n<h3>Ready to learn more?<\/h3>\n<p>Month-to-month options. No long-term contract required.<\/p>\n<a class=\"button button-3d full-rounded orange-dark\" href=\"\/get-a-demo\/\" target=\"_self\"  ><span>START HERE<\/span><\/a><\/div>[\/vc_column][\/vc_row]<\/p>\n<\/div>[\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row&#8221; content_placement=&#8221;bottom&#8221; css=&#8221;.vc_custom_1507576953754{border-bottom-width: 5px !important;padding-top: 80px !important;padding-bottom: 80px !important;background-image: url(https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2018\/02\/single-resource-page-bg-colorol-1902&#215;496.jpg) !important;background-position: center !important;background-repeat: no-repeat !important;background-size: cover !important;border-bottom-color: #f5f5f5 !important;border-bottom-style: solid !important;}&#8221;][vc_column width=&#8221;1\/2&#8243; offset=&#8221;vc_col-lg-7 vc_col-md-6 vc_col-sm-offset-0 vc_col-xs-12&#8243; css=&#8221;.vc_custom_1504895160519{margin-top: 0px !important;margin-bottom: 0px !important;padding-top: 0px !important;padding-right: 10% !important;padding-bottom: 0px !important;}&#8221;][vc_empty_space height=&#8221;90px&#8221; el_class=&#8221;sm-hide&#8221;][vc_empty_space height=&#8221;35px&#8221; el_class=&#8221;sm-hide&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243; offset=&#8221;vc_col-lg-5 vc_col-md-6 vc_col-xs-12&#8243;][vc_column_text css=&#8221;.vc_custom_1512065808919{margin-top: 0px !important;margin-bottom: 0px !important;padding-top: 30px !important;padding-right: 30px !important;padding-bottom: [&hellip;]<\/p>\n","protected":false},"featured_media":160303,"template":"","meta":[],"resourcecategory":[53],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Personalized Marketing Campaigns With Buyer Personas - SharpSpring<\/title>\n<meta name=\"description\" content=\"At this webinar, SharpSpring partner Candeo Creative shows why buyer personas with marketing automation makes personalized marketing campaigns that convert.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Personalized Marketing Campaigns With Buyer Personas - SharpSpring\" \/>\n<meta property=\"og:description\" content=\"At this webinar, SharpSpring partner Candeo Creative shows why buyer personas with marketing automation makes personalized marketing campaigns that convert.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/\" \/>\n<meta property=\"og:site_name\" content=\"SharpSpring\" \/>\n<meta property=\"article:modified_time\" content=\"2019-10-07T19:27:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2017\/02\/letsgetpersonal1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"644\" \/>\n\t<meta property=\"og:image:height\" content=\"395\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"48 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sharpspring.com\/#website\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"SharpSpring\",\"description\":\"The Revenue Growth Platform\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/sharpspring.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2017\/02\/letsgetpersonal1.png\",\"width\":644,\"height\":395},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/#webpage\",\"url\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/\",\"name\":\"Personalized Marketing Campaigns With Buyer Personas - SharpSpring\",\"isPartOf\":{\"@id\":\"https:\/\/sharpspring.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/#primaryimage\"},\"datePublished\":\"2017-02-03T15:37:36+00:00\",\"dateModified\":\"2019-10-07T19:27:31+00:00\",\"description\":\"At this webinar, SharpSpring partner Candeo Creative shows why buyer personas with marketing automation makes personalized marketing campaigns that convert.\",\"breadcrumb\":{\"@id\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/\",\"url\":\"https:\/\/sharpspring.com\/resources\/personal-webinar2\/\",\"name\":\"Let\\u2019s Get Personal\"}}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/resource\/94455"}],"collection":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/resource"}],"about":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/types\/resource"}],"version-history":[{"count":30,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/resource\/94455\/revisions"}],"predecessor-version":[{"id":190221,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/resource\/94455\/revisions\/190221"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media\/160303"}],"wp:attachment":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media?parent=94455"}],"wp:term":[{"taxonomy":"resourcecategory","embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/resourcecategory?post=94455"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}