{"id":191412,"date":"2019-11-01T10:53:49","date_gmt":"2019-11-01T14:53:49","guid":{"rendered":"https:\/\/sharpspring.com\/?page_id=191412"},"modified":"2020-12-18T18:02:08","modified_gmt":"2020-12-18T23:02:08","slug":"privacy","status":"publish","type":"page","link":"https:\/\/sharpspring.com\/legal\/privacy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>[vc_section el_class=&#8221;notranslate&#8221; css=&#8221;.vc_custom_1572282401053{margin-bottom: 0px !important;border-bottom-width: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_row layout=&#8221;custom&#8221; style=&#8221;module&#8221; align=&#8221;left&#8221; heading_text_color=&#8221;dark&#8221; left_image=&#8221;&#8221; right_image=&#8221;&#8221; delim_width=&#8221;&#8221; heading_margin=&#8221;&#8221; heading_font_weight=&#8221;&#8221; heading_use_google_fonts=&#8221;yes&#8221; heading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; subheading_font_weight=&#8221;&#8221; subheading_use_google_fonts=&#8221;yes&#8221; subheading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; icon_type=&#8221;&#8221; icon_fontawesome=&#8221;fa fa-adjust&#8221; icon_openiconic=&#8221;vc-oi vc-oi-dial&#8221; icon_typicons=&#8221;typcn typcn-adjust-brightness&#8221; icon_entypo=&#8221;entypo-icon entypo-icon-note&#8221; icon_linecons=&#8221;vc_li vc_li-heart&#8221; animation=&#8221;&#8221; animation_delay=&#8221;0&#8243; heading=&#8221;H1 Largest Extra Long Title Goes Here&#8221; subheading=&#8221;H2 goes here Ut eget sem nec ante mattis lacinia non ut&#8221; heading_font_options=&#8221;tag:h1|font_size:56|color:%233a3042|line_height:70&#8243; subheading_font_options=&#8221;tag:h2|font_size:40|color:%2384c340|line_height:48&#8243; subheading_class=&#8221;&#8221; icon_custom_icon=&#8221;&#8221; custom_delay=&#8221;&#8221;][vc_column]<div class=\" heading-center\"><div class=\" \"  ><h1 style=\"color: #3a3042 !important; \">Privacy Policy<\/h1><span class=\"custom-heading-delim\" style=\"border-top-color:#3a3042; width:140px;\"><\/span><\/div><\/div>[\/vc_column][\/vc_row][vc_row css=&#8221;.vc_custom_1572289615904{padding-top: 30px !important;}&#8221;][vc_column][vc_column_text]Effective Date: February 12, 2020<\/p>\n<p>Please read this document carefully. If you do not understand or do not agree to be bound by this Privacy Notice, you must immediately cease using or accessing the Platform.<\/p>\n<ol class=\"main-list-item\">\n<li>\n<h5 class=\"heading\">Overview.<\/h5>\n<p>This document describes our practices regarding the collection and processing of personal data through our Platform (defined below). Our practices implement the following principles:<\/p>\n<p><span style=\"font-weight: 400;\">Accountability<\/span><br \/>\nWe are responsible for the protection of personal data entrusted to us.<\/p>\n<p><span style=\"font-weight: 400;\">Transparency<\/span><br \/>\nWe inform users about the collection and processing of their personal data, and use it fairly.<\/p>\n<p><span style=\"font-weight: 400;\">Proportionality<\/span><br \/>\nWe collect and use personal data for specific legitimate purposes. We collect what we need to get our job done.<\/p>\n<p><span style=\"font-weight: 400;\">Control<\/span><br \/>\nWe offer users choices regarding the use of their personal data, and honor their preferences for contacting them.<\/p>\n<p><span style=\"font-weight: 400;\">Security &amp; Retention<\/span><br \/>\nWe apply technical, physical and organizational measures to ensure an appropriate level of security for the personal data in our custody. We retain it as needed for its intended purposes.<\/p>\n<p><span style=\"font-weight: 400;\">Third Parties<\/span><br \/>\nWe carefully choose vendors, service providers and other third parties with whom we share personal data and require them to commit to standards that we consider adequate.<\/li>\n<li>\n<h5 class=\"heading\">Introduction.<\/h5>\n<p><span style=\"font-weight: 400;\">SharpSpring Service<\/span><br \/>\nSharpSpring provides a suite of marketing automation services related to various forms of marketing and customer interaction, email marketing, storage capabilities, and lead analytics that relies on proprietary tools, technology and know-how (collectively, &#8220;Service&#8221;). The Service is provided to businesses or agencies (&#8220;Customers&#8221;) pursuant to services agreement and subject to the payment of a fee for such Service. The Service is provided through a restricted area accessible to Customers only, from the www.sharpspring.com, app.sharpspring.com, or *.marketingautomation.services websites.<\/p>\n<p><span style=\"font-weight: 400;\">SharpSpring Platform<\/span><br \/>\nIn connection with the promotion of the SharpSpring Service, SharpSpring has developed and operates the SharpSpring website, specialized content, reports, software applications, social media pages, and uses other means of interacting with individuals about the SharpSpring Service, such as emails, newsletters, or phone calls, marketing events and participation at trade shows. All such methods of promotion and sale of the SharpSpring Service are designated as the “Platform&#8221;.<\/p>\n<p><span style=\"font-weight: 400;\">Operator<\/span><br \/>\nThe operator of the Platform and provider of the SharpSpring Service is Comcopious , located at 5001 Celebration Pointe Avenue, Suite 410,Gainesville, FL, and its subsidiaries including Comcopious and Interinbox SA (&#8220;SharpSpring&#8221; or &#8220;we,&#8221; &#8220;us,&#8221; &#8220;our&#8221;).<\/p>\n<p><span style=\"font-weight: 400;\">Terms of Use of the SharpSpring Website<\/span><br \/>\nThis Privacy Notice is incorporated into the SharpSpring Terms of Use for visitors of the SharpSpring Platform, which is available at <a href=\"https:\/\/sharpspring.com\/legal\/terms-of-service\/\">https:\/\/sharpspring.com\/legal\/terms-of-service\/<\/a><\/li>\n<li>\n<h5 class=\"heading\">Definitions.<\/h5>\n<p>For the purpose of this Privacy Notice,<\/p>\n<p><span style=\"font-weight: 400;\">&#8220;Customer&#8221;<\/span> means a business that is, has been, or is about to become a paying or trial customer of SharpSpring for the purpose of using the SharpSpring Service.<\/p>\n<p><span style=\"font-weight: 400;\">&#8220;Visitor&#8221;<\/span> means an individual who visits the Platform, and who may be seeking information about the Service.<\/p>\n<p><span style=\"font-weight: 400;\">&#8220;Lead&#8221;<\/span> means a visitor who has expressed interest in our products or services, for example by filling out a form or providing a business card to request information, a white paper, or a demo of the Platform, or interacts with us in any manner about our Service, for example in emails, phone calls or through in person interaction.<\/p>\n<p><span style=\"font-weight: 400;\">&#8220;Customer Representative&#8221;<\/span> means an individual who acts on behalf of a Customer, and who uses or interacts with SharpSpring or the Platform in such capacity.<\/p>\n<p><span style=\"font-weight: 400;\">&#8220;User&#8221;<\/span> or <span style=\"font-weight: 400;\">&#8220;you&#8221;<\/span> or <span style=\"font-weight: 400;\">&#8220;your&#8221;<\/span> means a visitor, a lead, or a Customer Representative.<\/li>\n<li>\n<h5 class=\"heading\">Scope.<\/h5>\n<p><span style=\"font-weight: 400;\">SharpSpring Platform<\/span><br \/>\nThis Privacy Notice applies to the handling of personal data by SharpSpring that SharpSpring collects on or through its Platform and for its own purposes, when individual users interact when the Platform, for example by using the SharpSpring website, calling us, sending requests for information, or visiting our booth at trade shows.<\/p>\n<p><span style=\"font-weight: 400;\">Customers’ Use of our Service is Not Subject to this Privacy Notice<\/span><br \/>\nThis Privacy Notice does not apply to the collection or processing of personal data that occurs when our Customers use the Service for their own purposes. The collection and processing of personal data by our Customers when they use our Service is subject to the privacy policy of these Customers, as posted on their websites. We do not control the type of information that our Customers may choose to collect or manage using our Service. That information is owned by them, and it is used, disclosed, and processed by them, or on their behalf, in accordance to their instructions, and their own policies. We are not responsible for our Customers’ use of personal data that they collect using our Service.<\/p>\n<p><span style=\"font-weight: 400;\">Third Party Services<\/span><br \/>\nThis Privacy Notice also does not apply to any third-party website, service or social media button (“Third Party Service“) that may be linked to the Platform, such as links to an article or social networking buttons (for example, Facebook or Twitter). We have no control over, and are not responsible for, their data collection and\/or handling practices. We encourage you to be aware when you leave our Platform. We also encourage you to read the privacy statements of these third-party Services. The inclusion of a link to a third party’s Service does not imply that we endorse any of the third party’s products, services or data handling practices; or that this Privacy Notice covers the third parties’ products, services or practices.<\/li>\n<li>\n<h5 class=\"heading\">Updates and Changes to Privacy Notice.<\/h5>\n<p>Each time you access the Platform, the then-current version of this Privacy Notice will apply. We recommend that you periodically check this page and the date of the posted Privacy Notice, and review any changes since the last time you used the Platform.<\/p>\n<p>We will review and update this Privacy Notice periodically in response to changing legal, technical, market, and business developments. When we update this Privacy Notice, we will note the date of its most recent revision above. We will take appropriate measures to inform all users in a manner that is consistent with the significance of the changes we make, and is in accordance with applicable law.<\/p>\n<p>Your continued access to or use of the Platform after we have posted changes to this Privacy Notice on this page as set forth above, and have otherwise complied with the applicable laws regarding changes in the notice, will indicate that you agree to be bound by such changes.<\/p>\n<p>If you do not agree with such changes, you should cease accessing or using the Platform and seek the deletion of your information by contracting use as described below. In some cases, your actual consent will be required, and in this case this paragraph will have no effect.<\/li>\n<li>\n<h5 class=\"heading\">Information Collection Practices.<\/h5>\n<p>We collect a variety of information as listed below as needed to operate our business, and for the legitimate interest of our business, including for marketing purposes, to the extent permitted by applicable law. Our website and other publicly facing services and applications are primarily intended for interaction in the business environment. Our information collection practices are focused on the business context, and the careful and limited identification of leads and prospects for our sales efforts.<\/p>\n<p>These data include:<\/p>\n<p><span style=\"font-weight: 400;\">Log Data<\/span><\/p>\n<div class=\"list-unstyled list-chevron\">\n<p>When a user uses, or interacts with our Platform, or clicks on a link that directs the user to our Platform, the user’s browser automatically provides, and we automatically collect and store, certain information about the user’s device (computer, tablet, smartphone) and the user’s activities. This includes:<\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Preferences and settings:<\/span> time zone, language, and character size.<\/li>\n<li><span style=\"font-weight: 400;\">Identifiers:<\/span> IP address<\/li>\n<li><span style=\"font-weight: 400;\">Technical information:<\/span> type of device, operating system name and version, device manufacturer, browser information (type, version), screen resolution.<\/li>\n<li><span style=\"font-weight: 400;\">Coarse geographic information:<\/span> geographic location derived from the IP address.<\/li>\n<\/ul>\n<\/div>\n<div class=\"list-unstyled list-chevron\">\n<p>We collect this data for the proper operation of our Platform. Until the user becomes a “lead” this data cannot be linked to a specific individual.<\/p>\n<p><span style=\"font-weight: 400;\">Traffic Data<\/span><br \/>\nData generated by the use of the Platform also include:<\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Information about use of the Platform:<\/span> date stamp, URL of the visited page, URL of the last webpage visited before visiting our Platform or a website using our Platform. URL of the last webpage visited before visiting our Service.<\/li>\n<li><span style=\"font-weight: 400;\">History of interaction with our webpages:<\/span> pages viewed, time spent on a page, click through, clickstream data; queries made, search history, search results selected; comments made, type of service requested, purchases made.<\/li>\n<\/ul>\n<\/div>\n<div class=\"list-unstyled list-chevron\">\n<p>We collect this data to understand how our Platform is used and to create statistics on the use of our Platform. Until the user becomes a “lead” this data cannot be linked to a specific individual.<\/p>\n<p><span style=\"font-weight: 400;\">Lead Data<\/span><br \/>\nIf a visitor interacts with us, for example, to inquire about a product or service, the visitor becomes a lead. In these cases, we will collect information provided to us through the form or questionnaire used to make the request, or the contact or other information provided at a trade show or industry event. The information is provided directly and voluntarily by the individual. Depending on the circumstances, the information may include:<\/p>\n<ul>\n<li>First and Last Name<\/li>\n<li>Name of the business<\/li>\n<li>Email address<\/li>\n<li>Street address, city, state, province and\/or country<\/li>\n<li>Telephone number<\/li>\n<li>Website URL<\/li>\n<li>Social Media Handles<\/li>\n<li>Mobile Number<\/li>\n<\/ul>\n<\/div>\n<div class=\"list-unstyled list-chevron\">\n<p>We collect this data for sales and marketing purposes to allow us to respond to a request from a lead so that we may provide information about our Service.<\/p>\n<p><span style=\"font-weight: 400;\">Customer Representative Data<\/span><br \/>\nWhen a Customer has purchased the Service, we create an account on our Platform, in the name of the Customer. The Customer has the ability to create one or several accounts. For each authorized Customer Representative allowed to use these accounts, we request:<\/p>\n<ul>\n<li>First and Last Name<\/li>\n<li>Name of the company for which the Service is purchased<\/li>\n<li>Email address<\/li>\n<li>Street address, city, state, province and\/or country<\/li>\n<li>Telephone number<\/li>\n<li>Website URL<\/li>\n<\/ul>\n<\/div>\n<div class=\"list-unstyled list-chevron\">\n<p>It may also include, at the individual’s option<\/p>\n<ul>\n<li>Social Media Handles<\/li>\n<li>Mobile Number<\/li>\n<\/ul>\n<\/div>\n<p>Only the minimum amount of information necessary to operate or manage the account is mandatory. The Customer Representative may elect to provide additional information, which we may use to enhance the Service, for example by offering access to social media accounts through the Service.<\/p>\n<p>To access the Customer account, the registrant is required to choose a password.<\/p>\n<p><span style=\"font-weight: 400;\">Information the User Makes Public<\/span><br \/>\nThe Platform contains features that allow certain users to upload, post, transmit, display, perform, or distribute content, or other information, including their Personal data. Any information that the user chooses to disclose by means of such features may become public information.<\/p>\n<p>SharpSpring is unable to exercise control over this information once the user has made it public. You should exercise caution when deciding to disclose your Personal data by means of such features, and you are solely responsible for any uses or misuse of such information.<\/p>\n<p><span style=\"font-weight: 400;\">Publicly Available Information<\/span><br \/>\nWe supplement information that we receive directly from the user or the user’s equipment with additional information that is available from public sources, in public records, or other publicly available databases or from information that the user has made public, for example, in tweets or Facebook posts.<\/p>\n<p><span style=\"font-weight: 400;\">Payment Information<\/span><br \/>\nWhen a Customer pays for the Service, we collect the method of payment, date and amount of the payment. If the Customer pays with a credit card, this information is transmitted directly to our payment processor, and we do not retain the detail of the payment information other than the Transaction ID number. After payment card information is entered, we do not have access to payment card information and disclaim any liability for any loss or compromise of payment card information. When you make a payment, you agree to terms of our payment processor.<\/p>\n<p>In the case of an ongoing relationship, we retain information about the Customer’s payment history as necessary for the administration of the Customer account.<\/p>\n<p><span style=\"font-weight: 400;\">Communication from Users<\/span><br \/>\nWhen a visitor or lead completes an online form, visits our website or other areas of our Platform (for example on social media), or when a user otherwise contacts us, by email, phone or text, we automatically collect and store certain information about that user and the user’s activities, as we receive from such user, for example:<\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>The user’s name and contact information.<\/li>\n<li>Information that the user provides to us.<\/li>\n<li>The user’s company information, if any.<\/li>\n<li>The nature of the communication.<\/li>\n<li>The purpose of the interaction, and the action we took in response to the user’s inquiry or request.<\/li>\n<li>Any action the user takes upon receipt of such communication (for example, whether the user registers to attend an event that we offer, or request to receive documentation).<\/li>\n<\/ul>\n<\/div>\n<p>The information collected in connection with each type of interaction is retained so that SharpSpring and each user can continue interaction with the requestor for marketing and sales purpose and the promotion of our Service.<\/p>\n<p><span style=\"font-weight: 400;\">Communications to Users<\/span><br \/>\nUnless we are prohibited by applicable law from using cookies and a user has not otherwise consented to our use of cookies, we insert cookies in some of our correspondence with users.<\/p>\n<p>In that case, when we send an email message to a user, our message contains images or links, which when viewed or clicked, will register an event with us that allows us to know whether the user has accessed or declined to open our message. This action may also store a cookie which will allow us to count unique clicks or visits and potentially track the recipient.<\/p>\n<p>This information is needed for our legitimate business purposes, because it helps us understand how the individual reacts to our communications and limit the amount and nature of information provided. We believe that such means are fair, lawful, and proportional to the legitimate interest and needs of our business, and that our methodology fairly addresses each user’s legitimate rights and expectations in view of the context and purpose for the collection and use of the information collected.<\/p>\n<p>The information is collected in connection with our marketing efforts and is retained so that we can continue or elect to stop interaction with the lead.<\/p>\n<p>We do not want to intrude in your busy life or waste your time. If at any time you wish that we cease to communicate with you, please contact us as indicated in the “How to Contact Us” section, or take advantage of the unsubscribe link that you will find in any of our written electronic communications.<\/p>\n<p><span style=\"font-weight: 400;\">Surveys and Contests<\/span><br \/>\nFrom time-to-time, we invite users to participate in surveys or contests. Participation is voluntary. These surveys are organized for the purposes of our marketing efforts.<\/p>\n<p>When a user participates, we request certain personal data such as name and email address. This is necessary to ensure that responses are categorized properly and are not duplicated<\/p>\n<p>Depending on the nature of the survey or contents, we also use this information to send the survey results to the participants, or, if applicable, to notify contest winners and award prizes.<\/p>\n<p>We use the information obtained from these surveys and contests in aggregate form, for analytics purposes, to understand our market, to monitor site traffic or app usage, or to modify our Platform or our Service to meet the needs or interests of users.<\/p>\n<p>If we use a third-party service provider to conduct these surveys, the information collected by the service provider may be subject to both the service provider’s privacy policy and SharpSpring’s. We will provide information about the applicable privacy policies with the Survey rules and will seek your explicit consent to these rules when required by law. You should read the terms of the survey or contest to understand the extent to which the service provider is allowed to use or reuse the information collected.<\/p>\n<p><span style=\"font-weight: 400;\">Social Media<\/span><br \/>\nOur Platform offers integrations with third-party social media platforms like Facebook, Twitter, and LinkedIn. These services collect your IP address and which page you are visiting on our Platform. They may set a cookie to enable their features to function properly. Social media features and widgets are hosted by a third party or directly on our website. Your interactions with these features are governed by the privacy policy of the company providing the feature.<\/p>\n<p><span style=\"text-decoration: underline;\">Your use of these services is optional. If you elect to use them, you will be deemed to have expressly consented to the collection of personal data by these services according to their terms.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Information we Obtain from Third Parties<\/span><br \/>\nWe receive information from third party data providers including directories. In some cases, such as LinkedIn, the information has manifestly been made public by the individuals who posted their profile on LinkedIn, and we assume that the individuals no longer have a privacy interest in such information, and it can be used for the legitimate interest of SharpSpring in learning about potential Customers.<\/p>\n<p><span style=\"font-weight: 400;\">Email Accounts<\/span><br \/>\nUsers may opt-in to use features of the Platform which regularly collect and store the contents of emails from their email accounts, which are hosted by third-party email service providers. This is done for the purpose of providing advanced features of the Platform and is only done at the user’s express direction.<\/p>\n<p>In order to provide these features, the Platform must authenticate with the user’s third-party email accounts. When possible, this is done using OAuth.<\/p>\n<p>For example, the Platform will use OAuth to securely authenticate with a user’s particular email account. Once authenticated, the OAuth authentication, or “bearer” token, is encrypted and stored, and is used on subsequent requests to prove authentication. When OAuth is not possible, we encrypt and store the user’s third-party email account credentials, and thereafter use them to securely authenticate with the third-party email service.<\/p>\n<p>Access to email account authentication tokens and credentials (where applicable), the keys to decrypt this data, and user email content, is limited to only employees who need access to support and develop the Platform and only within the scope of their job responsibilities. The user’s authentication tokens or credentials, and email data, is never shared with third-parties.<\/p>\n<p>For users who authorize and use OAuth with their Gmail account through Google, the use of data obtained through the Platform will comply with Google’s additional Restricted Scopes requirements that are listed in the Google API Services: User Data Policy. The details of the this policy can be found at: <a href=\"https:\/\/developers.google.com\/terms\/api-services-user-data-policy#additional-requirements-for-specific-api-scopes\">https:\/\/developers.google.com\/terms\/api-services-user-data-policy#additional-requirements-for-specific-api-scopes.<\/a> As this policy is subject to change based on the needs of Google, it is recommended that users regularly check on updates to the policy at the above attached web address.<\/li>\n<li>\n<h5 class=\"heading\">How Information is Collected.<\/h5>\n<p>The information is collected through several different means described below. We believe that such means are fair, lawful, and proportional to the legitimate interest and needs of our business, and that our methodology fairly addresses each user’s legitimate rights and expectations in view of the context and purpose for the collection and use of the information collected.<\/p>\n<p>However, please be assured that we do not want to intrude in your busy life or waste your time. If at any time you wish that we cease any form of collection or processing of information about you, please contact us as indicated in the “How to Contact Us” section.<\/p>\n<p><span style=\"font-weight: 400;\">Information Provided by the User’s Device<\/span><br \/>\nSome information is provided automatically by the user’s device or browser. This includes, for example, browser and device version information.<\/p>\n<p><span style=\"font-weight: 400;\">Information Obtained when a User Downloads and Uses our App.<\/span><br \/>\nWhen a user downloads and uses ourApp, we may track and collect usage data, such as the date and time the App accesses our servers, and what screens or pages were accessed.<\/p>\n<p><span style=\"font-weight: 400;\">Direct Contact by the User<\/span><br \/>\nSome information is provided directly by the user. This includes, for example, information provided by a user:<\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>When requesting information about one of our products or services.<\/li>\n<li>By completing a questionnaire, a form or a survey.<\/li>\n<li>When placing a call to us and requesting assistance from us.<\/li>\n<li>By visiting with us at an industry event.<\/li>\n<li>By registering to attend a seminar or webinar.<\/li>\n<li>By requesting a copy of a newsletter or white paper.<\/li>\n<li>When subscribing to marketing communications.<\/li>\n<li>When requesting support.<\/li>\n<li>During phone calls with a sales representative.<\/li>\n<\/ul>\n<\/div>\n<p><span style=\"font-weight: 400;\">User’s Activity on a Third-Party Site<\/span><br \/>\nWhen a lead uses a third-party website that has integrated SharpSpring forms or tracking code, the information submitted on these forms, and the pages visited on these websites, will be recorded by our Platform.<\/p>\n<p><span style=\"font-weight: 400;\">Social Media<\/span><br \/>\nWhen a social media account is connected to a user’s account on our Platform, we ask the user’s permission to access certain information about the user’s social media account, activities and friends. Social media sites make information available to all apps through their APIs, such as friend lists. The information we receive depends on what information the user or the social media site decides to share with us.<\/p>\n<p><span style=\"font-weight: 400;\">Public Sources<\/span><br \/>\nSome information is obtained from public records and publicly available databases.<\/p>\n<p><span style=\"font-weight: 400;\"> Third Parties<\/span><br \/>\nSome information is provided by joint marketing partners and third-party providers who have confirmed that they have the right to share such information.<\/li>\n<li>\n<h5 class=\"heading\">Cookies, Pixel Tags and Other Technologies.<\/h5>\n<p>Some information is collected through cookies. Cookies, pixel tags and other tracking technologies are used on our Platform to ensure that it functions properly and to give users a more personalized experience. Cookies can be &#8220;first party cookies&#8221; (served by us) or &#8220;third parties cookies&#8221; (served by others).<\/p>\n<p>For additional information about our use of cookies and other similar tracking technologies, please see our <a href=\"https:\/\/sharpspring.com\/legal\/sharpspring-cookie-policy\/\">Cookie Policy.<\/a><\/p>\n<p>We, our service providers, and any ad networks who help us deliver relevant ads to users may use cookies, pixel tags (also known as web beacons and clear, or transparent GIFs), and other similar technologies to measure and track general user activities on our Site, and on third party websites.<\/p>\n<p>In some countries, we are not permitted to send cookies other than necessary cookies to the browser of a user without the prior consent of the affected user. In this case, we will seek such consent. The remainder of this section assumes that either the use of cookies is not restricted by applicable law, or if it is restricted, that the individual has explicitly consent to the use of cookies.<\/p>\n<p>Information provided by these cookies are essential to help us provide our Platform in a manner that it adapted to each user’s specific needs, for example, to allow identifying the country where the user is located, so that we can present our website in the appropriate language.<\/p>\n<p>We believe that such means are fair, lawful, and proportional to the legitimate interest and needs of our business, and that our methodology fairly addresses each user’s legitimate rights and expectations in view of the context and purpose for the collection and use of the information collected.<\/p>\n<p>Third-party analytics services, including Google Analytics provided by Google Inc. (&#8220;Google&#8221;) and Pendo use cookies and similar technologies to analyze how visitors use our Platform and for compiling statistical reports.<\/p>\n<p>If you want to prevent the use of certain cookies, including that of the Google Analytics cookie, you can do so, and the relevant information is provided in our Cookie Policy located at <a href=\"https:\/\/sharpspring.com\/legal\/sharpspring-cookie-policy\/\">https:\/\/sharpspring.com\/legal\/sharpspring-cookie-policy\/.<\/a><\/li>\n<li>\n<h5 class=\"heading\">Information Use and Disclosure.<\/h5>\n<p>We use the data collected for the legitimate interest of our business as follows:<\/p>\n<p><span style=\"font-weight: 400;\">Aggregated Data<\/span><br \/>\nWe use traffic data in aggregated form to better understand the interests and needs of our visitors and leads, and how they are using our Platform. By identifying patterns and trends in usage, we are able to better design the Platform and marketing material to serve more relevant and useful content.<\/p>\n<p>We use log data and demographic data in aggregated form to better understand the needs or interests of our visitors which helps us to create more appropriate marketing material and better tailored communication.<\/p>\n<p><span style=\"font-weight: 400;\">Social Media<\/span><br \/>\nWhen we are permitted to do so, we use Third Party Social Media Account Data in accordance with this Privacy Notice and the privacy policies of third party social media companies, such as Facebook and Twitter to understand how SharpSpring is being discussed online, and to engage with customers, leads or potential customers on social media.<\/p>\n<p><span style=\"font-weight: 400;\">As part of our Marketing Efforts<\/span><br \/>\nWe use Contact Data that a visitor or lead has provided to provide requested information concerning the Platform or the Service in response to the request.<\/p>\n<p><span style=\"font-weight: 400;\">As part of our Sales Effort<\/span><br \/>\nWe keep a record of our interaction with visitors, leads, and Customer Representatives, and of their requests to:<\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>Keep records of contact information and correspondence.<\/li>\n<li>Send relevant marketing information and market research surveys.<\/li>\n<li>Communicate with the user about our activities.<\/li>\n<li>Send invitations to events that may be of interest to the user in accordance with the user’s preferences or apparent interests.<\/li>\n<li>Share content, through social media services, e.g., Facebook and\/or Twitter.<\/li>\n<\/ul>\n<\/div>\n<p><span style=\"font-weight: 400;\">To Interact with Customers<\/span><br \/>\nWe use Contact Data that a Customer Representative has provided to respond to:<\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>A request for assistance (for example a request for support).<\/li>\n<li>Provide requested information concerning their account.<\/li>\n<\/ul>\n<\/div>\n<p><span style=\"font-weight: 400;\">Provide or Facilitate the Use of the Platform<\/span><br \/>\nWe use information about a user to:<\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>Provide the products, services, or documents requested by the user.<\/li>\n<li>Fulfill purchases of our services.<\/li>\n<li>Respond to users’ requests, or respond to comments or questions.<\/li>\n<li>Provide service and support to Customer Representatives.<\/li>\n<li>Diagnose server problems and administer the Platform or the Service.<\/li>\n<li>Follow up with Customer Representatives and help resolve issues internally or with our third-party partners.<\/li>\n<\/ul>\n<\/div>\n<p>We use information about a user’s device to ensure that our Platform functions properly and is optimized for that user’s device.<\/p>\n<p><span style=\"font-weight: 400;\">For Financial and Accounting<\/span><br \/>\nWe use financial data provided by a lead during the sales process to verify their qualifications for certain features of the Platform and, after the lead becomes a Customer Representative, to bill the Customer as applicable.<\/p>\n<p><span style=\"font-weight: 400;\">For our Business Operations<\/span><\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>To send administrative information to the user.<\/li>\n<li>To respond to our users’ preferences or interests or expedite the processing and completion of a transaction.<\/li>\n<li>To Administer our Platform, diagnose technical problems, and manage our business.<\/li>\n<li>To Facilitate the user’s use of the Platform.<\/li>\n<li>Allow the user to navigate or browse through our Platform quickly and efficiently.<\/li>\n<\/ul>\n<\/div>\n<p><span style=\"font-weight: 400;\">To Adapt our Website and Apps to the User’s Needs<\/span><\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>To remember the user’s preference, such as language or font size.<\/li>\n<\/ul>\n<\/div>\n<p><span style=\"font-weight: 400;\">For Security Purposes<\/span><br \/>\nWe use information about our Customer Representatives, and in some cases visitors, to perform data analysis, audits, security and fraud monitoring and prevention; enhance, improve, or modify our Platform or Service.<\/p>\n<p>We use IP Addresses for administration and security purposes, such as calculating usage levels of our Platform or Service, help diagnose server problems, and detect fraud, spam or other disruptive or destructive behavior.<\/p>\n<p><span style=\"font-weight: 400;\">For Statistical and Research Purposes<\/span><br \/>\nWe use aggregated Traffic Data and information gathered using cookies, to create reports on trends in the usage of the Platform or Service and to determine the effectiveness of our promotional campaigns.<\/p>\n<p>We study collected information in aggregated and anonymized format to determine our users’ needs, promote certain products or services, or additional support to optimize our marketing and ad targeting efforts. For example, we may compile statistics on the percentage of our users in a state or country who have a specific interest or purpose, or to design advertisements or to develop new features that appear on our Platform.<\/li>\n<li>\n<h5 class=\"heading\">Sharing with Third Parties.<\/h5>\n<p>Except as described below, SharpSpring will not share or disclose a user’s personal data with third parties. We believe that such practices are fair, lawful, and proportional to the legitimate interest and needs of our business, and that our practices fairly address each user’s legitimate rights and expectations in view of the context and purpose for the collection and use of the information collected, are not intrusive or contrary to users’ legitimate rights.<\/p>\n<p>We do not want to intrude in your busy life or waste your time. If at any time you wish that we cease any activity that affects you, please contact us as indicated in the “How to Contact Us” section.<\/p>\n<p><span style=\"font-weight: 400;\">Disclosure to Marketing Partners<\/span><br \/>\nWhen general laws allow us to do so, we use any Personal data to better understand the demographics of our target audiences, and to support our marketing data products and services.<\/p>\n<p>When this is not prohibited by applicable laws, we also provide personal information to partner firms which may include third-party marketing companies, affiliates, advertising agencies, and data aggregation companies. These partner firms use this information to determine the interest levels of leads on products and services in accordance with this Privacy Notice.<\/p>\n<p>In countries where such activities are not permitted without the prior explicit consent of the individuals, we refrain from conducting these activities.<\/p>\n<p>For clarity, we do not share or disclose personally identifiable information (PII) to partner firms.<\/p>\n<p><span style=\"font-weight: 400;\">Service Providers<\/span><br \/>\nWe share information with our suppliers, subcontractors, and other third parties who provide services to us (collectively “service providers”) in connection with advertising, hosting, data analytics, information technology and infrastructure, order fulfillment, email delivery, auditing, and other related activities.<\/p>\n<p>Our service providers are given only the information they need to perform their designated functions. Our contracts with each service provider prohibits them from using or sharing with others, the information that we provide to them, or that they collect directly from our users for other purposes than as directed by us.<\/p>\n<p><span style=\"font-weight: 400;\">Analytics<\/span><br \/>\nWe use automated devices and applications, such as Google Analytics, to evaluate use of our Platform. Analytics service providers use cookies and other tracking technologies to perform their services. For more details, please review the “Cookies” section.<\/p>\n<p><span style=\"font-weight: 400;\">Social Media Networks<\/span><br \/>\nThe Platform includes links to third-party websites and social media networks (“Third Party Services”) where a user is able to post or share comments, reviews or other information for example, forwarding an article, tweeting about a sale, or clicking on a Facebook button. To do so, you must connect your SharpSpring account with your Third-Party Service account (for example, your Facebook account). In such case, you authorize SharpSpring to share information with Facebook, and you agree that the use of the information we share with Facebook will be governed by the Facebook privacy policy.<\/p>\n<p>Please note that the information or comments that are posted on SharpSpring may be collected and shared by these Third-Party Services, and your information or comments that are posted or disclosed through these Third-Party Services may become available to SharpSpring, other SharpSpring users, or the public.<\/p>\n<p><span style=\"font-weight: 400;\">Events<\/span><br \/>\nSome of our events may be organized and hosted through a service provider, or in cooperation with unaffiliated organizations. These entities may require attendees to these events to provide information such as name, email address, and\/or phone number as part of the registration process. We cannot control their collection or use of this information. We encourage you to read the privacy statements of these third parties because they control how such entities handle the information that you provide at the time of registration.<\/p>\n<p><span style=\"font-weight: 400;\">Trade shows<\/span><br \/>\nWe participate in trade shows that are organized by third parties. These entities may require attendees to these events to provide information such as name, email address, and\/or phone number as part of the registration process. We cannot control their collection or use of this information. We encourage you to read the privacy statements of these third parties because they control how such entities handle the information that you provide at the time of registration.<\/p>\n<p>If a user visits our booth at a trade shows, and provides us with contact information or a business card, we assume that the user intends to establish a commercial relationship with us, and invites us to provide marketing documentation or interact with that user for the purpose of discussing our Service.<\/p>\n<p><span style=\"font-weight: 400;\">Affiliates Entities<\/span><br \/>\nWe share information with entities that are under common ownership or control of our parent company (“Affiliates”). Subject to local requirements, this information may be used to provide services offered by our Affiliates and for the purposes described in this Privacy Notice. Affiliates may share information about users for direct marketing purposes, but only in accordance with each user’s choices or preferences.<\/p>\n<p><span style=\"font-weight: 400;\">Payment Processing<\/span><br \/>\nWe work with a payment processing company to process credit card payments. If you make any payment to us, our payment processing provider will store on our behalf your full name and credit card details.<\/p>\n<p><span style=\"font-weight: 400;\">Fraud Prevention and Protection of Legal Rights<\/span><br \/>\nWe may use and disclose information to the appropriate legal, judicial or law enforcement authorities and our advisors and investigators when (i) we believe, in our sole discretion, that disclosure is necessary to investigate, prevent, or respond to suspected illegal or fraudulent activity or to protect the safety, rights, or property of SharpSpring, users, or others; (ii) a user has abused the Platform or Service or gained unauthorized access to any system, engaged in spamming, denial of service attacks, or similar attack; (iii) to exercise or protect legal rights or defend against legal claims; (iv) to allow us to pursue available remedies or limit the damages that we may sustain.<\/p>\n<p><span style=\"font-weight: 400;\">Law enforcement<\/span><br \/>\nWe may have to disclose user information if a court, law enforcement or other public or government authority with appropriate jurisdiction requests that we provide that user’s information, and such request is made using the method required by law in the applicable jurisdiction, such as a search warrant, subpoena, or a court order, and we believe that such request is valid.<\/p>\n<p><span style=\"font-weight: 400;\">Government Data Request Transparency<\/span><br \/>\nSharpSpring strives to advocate for personal privacy, and will always ensure that we meet the legal, security, and privacy obligations of our partners, customers, users and potential Data Subjects who interact with our platform. When SharpSpring receives Government Data Requests we will ensure that we act with both transparency and accountability. SharpSpring endeavours to demonstrate good faith and has created processes and policies following the <a href=\"https:\/\/cyber.harvard.edu\/publications\/2016\/transparency_guide_and_template\">Harvard Transparency Reporting Toolkit<\/a>guidelines to ensure that we legally comply with these requests while safeguarding the privacy of our users to the extent possible. SharpSpring releases reports of our Government Data Requests bi-annually and are available for review at <a href=\"https:\/\/sharpspring.com\/legal\/transparency-reports\/\">https:\/\/sharpspring.com\/legal\/transparency-reports\/<\/a>.<\/p>\n<p><span style=\"font-weight: 400;\">Corporate Reorganization<\/span><br \/>\nWe may transfer users’ information to a third party in case of the reorganization, sale, merger, joint venture, assignment, transfer or other disposition of all or any portion of our business, asset or stocks, including in the event of bankruptcy or corporate restructuring. Except as otherwise provided by a bankruptcy or other court, the use and disclosure of all transferred user information will be subject to the policies described in this Privacy Notice. Any information that a user submits or that is collected after that transfer may be subject to a new privacy policy adopted by the successor entity.<\/li>\n<li>\n<h5 class=\"heading\">Crossborder Transfer of Information.<\/h5>\n<p>We provide a global Platform and Service. Subject to applicable law, information that we obtain from or about users may be processed or transferred to data centers located throughout the world. The standards and laws that apply to the protection of personal data in these countries might be different from that which is afforded in the country where a user is located.<\/p>\n<p>SharpSpring has chosen to participate in the Privacy Shield program and to certify its adherence to the EU-U.S. Privacy Shield Framework and the Swiss-U.S. Privacy Shield Framework and their respective Principles and Supplemental Principles (&#8220;Principles&#8221;). Please see also our EU-U.S. Privacy Shield and Swiss-U.S. Privacy Shield Policy. [<a href=\"https:\/\/sharpspring.com\/legal\/us-eu-privacy-notice\/\">https:\/\/sharpspring.com\/legal\/us-eu-privacy-notice\/<\/a>]<\/li>\n<li>\n<h5 class=\"heading\">Security.<\/h5>\n<p><span style=\"font-weight: 400;\">Security of Personal Data<\/span><br \/>\nWe use commercially reasonable technical, organizational, and administrative safeguards to protect information within our control against unauthorized or unlawful access, use, modification, destruction, processing or disclosure, and against accidental loss, destruction, or damage. We believe that these measures are reasonably adapted to the nature of the information in our custody.<\/p>\n<p>We limit access to our users’ personal data to only those employees and third parties who reasonably need access to it to perform the activities attached to their job responsibilities.<\/p>\n<p>However, due to the realities of data security, no security system or storage system can be guaranteed to be 100% effective or secure. Thus, we cannot guarantee that any information provided to us or collected by us will not be accessed, hacked, disclosed, altered, or destroyed by unauthorized parties.<\/p>\n<p><span style=\"font-weight: 400;\">Breach of Security<\/span><br \/>\nIn the event that we become aware of a security breach which we believe has resulted, or may result, in the unauthorized access, use, or disclosure of non-public personal information of users, we will promptly investigate the matter and notify the applicable parties of such breach. Such investigation will be without delay, consistent with (i) the legitimate needs of law enforcement; (ii) measures necessary to determine the scope of the breach; (iii) efforts to identify the individuals affected; and (iv) steps to restore the reasonable integrity of our Platform.<\/p>\n<p>If you have reason to believe that your interaction with us is no longer secure (for example, if you feel that the security of any account you might have with us might have been compromised), or if you suspect someone else is using your account, please let us know immediately by contacting us as indicated in the “How to Contact Us” section.<\/p>\n<p><span style=\"font-weight: 400;\">Lost or Stolen Information<\/span><br \/>\nYou must promptly notify us if your credit, bank, other financial institution information, username, or password is lost, stolen, or used without permission. In such an event, we will assist you in updating your account details.<\/li>\n<li>\n<h5 class=\"heading\">Data Retention.<\/h5>\n<p>We will retain personal data we collect from you where we have justifiable business need to do so, and\/or for as long as it is needed to fulfill the purposes outlined in this Privacy Notice, unless a longer retention period is required by law, such as for tax, legal, or accounting purposes.<\/p>\n<p>You can request deletion of your personal data at any time, and we will consider your request in accordance with applicable laws.<\/p>\n<p>When we have no justifiable business need to process your personal data, we will either delete it or anonymize it, or if it not possible (for example, because your personal data has been stored in backup archives), we will securely store your personal data and isolate it from any further processing until deletion is possible.<\/li>\n<li>\n<h5 class=\"heading\">Advertising Cookies.<\/h5>\n<p><span style=\"font-weight: 400;\">Cookies<\/span><br \/>\nYou may choose to block our Platform and other sites from setting cookies by changing the settings of your browser. Please note that blocking or disabling certain cookies may interfere with certain functionalities of some parts of our Platform.<\/p>\n<p>To learn more about cookies, you may wish to refer to.<br \/>\nAll About Cookies: <a href=\"http:\/\/www.allaboutcookies.org\/\">http:\/\/www.allaboutcookies.org\/<\/a><br \/>\nCookie Central: <a href=\"http:\/\/www.cookiecentral.com\/faq\/\">http:\/\/www.cookiecentral.com\/faq\/<\/a><br \/>\nNetwork Advertising: <a href=\"http:\/\/networkadvertising.org\/\">http:\/\/networkadvertising.org\/<\/a><\/p>\n<p>To obtain information specific a particular browser you can refer to<br \/>\nEdge: <a href=\"https:\/\/privacy.microsoft.com\/en-us\/windows-10-microsoft-edge-and-privacy\">https:\/\/privacy.microsoft.com\/en-us\/windows-10-microsoft-edge-and-privacy<\/a><br \/>\nExplorer: <a href=\"https:\/\/support.microsoft.com\/en-us\/help\/17442\/windows-internet-explorer-delete-manage-cookies\">https:\/\/support.microsoft.com\/en-us\/help\/17442\/windows-internet-explorer-delete-manage-cookies<\/a><br \/>\nFirefox: <a href=\"http:\/\/support.mozilla.org\/en-US\/kb\/Cookies\">http:\/\/support.mozilla.org\/en-US\/kb\/Cookies<\/a><br \/>\nGoogle Chrome: <a href=\"http:\/\/support.google.com\/chrome\/bin\/answer.py?hl=en&amp;answer=95647\">http:\/\/support.google.com\/chrome\/bin\/answer.py?hl=en&amp;answer=95647<\/a><br \/>\nOpera: <a href=\"https:\/\/www.opera.com\/help\/tutorials\/security\/privacy\/\">https:\/\/www.opera.com\/help\/tutorials\/security\/privacy\/<\/a><br \/>\nSafari: <a href=\"http:\/\/support.apple.com\/kb\/ph5042\">http:\/\/support.apple.com\/kb\/ph5042<\/a><br \/>\nSafari iOS: <a href=\"http:\/\/support.apple.com\/kb\/ht1677\">http:\/\/support.apple.com\/kb\/ht1677<\/a><br \/>\nAndroid (Chrome): <a href=\"https:\/\/support.google.com\/chrome\/answer\/95647?co=GENIE.Platform%3DAndroid\">https:\/\/support.google.com\/chrome\/answer\/95647?co=GENIE.Platform%3DAndroid<\/a><br \/>\nWindows 10 Mobile (Edge): <a href=\"https:\/\/support.microsoft.com\/en-us\/help\/10609\/microsoft-edge-windows-10-mobile-view-delete-browser-history\">https:\/\/support.microsoft.com\/en-us\/help\/10609\/microsoft-edge-windows-10-mobile-view-delete-browser-history<\/a><\/p>\n<p><span style=\"font-weight: 400;\">Interest-based Advertising<\/span><br \/>\nWe use information collected about a user’s use of our Platform to arrange for advertisements about our Service to be served to a user on third-party websites in accordance with our e-Marketing Policy. To do so, our advertising service provider places or recognizes a unique cookie on the user’s browser and uses other techniques, such as pixel tags.<\/p>\n<p>If you would like more information about this practice and to learn about your choices, please visit<br \/>\n<a href=\"http:\/\/www.aboutads.info\">http:\/\/www.aboutads.info<\/a> or <a href=\"http:\/\/www.networkadvertising.org\">http:\/\/www.networkadvertising.org.<\/a><\/p>\n<p><span style=\"font-weight: 400;\">Opt-out of Interest-based Advertising<\/span><br \/>\nYou may opt-out of receiving interest-based advertising as explained below. The opt-out may be provided through specific opt-out cookies. Please note that using a new computer, using a different browser, upgrading certain browsers, or modifying or erasing a browser’s cookie file, may clear an opt-out cookie.<\/p>\n<p>Please note that opting out of receiving interest-based advertising does not result in block all advertisements served to your equipment. You will continue receiving advertisements; these advertisements will be generic or based on the content of a webpage that you are visiting, instead of being targeted to your specific interests.<\/p>\n<p>Please bear in mind that there are many more companies listed on these sites than those that place cookies on your device when you access our Platform.<\/p>\n<p><span style=\"font-weight: 400;\">To Control Advertising on Websites<\/span><\/p>\n<p>Digital Advertising Alliance:<br \/>\nAll About Cookies: <a href=\"http:\/\/www.aboutads.info\/choices\/\">http:\/\/www.aboutads.info\/choices\/<\/a><br \/>\nCookie Central: <a href=\"http:\/\/www.aboutads.info\">http:\/\/www.aboutads.info<\/a><br \/>\nNetwork Advertising: <a href=\"http:\/\/www.aboutads.info\/consumers\">http:\/\/www.aboutads.info\/consumers<\/a><br \/>\nEurope: <a href=\"http:\/\/youronlinechoices.eu\">http:\/\/youronlinechoices.eu<\/a><\/p>\n<p>Network Advertising Initiative:<br \/>\n<a href=\"http:\/\/www.networkadvertising.org\/choices\/\">http:\/\/www.networkadvertising.org\/choices\/<\/a><br \/>\n<a href=\"http:\/\/www.networkadvertising.org\">http:\/\/www.networkadvertising.org<\/a><br \/>\n<a href=\"http:\/\/www.aboutads.info\/consumers\">http:\/\/www.aboutads.info\/consumers<\/a><\/p>\n<p>World Privacy Forum:<br \/>\n<a href=\"http:\/\/www.worldprivacyforum.org\/cookieoptout.html\">http:\/\/www.worldprivacyforum.org\/cookieoptout.html<\/a><\/p>\n<p>Interactive Advertising Bureau (IAB)<br \/>\n<a href=\"http:\/\/www.iab.net\">http:\/\/www.iab.net<\/a><\/p>\n<p><span style=\"font-weight: 400;\">To Control Advertising on Mobile Applications<\/span><br \/>\nUsers of mobile device who do not want to receive interest-based advertising may opt-out in several ways.<\/p>\n<p>Ad Choices for Mobile devices: <a href=\"http:\/\/www.aboutads.info\/appchoices\">http:\/\/www.aboutads.info\/appchoices<\/a> (it is necessary to first download the AppChoices app from <a href=\"http:\/\/www.aboutads.info\/appchoices\">http:\/\/www.aboutads.info\/appchoices).<\/a><\/p>\n<p>To end all targeting on a mobile device immediately, turn on “Limit Ad Tracking” in the device settings.<br \/>\nTo limit Ad Tracking on an Apple device: <a href=\"https:\/\/support.apple.com\/en-us\/HT202074\">https:\/\/support.apple.com\/en-us\/HT202074.<\/a><br \/>\nTo limit Ad Tracking on an Android device: <a href=\"https:\/\/support.google.com\/ads\/answer\/2662922\">https:\/\/support.google.com\/ads\/answer\/2662922.<\/a><\/p>\n<p><span style=\"font-weight: 400;\">Google Analytics<\/span><br \/>\nInformation collected by the Google Analytics cookie is transmitted to, and stored by, Google in accordance with its privacy practices.<\/p>\n<p>To see an overview of privacy at Google and how this applies to Google Analytics, please visit:<\/p>\n<p>Ad Choices for Mobile devices: <a href=\"https:\/\/support.google.com\/analytics\/answer\/6004245\">https:\/\/support.google.com\/analytics\/answer\/6004245.<\/a><\/p>\n<p><span style=\"font-weight: 400;\">Social Media<\/span><br \/>\nYou can edit or remove the permissions you have granted to SharpSpring to use information from your connected social media accounts by using the application privacy settings on your social media account. See the following for instructions on how to change or remove third party access on each platform:<\/p>\n<p>Twitter: <a href=\"https:\/\/help.twitter.com\/en\/managing-your-account\/connect-or-revoke-access-to-third-party-apps\">https:\/\/help.twitter.com\/en\/managing-your-account\/connect-or-revoke-access-to-third-party-apps.<\/a><br \/>\nFacebook: <a href=\"https:\/\/www.facebook.com\/help\/262314300536014\/\">https:\/\/www.facebook.com\/help\/262314300536014\/.<\/a><br \/>\nLinkedIn: <a href=\"https:\/\/www.linkedin.com\/pulse\/remove-third-party-apps-connected-your-linkedin-hector-rodriguez\">https:\/\/www.linkedin.com\/pulse\/remove-third-party-apps-connected-your-linkedin-hector-rodriguez.<\/a><\/p>\n<p><span style=\"font-weight: 400;\">Electronic Communications<\/span><br \/>\nIf you receive commercial electronic communications from us, you can unsubscribe from the receipt of future commercial electronic communications from us by clicking on the “unsubscribe link” provided in such communications.<\/p>\n<p>Customers who have a registered account may also opt out of receiving commercial electronic communications by logging in to their SharpSpring account, clicking on “Settings,” “User Accounts,” selecting a user, then editing the options in “Notification Options.” We will comply with your request(s) within ten (10) working days.<\/p>\n<p>Please also note that if you do opt out of receiving commercial electronic communications from us, we may still send you important administrative messages (such as updates about your account or service changes), and you cannot opt out from receiving these messages.<\/li>\n<li>\n<h5 class=\"heading\">Right of Information, Access and Other Rights.<\/h5>\n<p><span style=\"font-weight: 400;\">Accessing, Correcting or Deleting Your Information<\/span><br \/>\nRegistered Users who have an account with SharpSpring have the right to review, change, or suppress personal data that we have collected from them. There are several ways to do this.<\/p>\n<p>You can update your account information and your profile settings by logging into your account.<\/p>\n<p>You can also contact us as indicated in the “How to Contact Us” section.<\/p>\n<p>We may need to retain certain information for mandatory record keeping purposes and\/or to complete any transactions that you began prior to your request. Residual information may remain within our databases and other records, but it will no longer be tied to your identity.<\/p>\n<p>We want each Registered User’s Information to be complete and accurate. To confirm the completeness and accuracy of, or make changes to, their Personal data, Registered Users are encouraged to visit their personal profile.<\/li>\n<li>\n<h5 class=\"heading\">EU\/EEA Residents: Data Subject Rights under the GDPR.<\/h5>\n<p>The EU General Data Protection Regulation (GDPR) grants individuals who are in the United Kingdom, the European Union and European Economic Area (EU\/EEA) the following rights, with some limitations. Users may contact us, at the address provided in the “How to Contact us” section below, to exercise any of those rights and we will respond with the requested action or information, or will let you know why that right does not apply to you.<\/p>\n<p><span style=\"font-weight: 400;\">Right Not to Provide Consent or to Withdraw Consent<\/span><br \/>\nWe may seek to rely on your consent in order to process certain personal data. Where we do so, you have the right not to provide your consent, and the right to withdraw your consent at any time. If you withdraw your consent, this will not affect the lawfulness of the processing conducted based on consent before its withdraw.<\/p>\n<p><span style=\"font-weight: 400;\">Right of Access<\/span><br \/>\nYou have the right to obtain confirmation as to whether or not we collect or process personal data concerning you and, if this is the case, you have the right to request a copy of such personal data in digital format.<\/p>\n<p><span style=\"font-weight: 400;\">Right of Rectification<\/span><br \/>\nYou have the right to require that we correct any inaccurate personal data concerning you, and that we complete incomplete personal data.<\/p>\n<p><span style=\"font-weight: 400;\">Right of Erasure<\/span><br \/>\nIn certain circumstances, you have the right to request that we erase personal data concerning you; for example, if it is no longer necessary for the purposes for which it was originally collected.<\/p>\n<p><span style=\"font-weight: 400;\">Right to Restrict Processing<\/span><br \/>\nIn certain circumstances, you have the right to request that we restrict the processing of the personal data that we have collected about you; for example, where you believe that the personal data that hold about you is not accurate or lawfully held.<\/p>\n<p><span style=\"font-weight: 400;\">Right to Data Portability<\/span><br \/>\nIn certain circumstances, you have the right to receive the personal data concerning you that you have provided us in a structured, commonly used, machine readable format, and the right to obtain that we transmit the data to another entity where technically feasible.<\/p>\n<p><span style=\"font-weight: 400;\">Right to Object to the Processing<\/span><br \/>\nIn certain circumstances, you have the right to request that we stop processing your personal data.<\/p>\n<p><span style=\"font-weight: 400;\">Right to Object to the Processing for Direct Marketing Purposes<\/span><br \/>\nYou have the right to request that we stop sending you marketing communications.<\/p>\n<p><span style=\"font-weight: 400;\">Right Not to be Subject to Decisions Based Solely on Automated Processing that Produce Legal Effects<\/span><br \/>\nIn certain circumstances, you have the right no to be subject to a decision based solely on automated processing – including profiling – that produces legal effects or similarly affects you.<\/p>\n<p><span style=\"font-weight: 400;\">Right to Complain to a Supervisory Authority<\/span><br \/>\nYou have the right to lodge complaint with a supervisory authority if you believe that our processing of personal data relating to you infringes the GDPR.<\/li>\n<li>\n<h5 class=\"heading\">California Residents: Rights under California Law.<\/h5>\n<p>California requires operators of websites or similar services to make certain disclosures to users who reside in California regarding their rights, specifically:<\/p>\n<p><span style=\"font-weight: 400;\">Shine the Light<\/span><br \/>\nUnder California law, a business that has an established business relationship with an individual, and has, within the immediately preceding calendar year, disclosed personal data that is primarily used for personal, family or household purposes to third party for the third party’s direct marketing purposes, must disclose to its California users, upon request, the identity of any such third party, along with the type of personal data disclosed.<\/p>\n<p>You can contact us to as provided in the “How to Contact Us” section. Please note that under California law, businesses are only required to respond to a user’s request once during any calendar year.<\/p>\n<p><span style=\"font-weight: 400;\">Do-Not-Track<\/span><br \/>\nSome browsers give individuals the ability to communicate that they wish not to be tracked while browsing on the Internet. California law requires that we disclose to users how we treat do-not-track requests. The Internet industry has not yet agreed on a definition of what &#8220;Do Not Track&#8221; means, how compliance with “Do Not Track” would be measured or evaluated, or a common approach to responding to a &#8220;Do Not Track&#8221; signal. Due to the lack of guidance, we have not yet developed features that would recognize or respond to browser-initiated Do Not Track signals in response to California law.<\/p>\n<p>In the meantime, there are technical means to prevent some of the tracking, if any. See Section &#8220;Your Advertising Choices.&#8221;<\/li>\n<li>\n<h5 class=\"heading\">Children’s Privacy.<\/h5>\n<p>Our Platform is not directed to individuals under the age of 18. We do not solicit or knowingly collect Personal data from such individuals. If you become aware that a child has provided us with personal data, please contact us as indicated in the “How to Contact Us” section below. If we obtain actual knowledge that we have collected Personal data from a child under the age of 18, we will take steps to delete such information from our database.<\/li>\n<li>\n<h5 class=\"heading\">How to Contact Us.<\/h5>\n<p><span style=\"font-weight: 400;\">In General<\/span><br \/>\nWe would love to hear your questions, concerns, and feedback about this Notice.<\/p>\n<p>You can contact us:<\/p>\n<p>By email at: <a href=\"mailto:support@pandigitalnetwork.com\">support@pandigitalnetwork.com<\/a><\/p>\n<p>By phone at:<br \/>\nUS based: <a href=\"tel:+44 20 3287 1250\">+44 20 3287 1250<\/a><br \/>\nOutside US: <a href=\"tel:1-352-310-0024\">+1 352-310-0024<\/a><\/p>\n<p>By postal mail at:<br \/>\nSharpSpring Inc<br \/>\nAttn: Privacy Compliance<br \/>\n5001 Celebration Pointe Ave<br \/>\nSuite 410<br \/>\nHong Kong 32608<\/p>\n<p>Please note that email communications are not always secure; so please do not include credit card information or sensitive information in your emails to us.<\/p>\n<p><span style=\"font-weight: 400;\">Request to Exercise Individual Rights<\/span><br \/>\nTo exercise any of your rights as described in Section 15 and Section 16, please contact us in writing, via email or postal mail as indicated above, so that we may consider your request under applicable law. Please be aware that your request will not be accepted for review unless you provide the following:<\/p>\n<div class=\"list-unstyled list-chevron\">\n<ul>\n<li>The name, user ID, pseudonym, email address, or other identifier that you have used to use our Platform, or if you are not a registered user of the service, or have not otherwise previously interacted with us, your first and last name and an address where we can correspond with you.<\/li>\n<li>State or Country in which you are located.<\/li>\n<li>Clear description of the information or content you wish to receive or to be deleted or corrected, or the action you wish to be taken; and<\/li>\n<li>Sufficient information to allow us to locate the content or information to be deleted, removed or corrected<\/li>\n<\/ul>\n<\/div>\n<p>For your protection, we may only implement requests with respect to the personal data associated with the particular email address that you use to send us your request.<\/p>\n<p>In addition, please note that, depending on the nature of your inquiry, request or complaint, we may need to verify your identity before implementing your request and may require proof of identity, such as in the form of a government issued ID and proof of geographical address.<\/p>\n<p>We will try to comply with your request as soon as reasonably practicable. However, we reserve the right to refuse to act on a request that is manifestly unfounded or excessive (for example because it is repetitive) and\/or, in some cases, to charge a fee that takes into account the administrative costs for providing the information or the communication or taking the action requested.<\/li>\n<\/ol>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; css=&#8221;.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_column]<div data-post-id='175094' class='insert-page insert-page-175094 '><style type=\"text\/css\" data-type=\"vc_custom-css\">.repeatable-module-cta-footer h3 {\r\n    font-size: 56px !important;\r\n    font-weight: 300;\r\n    line-height: 1.2;\r\n}<\/style><style type=\"text\/css\" data-type=\"vc_shortcodes-custom-css\">.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}<\/style><p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; css=&#8221;.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_column]<div class=\"jumbotron txt-dark repeatable-module-cta-footer jumbotron-center jumbotron-large jumbotron-no-border-radius\"   ><\/p>\n<h3>Ready to learn more?<\/h3>\n<p>Month-to-month options. No long-term contract required.<\/p>\n<a class=\"button button-3d full-rounded orange-dark\" href=\"\/get-a-demo\/\" target=\"_self\"  ><span>START HERE<\/span><\/a><\/div>[\/vc_column][\/vc_row]<\/p>\n<\/div>[\/vc_column][\/vc_row][\/vc_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_section el_class=&#8221;notranslate&#8221; css=&#8221;.vc_custom_1572282401053{margin-bottom: 0px !important;border-bottom-width: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_row layout=&#8221;custom&#8221; style=&#8221;module&#8221; align=&#8221;left&#8221; heading_text_color=&#8221;dark&#8221; left_image=&#8221;&#8221; right_image=&#8221;&#8221; delim_width=&#8221;&#8221; heading_margin=&#8221;&#8221; heading_font_weight=&#8221;&#8221; heading_use_google_fonts=&#8221;yes&#8221; heading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; subheading_font_weight=&#8221;&#8221; subheading_use_google_fonts=&#8221;yes&#8221; subheading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; icon_type=&#8221;&#8221; icon_fontawesome=&#8221;fa fa-adjust&#8221; icon_openiconic=&#8221;vc-oi vc-oi-dial&#8221; icon_typicons=&#8221;typcn typcn-adjust-brightness&#8221; icon_entypo=&#8221;entypo-icon entypo-icon-note&#8221; icon_linecons=&#8221;vc_li vc_li-heart&#8221; animation=&#8221;&#8221; animation_delay=&#8221;0&#8243; heading=&#8221;H1 Largest Extra Long Title Goes Here&#8221; subheading=&#8221;H2 goes here Ut eget sem nec ante mattis lacinia non ut&#8221; [&hellip;]<\/p>\n","protected":false},"author":214,"featured_media":179814,"parent":158827,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy - SharpSpring<\/title>\n<meta name=\"description\" content=\"This Acceptable Use Policy supplements the SharpSpring Partner Terms, SharpSpring Direct Customer Terms or Client Subscription Agreement between Comcopious  (“SharpSpring” or “Company”) and, as applicable, Partner, Customer or Client and governs the use of the SharpSpring Marketing Automation Platform and other SaaS (the “SaaS”). “You” in this Acceptable Use Policy refers to Partner or Client and each individual user Partner or Client authorizes to use the SaaS.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sharpspring.com\/legal\/privacy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy - SharpSpring\" \/>\n<meta property=\"og:description\" content=\"This Acceptable Use Policy supplements the SharpSpring Partner Terms, SharpSpring Direct Customer Terms or Client Subscription Agreement between Comcopious  (“SharpSpring” or “Company”) and, as applicable, Partner, Customer or Client and governs the use of the SharpSpring Marketing Automation Platform and other SaaS (the “SaaS”). “You” in this Acceptable Use Policy refers to Partner or Client and each individual user Partner or Client authorizes to use the SaaS.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sharpspring.com\/legal\/privacy\/\" \/>\n<meta property=\"og:site_name\" content=\"SharpSpring\" \/>\n<meta property=\"article:modified_time\" content=\"2020-12-18T23:02:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2018\/12\/SocialShareLarge1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"628\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"44 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sharpspring.com\/#website\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"SharpSpring\",\"description\":\"The Revenue Growth Platform\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/sharpspring.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/sharpspring.com\/legal\/privacy\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2018\/12\/SocialShareLarge1.png\",\"width\":1200,\"height\":628,\"caption\":\"SharpSpring Social Share Image\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/legal\/privacy\/#webpage\",\"url\":\"https:\/\/sharpspring.com\/legal\/privacy\/\",\"name\":\"Privacy Policy - SharpSpring\",\"isPartOf\":{\"@id\":\"https:\/\/sharpspring.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/sharpspring.com\/legal\/privacy\/#primaryimage\"},\"datePublished\":\"2019-11-01T14:53:49+00:00\",\"dateModified\":\"2020-12-18T23:02:08+00:00\",\"description\":\"This Acceptable Use Policy supplements the SharpSpring Partner Terms, SharpSpring Direct Customer Terms or Client Subscription Agreement between Comcopious  (\\u201cSharpSpring\\u201d or \\u201cCompany\\u201d) and, as applicable, Partner, Customer or Client and governs the use of the SharpSpring Marketing Automation Platform and other SaaS (the \\u201cSaaS\\u201d). \\u201cYou\\u201d in this Acceptable Use Policy refers to Partner or Client and each individual user Partner or Client authorizes to use the SaaS.\",\"breadcrumb\":{\"@id\":\"https:\/\/sharpspring.com\/legal\/privacy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sharpspring.com\/legal\/privacy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sharpspring.com\/legal\/privacy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/legal\/\",\"url\":\"https:\/\/sharpspring.com\/legal\/\",\"name\":\"Legal\"}},{\"@type\":\"ListItem\",\"position\":3,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/legal\/privacy\/\",\"url\":\"https:\/\/sharpspring.com\/legal\/privacy\/\",\"name\":\"Privacy Policy\"}}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/191412"}],"collection":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/users\/214"}],"replies":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/comments?post=191412"}],"version-history":[{"count":18,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/191412\/revisions"}],"predecessor-version":[{"id":205148,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/191412\/revisions\/205148"}],"up":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/158827"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media\/179814"}],"wp:attachment":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media?parent=191412"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}