{"id":206397,"date":"2021-03-01T13:13:00","date_gmt":"2021-03-01T18:13:00","guid":{"rendered":"https:\/\/sharpspring.com\/?page_id=206397"},"modified":"2021-03-02T17:52:42","modified_gmt":"2021-03-02T22:52:42","slug":"terms-of-service","status":"publish","type":"page","link":"https:\/\/sharpspring.com\/legal\/terms-of-service\/","title":{"rendered":"Terms of Service"},"content":{"rendered":"<p>[vc_section el_class=&#8221;notranslate&#8221; css=&#8221;.vc_custom_1572282401053{margin-bottom: 0px !important;border-bottom-width: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_row layout=&#8221;custom&#8221; style=&#8221;module&#8221; align=&#8221;left&#8221; heading_text_color=&#8221;dark&#8221; left_image=&#8221;&#8221; right_image=&#8221;&#8221; delim_width=&#8221;&#8221; heading_margin=&#8221;&#8221; heading_font_weight=&#8221;&#8221; heading_use_google_fonts=&#8221;yes&#8221; heading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; subheading_font_weight=&#8221;&#8221; subheading_use_google_fonts=&#8221;yes&#8221; subheading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; icon_type=&#8221;&#8221; icon_fontawesome=&#8221;fa fa-adjust&#8221; icon_openiconic=&#8221;vc-oi vc-oi-dial&#8221; icon_typicons=&#8221;typcn typcn-adjust-brightness&#8221; icon_entypo=&#8221;entypo-icon entypo-icon-note&#8221; icon_linecons=&#8221;vc_li vc_li-heart&#8221; animation=&#8221;&#8221; animation_delay=&#8221;0&#8243; heading=&#8221;H1 Largest Extra Long Title Goes Here&#8221; subheading=&#8221;H2 goes here Ut eget sem nec ante mattis lacinia non ut&#8221; heading_font_options=&#8221;tag:h1|font_size:56|color:%233a3042|line_height:70&#8243; subheading_font_options=&#8221;tag:h2|font_size:40|color:%2384c340|line_height:48&#8243; subheading_class=&#8221;&#8221; icon_custom_icon=&#8221;&#8221; custom_delay=&#8221;&#8221;][vc_column]<div class=\" heading-center\"><div class=\" \"  ><h1 style=\"color: #3a3042 !important; \">Terms of Service<\/h1><span class=\"custom-heading-delim\" style=\"border-top-color:#3a3042; width:140px;\"><\/span><\/div><\/div>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<ol class=\"main-list-item\">\n<li>\n<h5 class=\"heading\">Introduction.<\/h5>\n<ol>\n<li><span style=\"font-weight: 400;\">Effective Date.<\/span> The effective date of these Terms of Use is October 31, 2019.<\/li>\n<li><span style=\"font-weight: 400;\">Agreement.<\/span> Welcome! Comcopious  (&#8220;<b>SharpSpring<\/b>&#8221; or &#8220;<b>Company<\/b>&#8220;) authorizes you to access and use this SharpSpring website (the &#8220;<b>Website<\/b>&#8220;) on the condition that you agree to be bound by these terms (these &#8220;<b>Terms of Use<\/b>&#8220;) and to accept SharpSpring’s separate Privacy Policy at <a href=\"\/legal\/privacy\/\">https:\/\/sharpspring.com\/legal\/privacy\/<\/a> (the &#8220;<b>Privacy Policy<\/b>&#8220;). If you do not accept both these Terms of Use and the Privacy Policy, you may not access or use the Website, and you must immediately cease accessing or using the Website.<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">Changes to Terms of Use and Privacy Policy.<\/h5>\n<p>Internet technology and the applicable laws, rules, and regulations change frequently. Accordingly, SharpSpring reserves the right to change these Terms of Use and the Privacy Policy at any time by the posting of a new version or a change notice to the Website. It is your responsibility to review these Terms of Use and the Privacy Policy periodically. If at any time you find either these Terms of Use or the Privacy Policy unacceptable, you must immediately cease accessing and\/or using the Website. Unless SharpSpring obtains your express consent, any revised Privacy Policy will apply only to information collected by SharpSpring after the revised Privacy Policy takes effect, and not to information collected under any earlier versions of the Privacy Policy.<\/li>\n<li>\n<h5 class=\"heading\">Eligibility.<\/h5>\n<ol>\n<li><span style=\"font-weight: 400;\">Age.<\/span> This Website is not intended for use by anyone under 18 years old. If you are under the age of 18, you may use the Website only with permission of a parent or guardian.<\/li>\n<li><span style=\"font-weight: 400;\">Corporate Use.<\/span> If you are using the Website on behalf of a company, you further represent and warrant that you are authorized to act and enter into contracts on behalf of that company.<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">Consent to Receive Electronic Communications from Company.<\/h5>\n<p>By registering with the Website and providing your name, email, postal or residential address, and\/or phone number through the Website, you expressly consent to receive email and other communications from SharpSpring, both over the short term and periodically. These communications, among other things, may be about the Website, new product offers, promotions, and other matters. You may opt out of receiving electronic communications at any time by following the unsubscribe instructions contained in each communication, or by sending an email to <a href=\"mailto:support@pandigitalnetwork.com\">support@pandigitalnetwork.com<\/a>. You agree that these electronic communications satisfy any legal requirements that communications or notices to you be in writing.<\/li>\n<li>\n<h5 class=\"heading\">Third Party Sites.<\/h5>\n<p>The Website contains links to websites operated by third parties (“Third Party Sites”), some of which may have established relationships with SharpSpring and some of which may not. SharpSpring does not have control over the content and performance of Third Party Sites. SharpSpring has not reviewed, and cannot review or control, the material, including computer software or other goods or services, made available on Third Party Sites, and SharpSpring does not represent, warrant, or endorse any Third Party Sites, or the accuracy, currency, content, fitness, lawfulness, or quality of the information, material, goods, or services available through Third Party Sites. SharpSpring disclaims, and you agree to assume, all responsibility and liability for any damages or other harm, whether to you or to third parties, resulting from your use of Third Party Sites.<\/li>\n<li>\n<h5 class=\"heading\">User Content.<\/h5>\n<ol>\n<li><span style=\"font-weight: 400;\">User Content Defined.<\/span> &#8220;<b>User Content<\/b>&#8221; is any content, material, or information, not including personally identifiable information (e.g., first and last name, address, phone number, email address, etc.), that you submit, upload, and\/or post to, or transmit, display, perform, or distribute by means of the Website, whether in connection with your use of the Website or otherwise. This includes, without limitation, personal photos and videos.<\/li>\n<li><span style=\"font-weight: 400;\">You Own Your User Content.<\/span> SharpSpring does not claim ownership of any User Content. You retain all right, title, and interest, including without limitation all worldwide intellectual property rights, in and to your User Content.<\/li>\n<li><span style=\"font-weight: 400;\">License of User Content.<\/span> By submitting, uploading, or posting User Content in any form with, through, or to the Website, you grant SharpSpring a royalty-free, perpetual, non-exclusive, unrestricted, fully paid-up, worldwide, sublicensable license to copy or otherwise reproduce, modify, adapt, translate, distribute, enhance, transmit, publicly display or perform, reformat, and\/or otherwise use User Content in connection with the operation of the Website, the business of SharpSpring and its affiliates, or any other similar or related business, in any medium now existing or later devised, including without limitation in advertising and publicity. You further agree that the SharpSpring may publish or otherwise disclose your personal information in connection with its exercise of the license granted under this section. You waive any claims arising from or relating to the exercise by SharpSpring and its affiliates of the rights granted under this section, including without limitation any claims relating to your rights of personal privacy and publicity. You will not be compensated for any exercise of the license granted under this section.<\/li>\n<li><span style=\"font-weight: 400;\">Your Representations About User Content.<\/span> You represent and warrant that you: (a) own all right, title, and interest in and to all User Content you submit, or are otherwise authorized to grant the rights provided the SharpSpring and its affiliates under this section; or (b) have written consent, release, and\/or permission of every identifiable individual person in any User Content you submit to use the name and likeness of every identifiable person in the User Content. You agree that you will not submit any User Content that does not fully comply with SharpSpring’s prohibitions against Objectionable Content, as detailed in Section 7 (Objectionable Content; Defamation).<\/li>\n<li><span style=\"font-weight: 400;\">Company’s Right to Reject User Content.<\/span> SharpSpring reserves the right, in its sole discretion, to reject any User Content for any reason. The categories specified in Section 7 (Objectionable Content, Defamation) are not an exhaustive lists of content that SharpSpring reserves the right to remove or deny.<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">Objectionable Content, Defamation.<\/h5>\n<ol>\n<li>You may not use the Website to upload, post, transmit, display, perform, or distribute any content, information, or materials that: (a) are libelous, defamatory, abusive, threatening, excessively violent, harassing, obscene, lewd, lascivious, filthy, or pornographic; (b) constitute child pornography; (c) solicit personal information from or exploit in a sexual or violent manner anyone under the age of 18; (d) incite, encourage, or threaten physical harm against another; (e) promote or glorify racial intolerance, use hateful and\/or racist terms, or signify hate toward any person or group of people; (f) glamorize the use of illegal substances and\/or drugs; (g) advertise or otherwise solicit funds or constitute a solicitation for goods or services; (h) violate any provision of these Terms of Use or any other SharpSpring agreement or policy, including without limitation SharpSpring’s Privacy Policy; (i) disclose another’s personal, confidential, or proprietary information; (j) are false or fraudulent; (k) contains images or videos of individuals captured or posted without their consent; (l) promote self-destructive behavior (including without limitation eating disorders or suicide); or (m) are generally offensive, rude, mean-spirited, or in bad taste, as determined by SharpSpring in its sole discretion (collectively, &#8220;<b>Objectionable Content<\/b>&#8220;). SharpSpring disclaims any perceived, implied, or actual duty to monitor content made available through the Website, and specifically disclaims any responsibility or liability for information provided on the Website. Without limiting any of its other remedies, SharpSpring reserves the right to terminate your use of the Website or your uploading, posting, transmission, display, performance, or distribution of Objectionable Content. SharpSpring, in its sole discretion, may delete any Objectionable Content from its servers. SharpSpring intends to cooperate fully with any law enforcement officials or agencies in the investigation of any violation of these Terms of Use or of any applicable laws.<\/li>\n<li>Without limiting Section 7.1, you may be held legally responsible for damages suffered by other users or third parties as the result of your remarks, information, feedback, or other content posted or made available through the Website that are deemed defamatory or otherwise legally actionable. Under Section 230 of the Federal Communications Decency Act of 1996, SharpSpring is not legally responsible, nor can it be held liable for damages of any kind, arising out of or in connection to any defamatory or otherwise legally actionable remarks, information, feedback, or other content posted or made available through the Website.<\/li>\n<li>If you raise or file any claim against SharpSpring for conduct that an arbitrator or court later finds to constitute an “exercise of a publisher’s traditional editorial functions,” or the legal equivalent thereof, you agree to fully and immediately compensate SharpSpring for all losses, liability, damages, costs, and expenses, including without limitation all attorneys’ fees and expenses in defending the action and resolving the matter. If you fail to compensate SharpSpring for any such claim, you hereby agree and authorize SharpSpring to report your personal information, including without limitation your unpaid claim, to consumer credit reporting services, collection agencies, and others.<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">Intellectual Property.<\/h5>\n<ol>\n<li><span style=\"font-weight: 400;\">Compliance with Law.<\/span>\n<ol>\n<li><span style=\"font-weight: 400;\">General.<\/span> When using the Website, you will obey all applicable laws and respect the intellectual property rights of others. Your use of the Website is at all times subject to limitations imposed by copyright and other intellectual property laws. You must not upload, post, transmit, display, perform, or distribute any content, information, or other materials in violation of any third party’s copyrights, trademarks, or other intellectual property or proprietary rights.<\/li>\n<li><span style=\"font-weight: 400;\">User Content.<\/span> You are and will be solely responsible for any violations of any laws and for any infringements of third party rights caused by your use of the Website. SharpSpring users bear the sole burden of proving that content, information, or other materials do not violate any laws or third party rights.<\/li>\n<\/ol>\n<\/li>\n<li><span style=\"font-weight: 400;\">Trademarks.<\/span> SharpSpring and the SharpSpring logo (collectively, the &#8220;<b>Company Marks<\/b>&#8220;) are trademarks or registered trademarks of SharpSpring. Other trademarks, service marks, graphics, logos, and domain names appearing anywhere on, through, or in connection with the Website may be the trademarks of third parties. Neither your use of the Website nor these Terms of Use grant you any right, title, or interest in, or any license to reproduce or otherwise use, the Company Marks or any third party trademarks, service marks, graphics, logos, or domain names. You agree that any goodwill in the Company Marks generated as a result of your use of the Website will inure to the benefit of SharpSpring, and you agree to assign, and hereby do assign, all such goodwill to SharpSpring. You shall not at any time, nor shall you assist others to, challenge SharpSpring’s right, title, or interest in, or the validity of, the Company Marks.<\/li>\n<li><span style=\"font-weight: 400;\">Copyrighted Materials; Copyright Notice.<\/span> All content and other materials available through the Website, including without limitation the SharpSpring logo, design, text, graphics, and other files, and the selection, arrangement, and organization thereof, are either owned by SharpSpring or are the property of SharpSpring’s licensors and suppliers. Except as explicitly provided, neither your use of the Website nor these Terms of Use grant you any right, title, or interest in any such materials.<\/li>\n<li><span style=\"font-weight: 400;\">DMCA Policy.<\/span>\n<ol>\n<li>As SharpSpring asks others to respect SharpSpring’s intellectual property rights, SharpSpring respects the intellectual property rights of others. SharpSpring follows the notice and takedown procedures in the Digital Millennium Copyright Act (&#8220;<b>DMCA<\/b>&#8220;).<\/li>\n<li>If you believe content located on or linked to by the Website violates your copyright, please immediately notify SharpSpring by means of emailed DMCA takedown notice (&#8220;<b>Infringement Notice<\/b>&#8220;), providing the information described below. If SharpSpring takes action in response to an Infringement Notice, it will make a good faith attempt to contact the party who made the content available by means of the most recent email address that party provided to SharpSpring.<\/li>\n<li>Under the DMCA, you may be held liable for damages based on material misrepresentations in your Infringement Notice. You must also make a good faith evaluation of whether the use of your content is a fair use; fair uses are not infringing. (See 17 U.S.C. Section 107, available at https:\/\/www.law.cornell.edu\/uscode\/text\/17\/107, and Lenz v. Universal Music Corp., No. 13-16106 (9th Cir. Sep. 14, 2015), available at https:\/\/www.courtlistener.com\/opinion\/2937139\/stephanie-lenz-v-universal-music-corp\/.) If you are not sure if content located on or linked to by the Website infringes your copyright, you should first contact an attorney.<\/li>\n<li>The DMCA requires that all Infringement Notices must include the following:\n<ul class=\"no-style-list\">\n<li>(a) A signature, electronic or physical, of the copyright owner or a person authorized to act on their behalf;<\/li>\n<li>(b) An identification of the copyright claimed to have been infringed;<\/li>\n<li>(c) A description of the nature and location of the material that you claim to infringe your copyright, in sufficient detail to permit SharpSpring to find and positively identify that material;<\/li>\n<li>(d) Your name, address, telephone number, and email address; and<\/li>\n<li>(e) A statement by you: (i) that you believe in good faith that the use of the material that you claim to infringe your copyright is not authorized by law, or by the copyright owner or such owner’s agent; and, (ii) under penalty of perjury, that all of the information contained in your Infringement Notice is accurate, and that you are either the copyright owner or a person authorized to act on their behalf.<\/li>\n<\/ul>\n<\/li>\n<li>Infringement Notices should be sent to <a href=\"mailto:support@pandigitalnetwork.com\">support@pandigitalnetwork.com<\/a> with the subject line &#8220;DMCA Notice: (INSERT YOUR NAME OR YOUR COMPANY’S NAME).&#8221;<\/li>\n<li>SharpSpring will respond to all DMCA-compliant Infringement Notices, including, as required or appropriate, by removing the offending material or disabling all links to the offending material.<\/li>\n<li><span style=\"font-weight: 400;\">Disclosure.<\/span> All received Infringement Notices may be posted in full to the Lumen database (<a href=\"https:\/\/lumendatabase.org\/\">https:\/\/lumendatabase.org\/<\/a>), previously known as the Chilling Effects Clearinghouse.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">Disclaimers; Limitation of Liability.<\/h5>\n<ol>\n<li><span style=\"font-weight: 400;\">No Warranties.<\/span> SharpSpring, on behalf of itself and its licensors and suppliers, hereby expressly disclaims any and all warranties, express or implied, regarding the Website, arising by operation of law or otherwise, including without limitation any and all implied warranties of merchantability, fitness for a particular purpose, non-infringement, no encumbrance, or title, in addition to any warranties arising from a course of dealing, usage, or trade practice. Neither SharpSpring nor its licensors or suppliers warrants that the Website will meet your requirements, or that the operation of the Website will be uninterrupted or error-free. SharpSpring disclaims all implied liability for damages arising out of the furnishing of the Website pursuant to these Terms of Use, including without limitation, mistakes, omissions, interruptions, delays, tortious conduct, errors, representations, or other defects arising out of the failure to furnish the Website, whether caused by acts of commission or omission, or any other damage occurring. SharpSpring shall not be liable for any indirect, incidental, special, consequential, or punitive damages (including without limitation damages for lost profits or lost revenues), whether caused by the acts or omissions of SharpSpring, its affiliates, or SharpSpring users, or their agents or representatives.<\/li>\n<li><span style=\"font-weight: 400;\">Limitation of Liability.<\/span> In no event shall SharpSpring or its licensors or suppliers be liable to you for any claims arising from your use with the Website, including without limitation for special, incidental, or consequential damages, lost profits, lost data or confidential or other information, loss of privacy, costs of procurement of substitute goods or services, failure to meet any duty including without limitation of good faith or of reasonable care, negligence, or otherwise, regardless of the foreseeability of those damages or of any advice or notice given to SharpSpring or its licensors and suppliers arising out of or in connection with your use of the Website. This limitation shall apply regardless of whether the damages arise out of breach of contract, tort, or any other legal theory or form of action. You agree that this limitation of liability represents a reasonable allocation of risk and is a fundamental element of the basis of the bargain between SharpSpring and you. The Website would not be provided without such limitations.<\/li>\n<li><span style=\"font-weight: 400;\">Application of Disclaimers.<\/span> The above disclaimers, waivers, and limitations do not in any way limit any other disclaimer of warranties or any other limitation of liability in any other agreement between you and SharpSpring or between you and any of SharpSpring’s licensors and suppliers. Some jurisdictions may not allow the exclusion of certain implied warranties or the limitation of certain damages, so some of the above disclaimers, waivers, and limitations of liability may not apply to you. SharpSpring’s licensors and suppliers are intended third party beneficiaries of these disclaimers, waivers, and limitations. No advice or information, whether oral or written, obtained by you through the Website or otherwise shall alter any of the disclaimers or limitations stated in this section.<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">Indemnity by You.<\/h5>\n<ol>\n<li>Without limiting any indemnification provision of these Terms of Use, you (the &#8220;<b>Indemnitor<\/b>&#8220;) agree to defend, indemnify, and hold harmless SharpSpring, its affiliates and their respective officers, directors, employees and representatives (collectively, the &#8220;<b>Indemnitees<\/b>&#8220;) from and against any and all claims, actions, demands, causes of action, and other proceedings (individually, &#8220;<b>Claim<\/b>&#8220;, and collectively, &#8220;<b>Claims<\/b>&#8220;), including but not limited to legal costs and fees, and providing sole and exclusive control of the defense of any action to SharpSpring, including the choice of legal counsel and all related settlement negotiations, arising out of or relating to: (i) the relationship between you and SharpSpring, whether based in contract, tort, statute, fraud, misrepresentation, or any other legal theory; (ii) your breach of these Terms of Use, including without limitation any representation or warranty contained in these Terms of Use; (iii) your access to or use of the Website; (iv) your provision to SharpSpring or any of the Indemnitees of information or other data; (v) your violation or alleged violation of any foreign or domestic, international, federal, state, or local law or regulation; or (vi) your violation or alleged violation of any third party’s copyrights, trademarks, or other intellectual property or proprietary rights.<\/li>\n<li>The Indemnitees each have the individual right, but not the obligation, to participate through counsel of their choice in any defense by you of any Claim as to which you are required to defend, indemnify, or hold harmless any, each, and\/or all Indemnitees. You may not settle any Claim without the prior written consent of SharpSpring.<\/li>\n<li>Without limitation, the Indemnitor also hereby agrees to compensate SharpSpring for any and all lost revenues, future lost profits, reasonable search costs, and any other reasonable expenses resulting from any Indemnitor violation of Section 7 (Objectionable Content, Defamation), including without limitation any suspension of affiliate accounts or affiliate payment attributable to fraudulent efforts to manipulate or otherwise modify reported impressions generated by the SharpSpring or its affiliates under any affiliate advertising agreement.<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">Notices.<\/h5>\n<p>All notices required or permitted to be given under these Terms of Use must be in writing.<\/p>\n<ol>\n<li>SharpSpring shall give any notice by email sent to the most recent email address, if any, provided by the intended recipient to SharpSpring or by posting the notice to the Website. You agree that any notice received from SharpSpring electronically or posted to the Website satisfies any legal requirement that such notice be in writing.<\/li>\n<li>You bear the sole responsibility of ensuring that your email address on file with SharpSpring is accurate and current, and notice to you shall be deemed effective upon the sending by SharpSpring of an email to that address.<\/li>\n<li>You shall give any notice to SharpSpring by means of email to <a href=\"mailto:support@pandigitalnetwork.com\">support@pandigitalnetwork.com<\/a>.<\/li>\n<\/ol>\n<\/li>\n<li>\n<h5 class=\"heading\">General.<\/h5>\n<ol>\n<li><span style=\"font-weight: 400;\">Entire Agreement.<\/span> These Terms of Use constitutes the entire agreement between SharpSpring and you concerning your use of the Website.<\/li>\n<li><span style=\"font-weight: 400;\">Partial Invalidity.<\/span> Should any part of these Terms of Use be declared invalid, void, or unenforceable by a Court of Competent Jurisdiction, such decision shall not affect the validity of any remaining portion hereof, which shall remain in full force and effect, and the parties hereby acknowledge and agree that they would have executed the remaining portion hereof without including the part so declared by a Court of Competent Jurisdiction to be invalid, void, or unenforceable.<\/li>\n<li><span style=\"font-weight: 400;\">Amendments.<\/span> SharpSpring may change these Terms of Use from time to time by posting the amended Terms of Use on the Website.<\/li>\n<li><span style=\"font-weight: 400;\">No Waiver.<\/span> A waiver by either party of any term or condition of these Terms of Use, or any breach, in any one instance, will not waive that term or condition or any later breach.<\/li>\n<li><span style=\"font-weight: 400;\">Assignment.<\/span> These Terms of Use and all of your rights and obligations under it will not be assignable or transferable by you without the prior written consent of SharpSpring. These Terms of Use will be binding upon and will inure to the benefit of the parties, their successors, and permitted assigns.<\/li>\n<li><span style=\"font-weight: 400;\">Governing Law; Arbitration.<\/span> These Terms of Use are governed by laws of Chesterfield, without regard to the choice or conflicts of law provisions of any jurisdiction. Any dispute, claim, or controversy arising out of or relating to these Terms of Use or the enforcement, interpretation or validity thereof, including the determination of the scope or applicability of this Section 12.6, will be determined by arbitration in Chesterfield before one arbitrator. The arbitration will be administered by JAMS pursuant to its Comprehensive Arbitration Rules and Procedures. Judgment on the Award may be entered in any court having jurisdiction. This Section 12.6 will not preclude SharpSpring from seeking provisional remedies in aid of arbitration or from protecting or enforcing SharpSpring’s intellectual property rights, in either case from any federal or state court that has jurisdiction over the subject matter and is located in the state of Chesterfield.<\/li>\n<li><span style=\"font-weight: 400;\">Injunctive Relief.<\/span> You acknowledge and agree that any actual or threatened breach of these Terms of Use or infringement of proprietary or other third party rights by you would cause irreparable injury to SharpSpring and SharpSpring’s licensors and suppliers, and would therefore entitle SharpSpring or SharpSpring’s licensors or suppliers, as the case may be, to injunctive relief.<\/li>\n<li><span style=\"font-weight: 400;\">Headings.<\/span> The headings in these Terms of Use are for convenience only, and shall have no legal or contractual effect.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; css=&#8221;.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_column]<div data-post-id='175094' class='insert-page insert-page-175094 '><style type=\"text\/css\" data-type=\"vc_custom-css\">.repeatable-module-cta-footer h3 {\r\n    font-size: 56px !important;\r\n    font-weight: 300;\r\n    line-height: 1.2;\r\n}<\/style><style type=\"text\/css\" data-type=\"vc_shortcodes-custom-css\">.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}<\/style><p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; css=&#8221;.vc_custom_1504794984035{padding-top: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_column]<div class=\"jumbotron txt-dark repeatable-module-cta-footer jumbotron-center jumbotron-large jumbotron-no-border-radius\"   ><\/p>\n<h3>Ready to learn more?<\/h3>\n<p>Month-to-month options. No long-term contract required.<\/p>\n<a class=\"button button-3d full-rounded orange-dark\" href=\"\/get-a-demo\/\" target=\"_self\"  ><span>START HERE<\/span><\/a><\/div>[\/vc_column][\/vc_row]<\/p>\n<\/div>[\/vc_column][\/vc_row][\/vc_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_section el_class=&#8221;notranslate&#8221; css=&#8221;.vc_custom_1572282401053{margin-bottom: 0px !important;border-bottom-width: 0px !important;padding-bottom: 0px !important;}&#8221;][vc_row layout=&#8221;custom&#8221; style=&#8221;module&#8221; align=&#8221;left&#8221; heading_text_color=&#8221;dark&#8221; left_image=&#8221;&#8221; right_image=&#8221;&#8221; delim_width=&#8221;&#8221; heading_margin=&#8221;&#8221; heading_font_weight=&#8221;&#8221; heading_use_google_fonts=&#8221;yes&#8221; heading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; subheading_font_weight=&#8221;&#8221; subheading_use_google_fonts=&#8221;yes&#8221; subheading_custom_fonts=&#8221;font_family:Open%20Sans%3A300%2C300italic%2Cregular%2Citalic%2C600%2C600italic%2C700%2C700italic%2C800%2C800italic|font_style:300%20light%20regular%3A300%3Anormal&#8221; icon_type=&#8221;&#8221; icon_fontawesome=&#8221;fa fa-adjust&#8221; icon_openiconic=&#8221;vc-oi vc-oi-dial&#8221; icon_typicons=&#8221;typcn typcn-adjust-brightness&#8221; icon_entypo=&#8221;entypo-icon entypo-icon-note&#8221; icon_linecons=&#8221;vc_li vc_li-heart&#8221; animation=&#8221;&#8221; animation_delay=&#8221;0&#8243; heading=&#8221;H1 Largest Extra Long Title Goes Here&#8221; subheading=&#8221;H2 goes here Ut eget sem nec ante mattis lacinia non ut&#8221; [&hellip;]<\/p>\n","protected":false},"author":214,"featured_media":179814,"parent":158827,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms of Service - SharpSpring<\/title>\n<meta name=\"description\" content=\"Terms and conditions of using SharpSpring marketing automation\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sharpspring.com\/legal\/terms-of-service\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms of Service - SharpSpring\" \/>\n<meta property=\"og:description\" content=\"Terms and conditions of using SharpSpring marketing automation\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sharpspring.com\/legal\/terms-of-service\/\" \/>\n<meta property=\"og:site_name\" content=\"SharpSpring\" \/>\n<meta property=\"article:modified_time\" content=\"2021-03-02T22:52:42+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2018\/12\/SocialShareLarge1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"628\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"20 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sharpspring.com\/#website\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"SharpSpring\",\"description\":\"The Revenue Growth Platform\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/sharpspring.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2018\/12\/SocialShareLarge1.png\",\"width\":1200,\"height\":628,\"caption\":\"SharpSpring Social Share Image\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/#webpage\",\"url\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/\",\"name\":\"Terms of Service - SharpSpring\",\"isPartOf\":{\"@id\":\"https:\/\/sharpspring.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/#primaryimage\"},\"datePublished\":\"2021-03-01T18:13:00+00:00\",\"dateModified\":\"2021-03-02T22:52:42+00:00\",\"description\":\"Terms and conditions of using SharpSpring marketing automation\",\"breadcrumb\":{\"@id\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sharpspring.com\/legal\/terms-of-service\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/legal\/\",\"url\":\"https:\/\/sharpspring.com\/legal\/\",\"name\":\"Legal\"}},{\"@type\":\"ListItem\",\"position\":3,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/\",\"url\":\"https:\/\/sharpspring.com\/legal\/terms-of-service\/\",\"name\":\"Terms of Service\"}}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/206397"}],"collection":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/users\/214"}],"replies":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/comments?post=206397"}],"version-history":[{"count":2,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/206397\/revisions"}],"predecessor-version":[{"id":206448,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/206397\/revisions\/206448"}],"up":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/pages\/158827"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media\/179814"}],"wp:attachment":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media?parent=206397"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}