{"id":10913,"date":"2020-04-30T09:00:12","date_gmt":"2020-04-30T16:00:12","guid":{"rendered":"https:\/\/www.tryinteract.com\/blog\/?p=10913"},"modified":"2021-06-01T12:51:49","modified_gmt":"2021-06-01T19:51:49","slug":"how-to-make-a-buzzfeed-style-quiz","status":"publish","type":"post","link":"https:\/\/www.tryinteract.com\/blog\/how-to-make-a-buzzfeed-style-quiz\/","title":{"rendered":"How to Make a Buzzfeed Style Quiz People Love"},"content":{"rendered":"\n<p>When I was younger, I, along with millions of other teenage girls, couldn’t wait for my Teen magazine to come. And every month, like clockwork, it would arrive in our mailbox.<\/p>\n\n\n\n<p>I would rush to my room, flip it open, and immediately take the quiz.&nbsp;<\/p>\n\n\n\n<p>Who was my celebrity crush? Which teenage star was destined to be my BFF? Whose fashion sense did I have?<\/p>\n\n\n\n<p>It didn’t matter what the quiz was about or what it actually told me, I just loved the quizzes.<\/p>\n\n\n\n<p>As I got older, my tastes changed, but my love for quizzes didn’t.<\/p>\n\n\n\n<p>It just moved online to <a href=\"https:\/\/www.buzzfeed.com\/quizzes\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Buzzfeed quizzes<\/a>.<\/p>\n\n\n\n<p>And I’m not the only one.<\/p>\n\n\n\n<p>People are making, taking, and sharing Buzzfeed style quizzes like never before. The popularity of social media and the ability to share your favorite quizzes and results with your friends has made it possible for a seemingly simple quiz to be seen and taken by millions of people, all over the world.<\/p>\n\n\n\n<p>What’s even more incredible is businesses can use this exact approach to grow their reach and their bottomline. <a href=\"https:\/\/www.tryinteract.com\/\">Interact<\/a> clients have been at this for a while, and they’ve gotten <a href=\"https:\/\/www.tryinteract.com\/customers\/\">some amazing results<\/a>! With all of the leads, clients, and sales gotten through quizzes, it’s easy to see that they work.&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<p>Related: <a href=\"https:\/\/www.tryinteract.com\/blog\/sell-online-courses-how-kaye-putnam-generated-100k-revenue-from-her-quiz\/\">How Kaye Putnam generated $100K from a quiz<\/a><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https:\/\/www.tryinteract.com\/blog\/quiz-funnel-interview-with-chanti-zak\/\">Chanti Zak made $50,000 with a quiz<\/a><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https:\/\/www.tryinteract.com\/blog\/elizabeth-mccravy-personality-quiz\/\">How Elizabeth McCravy generated $65K with a quiz<\/a><\/p>\n\n\n\n<p>So, today I’m sharing what a Buzzfeed style quiz is, how to make one, and how you can use that quiz to grow your business!<\/p>\n\n\n\n<h2>What’s a Buzzfeed style quiz?<\/h2>\n\n\n\n<p>Before we get into how to make a Buzzfeed style quiz, let’s discuss what one is.<\/p>\n\n\n\n<p>A Buzzfeed quiz is built on the <a href=\"https:\/\/www.buzzfeed.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Buzzfeed<\/a> platform, but you can build a Buzzfeed <strong>style<\/strong> quiz on other platforms.&nbsp;<\/p>\n\n\n\n<p>Including <a href=\"https:\/\/www.tryinteract.com\/\">Interact Quiz Builder<\/a>.<\/p>\n\n\n\n<p>At its heart, a Buzzfeed quiz is a <a href=\"https:\/\/www.tryinteract.com\/blog\/how-to-write-a-personality-quiz-for-business-results\/\">personality quiz<\/a>. For a personality quiz, the answer choices for the questions connect with one of the results. These results are personality categories that fit with the topic of the quiz. The quiz result shows whichever personality category shows up the most.<\/p>\n\n\n\n<p>These quizzes answer questions like “What type of _______ are you?” or “What’s your _______ superpower?” Or even “What ________ do you fit best with?”<\/p>\n\n\n\n<p>And the results reveal something about you and your personality.<\/p>\n\n\n\n<p>But a Buzzfeed style quiz is more than a personality quiz.&nbsp;<\/p>\n\n\n\n<p>There’s a specific feel to the quiz that increases its Buzzfeediness! (That’s a word, right??)&nbsp;<\/p>\n\n\n\n<p><strong>Buzzfeed quizzes are fun<\/strong>. They’re often about pop culture topics like celebrities, movies, music, books, TV shows, or events that people are interested in. They use language and images that add to the fun vibe. The quizzes are quick and easy, so they’re the perfect way to kill a few minutes. Sometimes, the quiz feels so silly that you just have to take it to try to figure out how they make the connection!&nbsp;<\/p>\n\n\n\n<p><strong>Buzzfeed quizzes are positive. <\/strong>The results that you get in a Buzzfeed style quiz are written in a way that feels positive. They aren’t going to criticize you. They’re not going to make you face horrible truths about yourself. The results are as fun and fluffy as the quiz itself. They’re most likely going to be results that you’re happy to get and happy to share.&nbsp;<\/p>\n\n\n\n<p><strong>Buzzfeed quizzes are shareable<\/strong>. Because they’re fun, related to pop culture, and offer positive results, Buzzfeed style quizzes are very likely to be shared on social media. People are more likely to share things they enjoy, and you usually can’t scroll through your Facebook or Twitter feed without seeing a few quizzes that your friends have taken.&nbsp;<\/p>\n\n\n\n<p>Plus, then you want to take the quiz to see what results you get.<\/p>\n\n\n\n<h2>Why people love Buzzfeed quizzes<\/h2>\n\n\n\n<p>Now that we’re clear on what gives a Buzzfeed quiz its distinct style, it’s important to discuss why people love them!&nbsp;<\/p>\n\n\n\n<h3>Quizzes tell people about themselves<\/h3>\n\n\n\n<p>People like to learn about themselves. Buzzfeed quizzes let people view themselves in a different way. They might discover something about themselves they didn’t know before.<\/p>\n\n\n\n<p>They might get confirmation for something they suspected, but they weren’t really sure if it was true or not.<\/p>\n\n\n\n<p>In <a href=\"https:\/\/www.tryinteract.com\/blog\/10-things-you-can-learn-from-buzzfeed-quizzes\/\">10 Things You Can Learn from Buzzfeed Quizzes<\/a>, Josh points out that the Buzzfeed style quiz is all about “you.” The titles include the word “you,” the questions are all about you, and the results are about you.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh4.googleusercontent.com\/SpHl4YC1NzeVH2lMVUkXyrGSMtO0hKC_QRPu4TYYixu8zdxkcMFGOc36a-YyYCrbMyJtTE6miLdtzMJmbcQEECERyEjOOpFt7EjzD8JNCeeDO7jYcq6n9VqsJOht31nu21wQvh9k\" alt=\"Buzzfeed quiz titles\"\/><\/figure><\/div>\n\n\n\n<p>Looking at the Buzzfeed quiz examples above, you can see that he’s right!&nbsp;<\/p>\n\n\n\n<p>In a post on Buffer about <a href=\"https:\/\/buffer.com\/resources\/the-most-popular-words-in-most-viral-headlines\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">the elements of a viral headline<\/a>, they discuss how the words “you” and “your” are the 5th and 13th most common words found in viral headlines.&nbsp;<\/p>\n\n\n\n<p>If you think about a quiz title as a headline and the fact that it’s common for Buzzfeed style quizzes, it makes perfect sense.<\/p>\n\n\n\n<p>There’s even more evidence in <a href=\"https:\/\/marketingland.com\/what-makes-you-click-on-a-headline-70364\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">this study out of Norway<\/a> that found that headlines with the highest number of clicks were questions that referenced the reader with the word you. <br><br>Now go back and look at the Buzzfeed quizzes above.<\/p>\n\n\n\n<p>Notice anything?<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/qVjY6W3_ws4zCQfxEikO8FYKlyjFllQbTwtO1IrZzVeA3LSWKFLzYOm6QbO2vlGYg8y9jXDrqRcn9OubR72ofNtCXicEH0MOBBvdh-jjTOMHMw24FSjK1caY5v4OSULASK2HezHh\" alt=\"\"\/><\/figure><\/div>\n\n\n\n<p>Of all of the quizzes from the Buzzfeed screenshot above, only two of them are not questions with “you” in them!&nbsp;<\/p>\n\n\n\n<p>It’s easy to see how quiz titles end up going viral.<\/p>\n\n\n\n<p>Plus, the Buzzfeed style quiz gives people the opportunity to share the information they learn about themselves with other people. Once they take the quiz, they can click that share button and tell everyone the results they got.&nbsp;<\/p>\n\n\n\n<p>But, like all aspects of social media, you can filter what result we share with others. You can even retake the quiz until you get results that you like and want to share with others.&nbsp;<\/p>\n\n\n\n<p>Or maybe that’s just me??<\/p>\n\n\n\n<h3>Buzzfeed quizzes help people feel connected<\/h3>\n\n\n\n<p>It can be difficult to find the place where we belong in the world. People feel isolated or wonder who they are and where they fit.<\/p>\n\n\n\n<p>Buzzfeed style quizzes can help people find out how they’re connected to other people, places, ideas, etc. In a <a href=\"https:\/\/slate.com\/human-interest\/2014\/01\/buzzfeed-quizzes-taking-over-facebook-feeds-what-makes-them-so-shareable.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">post on Slate about why people share quizzes on Facebook<\/a>, the author states that quizzes “provide us with the instant affirmation that we share some part of ourselves with other people.”<\/p>\n\n\n\n<p>They provide the reassurance that we fit into the categories of the quiz and we have the positive qualities that the Buzzfeed style quizzes identify.<\/p>\n\n\n\n<p>And, even more importantly, there are others out there that have those qualities, too.<\/p>\n\n\n\n<p>I know it makes me feel like I belong when I take <a href=\"https:\/\/www.buzzfeed.com\/savibm\/create-a-full-face-all-makeup-and-we-will-reveal-w-4gk174cqod\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">a quiz<\/a> that tells me that my make-up style shows that I’m like Mulan.&nbsp;<\/p>\n\n\n\n<p>She’s a strong, independent character, and it shows that my approach to make-up was somewhere on the list.&nbsp;<\/p>\n\n\n\n<p>I fit in!<\/p>\n\n\n\n<h3>They’re fun<\/h3>\n\n\n\n<p>I know I stated above that the Buzzfeed style quiz is fun, but it really is one of the top reasons people love them. They like that the quiz provides a momentary distraction. People enjoy how they can explore different parts of pop culture.&nbsp;<\/p>\n\n\n\n<p>Plus, there are usually lots of images and GIFs, which make the quizzes even more appealing!<\/p>\n\n\n\n<p>In an <a href=\"https:\/\/www.huffpost.com\/entry\/buzzfeed-quiz-how-do-they-work_n_4810992\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">interview about Buzzfeed quizzes<\/a> for Huffington Post, Summer Anne Burton, a former Managing Editorial Director for Buzzfeed, explains that Buzzfeed style quizzes are a game. People like to see what results they get and share them with others.<\/p>\n\n\n\n<p>She compares this style of quiz to astrology because they’re not based on scientific method and they don’t necessarily tell you much about yourself, but they’re entertaining.<\/p>\n\n\n\n<p>They’re fun to take, they give an interesting bit of information about you, and the shareability of the results means you can find out the same information about your friends and family.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https:\/\/www.tryinteract.com\/plans\/\"><img loading=\"lazy\" src=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Make-Your-own-Quiz-17.png\" alt=\"\" class=\"wp-image-11920\" width=\"452\" height=\"80\" srcset=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Make-Your-own-Quiz-17.png 904w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Make-Your-own-Quiz-17-300x53.png 300w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Make-Your-own-Quiz-17-768x136.png 768w\" sizes=\"(max-width: 452px) 100vw, 452px\" \/><\/a><\/figure><\/div>\n\n\n\n<h2>How quizzes help businesses<\/h2>\n\n\n\n<p>It’s easy to see why Buzzfeed quizzes appeal to the people who take the quizzes, but it’s not clear why or how quizzes help businesses.&nbsp;<\/p>\n\n\n\n<p>There are actually a few ways that this style of quiz can benefit the business that creates and shares it. Here are a few:<\/p>\n\n\n\n<ul><li>Quizzes generate leads;<\/li><li>Quizzes drive traffic;<\/li><li>Quizzes get shared;<\/li><\/ul>\n\n\n\n<p>Let’s discuss each of these in more detail to truly understand the benefits they can have for businesses.<\/p>\n\n\n\n<h3>Quizzes generate leads<\/h3>\n\n\n\n<p>If you’re familiar with Interact, you know that we believe strongly in <a href=\"https:\/\/www.tryinteract.com\/blog\/lead-generating-quiz-advice-from-experts\/\">the power of a quiz to attract people to businesses and convert them into paying customers<\/a>. It’s the entire purpose behind what we do!<\/p>\n\n\n\n<p>The process generally goes like this.&nbsp;<\/p>\n\n\n\n<p>A customer creates a quiz on <a href=\"https:\/\/dashboard.tryinteract.com\/register\">Interact<\/a> that would interest their ideal customer. The ideal customer takes the quiz and enters their email to get the results. That email address gets added to our customer’s mailing list. Automations created through our customer’s email marketing platform nurture the ideal customer to book a call, buy a product, sign up for a course, or purchase a service.<\/p>\n\n\n\n<p>Buzzfeed style quizzes are a great way to get people to sign up for your list. Interact clients have been very successful at generating <a href=\"https:\/\/www.tryinteract.com\/customers\/\">thousands of leads<\/a> with their quizzes. The quizzes have a high conversion rate for subscribing to the email list and they often see a ridiculously low ad spend per conversion.<\/p>\n\n\n\n<p>There is one important thing to keep in mind when creating Buzzfeed style quizzes for generating leads.&nbsp;<\/p>\n\n\n\n<p>This style of quiz is not going to generate money for you directly. People won’t pay you money just for giving them a quiz result.&nbsp;<\/p>\n\n\n\n<p>Quizzes usually work well at the top of a sales funnel (TOF). Quite often, they’re taken by people who aren’t familiar with your company and your product. That means they won’t just give you money right away.<\/p>\n\n\n\n<p>You have to work to nurture that relationship to get them to know you and trust you.<\/p>\n\n\n\n<p>Through automated email sequences, interactions on social media, and information that you provide them through your website and\/or calls, you have the opportunity to show your value AND get them to hire you or buy from you.<\/p>\n\n\n\n<p>A Buzzfeed style quiz can be an excellent first step in gaining new clients or customers for your business!<\/p>\n\n\n\n<h3>Quizzes drive traffic<\/h3>\n\n\n\n<p>When someone goes to your website to take a quiz, they’re voluntarily visiting your website.<\/p>\n\n\n\n<p>That means there’s the potential for them to visit other parts of your website.&nbsp;<\/p>\n\n\n\n<p>Josh, who is the co-Founder of Interact, does a great job of explaining how Buzzfeed does exactly that in <a href=\"https:\/\/www.business2community.com\/social-media\/makes-buzzfeed-quizzes-popular-01335537\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">a post on what makes Buzzfeed so popular<\/a> for Business 2 Community.<\/p>\n\n\n\n<p>He explains how you go to Buzzfeed to take a quiz and then see other content displayed on the page, so you click those links. You might find lists you want to read or celebrity gossip you can’t live without. While “you originally took a quiz for fun, &#8230; now you’re sifting through BuzzFeed’s site for other random tidbits of social information.”&nbsp;<\/p>\n\n\n\n<p>As a business owner, you can be even more specific in what content you want your quiz-takers to view.&nbsp;<\/p>\n\n\n\n<p>On <a href=\"https:\/\/www.tryinteract.com\/blog\/quiz-result-landing-pages\/\">your results page<\/a>, you can share resources that are specific to the quiz results.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/chantizak.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Chanti Zak<\/a> does this in her quiz results, where she lists blog posts people can read to help them.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh5.googleusercontent.com\/jMtLvGjfcc2xBIv09bKj7FZuZmUjY3Ujj04rdyPgbFftrDBGGoYctt8CcPsp6iT0hY805EJVH_AxJuSOiKp5GyFwcwlNnfozVlnMZaSFnbx9vdDSVMNwywz5acg7KqouLY8s7u4n\" alt=\"quiz result recommended blog content\"\/><\/figure><\/div>\n\n\n\n<p><a href=\"https:\/\/jennakutcher.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Jenna Kutcher<\/a> includes a list of her podcast episodes that can help the quiz-takers out.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/TLBOU1QXyevq_n1SOGb8M167App91_-yodAnQhl9lvraGw0tcc7XX0pSZB8ml_nOqN1lRpF_sEmbwYtHmK8qcC0KD6DsihWsCW_qF9aTj64xKevd6bS4xKC26Vwgeb0-Ljs2lLn-\" alt=\"Goal Digger podcast list for Empire Maker quiz result\"\/><\/figure><\/div>\n\n\n\n<p>A quiz is a great way to drive traffic to specific content on your website.<\/p>\n\n\n\n<p>A quick note about traffic to your website &#8211; If you add your quiz to your website on a traditional landing page and don’t include content that you want your quiz-taker to view, you’ll miss out on this extra traffic.<\/p>\n\n\n\n<p>The purpose of a landing page is to focus on the one action that you want the viewer to take.&nbsp;<\/p>\n\n\n\n<p>In this case, the action is taking the quiz. Because a landing page does not have a menu or a footer with links to other parts of your website, there’s no way for the quiz-taker to get to your content.<\/p>\n\n\n\n<p>That’s why it’s a great idea to then include specific links in your results page for your visitors!<\/p>\n\n\n\n<h3>Quizzes get shared<\/h3>\n\n\n\n<p>A final way that a Buzzfeed style quiz in particular can help a business is it gets shared on social media.<\/p>\n\n\n\n<p>So, someone takes your quiz and gets their results. They like the results, and they decide to share them on social media.&nbsp;<\/p>\n\n\n\n<p>Their friends see the results as they’re scrolling through their Facebook feed and are intrigued. They click through the link, take the quiz, and subscribe to your list to get their results.&nbsp;<\/p>\n\n\n\n<p>After they’re finished, the second contact shares the quiz results with their followers on Twitter and even more people see the results from your quiz.<\/p>\n\n\n\n<p>And the process can repeat itself over and over.&nbsp;<\/p>\n\n\n\n<p>It’s a great way to get tons of new subscribers for your email list!<\/p>\n\n\n\n<p>A word of caution &#8211; not every person who sees and takes your quiz through organic sharing is going to be your target audience, especially with a Buzzfeed style quiz.<\/p>\n\n\n\n<p>Since these quizzes are more “fun” than deep, meaty content,you might end up with people on your list that don’t really fit.<\/p>\n\n\n\n<p>That’s why it’s essential to practice good list hygiene and try to re-engage or unsubscribe people who aren’t interested in your products or services.<\/p>\n\n\n\n<p>But, if your quiz gets seen by the right people on social media, you could end up with subscribers who you had no connection with before.&nbsp;<\/p>\n\n\n\n<p>Quizzes that get shared and convert on social media are worth the work.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https:\/\/www.tryinteract.com\/plans\/\"><img loading=\"lazy\" src=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Start-Collecting-Leads-8.png\" alt=\"\" class=\"wp-image-11921\" width=\"452\" height=\"80\" srcset=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Start-Collecting-Leads-8.png 904w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Start-Collecting-Leads-8-300x53.png 300w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Start-Collecting-Leads-8-768x136.png 768w\" sizes=\"(max-width: 452px) 100vw, 452px\" \/><\/a><\/figure><\/div>\n\n\n\n<h2>How to make a Buzzfeed style quiz<\/h2>\n\n\n\n<p>Now that you’re convinced that the Buzzfeed quiz is worth the effort, I’m actually going to take you step-by-step how to make one!&nbsp;<\/p>\n\n\n\n<p>The steps we’re working through include:<\/p>\n\n\n\n<ul><li>Planning your quiz;<\/li><li>Creating your results;<\/li><li>Adding your questions;<\/li><li>Mapping your answers;<\/li><li>Styling the quiz;<\/li><\/ul>\n\n\n\n<p>And, since I’m writing the post, I’m going to create a Buzzfeed style quiz that’ll fit with my business. (When I’m not writing for Interact, I specialize in email marketing.)<\/p>\n\n\n\n<h3>Planning your quiz<\/h3>\n\n\n\n<p>Even Buzzfeed style quizzes, which sometimes feel like there are no connections between the questions, answers, and results, have a plan to move people through the quiz to the designated result.<\/p>\n\n\n\n<p>So, it’s important to take the time to plan your quiz.<\/p>\n\n\n\n<p>The first thing you need to decide is what quiz topic would appeal to your audience. And, since this is a Buzzfeed style quiz, what aspect of pop culture or fun would appeal to your people.<\/p>\n\n\n\n<p>So my quiz will be about email. It might not sound like it’ll be a fun quiz, but I promise it will be!&nbsp;&nbsp;<\/p>\n\n\n\n<p>I love a good pop culture quiz, so I think I’ll go with a favorite TV show.<\/p>\n\n\n\n<p>This is where it’s important to consider what audience you want to appeal to. Since TV shows fit with different age groups, I want to choose a show or genre that my target audience would fit with.<\/p>\n\n\n\n<p>If I wanted to appeal to the baby boomers, I might use classic TV shows like “Leave It to Beaver” or “MASH.”<\/p>\n\n\n\n<p>For Generation X, it might be something like sit-coms for the 1980s and 90s, like “Full House” and “Friends.”<\/p>\n\n\n\n<p>And millennials might resonate with “Friends” and “Parks and Recreation.”<\/p>\n\n\n\n<p>Since I’m trying to appeal to an audience who has a small business, I’m going with “Friends” for my TV show.<\/p>\n\n\n\n<p>Plus, it’s my favorite!<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh6.googleusercontent.com\/UVlIT-fJRKoXzjhtJgqsSSRbNLBDr5TGeFDxqwIl5xKrTTM1nJ23hQEq4453VJJJ36SPOOpl9JSPkJENXtmcuN-RtKoVKHlE9l3D19oXqQpk2MG2dAfOtxIWOgrR74ZTx2KQGFzu\" alt=\"Friends GIF\"\/><\/figure><\/div>\n\n\n\n<p>Once I decide the topic and my TV show, it’s time to figure out what my Buzzfeed style quiz is going to show the quiz-taker about email.<\/p>\n\n\n\n<p>For “Friends,” I’m sticking with the results of the six main characters for “Friends”: Joey, Monica, Chandler, Phoebe, Ross, and Rachel.<\/p>\n\n\n\n<p>But an excellent Buzzfeed quiz needs to be a little unique and unpredictable.&nbsp;<\/p>\n\n\n\n<p>To make my quiz stand out, it’s going to help the quiz-taker figure out which “Friends” character they email like.<\/p>\n\n\n\n<p>With a general plan on what my quiz is about, I can head to Interact and start building it.<\/p>\n\n\n\n<p>When you start building your quiz, Interact gives you two choices on how to begin. You can use a template or start from scratch.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh6.googleusercontent.com\/iZikkhSAk25iZnX7dBiEtcEkINpPhu7F1uwVOX3k_bqI8YT9UPCwScpvvHbxOO-1yN4FOO0NEVrHxvCPrb8KVRm76tNhWMjrkaPGyd86xt5ddUt9uCZysBYCCcj6XsEzjAhhwc_Z\" alt=\"quiz template or from scratch quiz\"\/><\/figure><\/div>\n\n\n\n<p>I normally choose a template. The templates from Interact are divided into categories like Blogging, Business, Entertainment, Animals, Parents, Social Media, Food and Drink, Lifestyle, etc.<\/p>\n\n\n\n<p>In each category, there are several different templates to choose from. These templates come with titles, images, questions, and results that you can use or modify as much as you want. It makes it fast and easy to make whatever quiz you want.<\/p>\n\n\n\n<p>For a Buzzfeed style quiz, I would probably choose a template from Entertainment, Animals, or Lifestyle. These have the most flexibility and the widest range of topics to choose from.<\/p>\n\n\n\n<p>The template quizzes are personality quizzes by default, so you can begin building your quiz right away.<\/p>\n\n\n\n<p>But I decided to build a quiz from scratch, so I have to choose the type of quiz I want before moving on.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/_DYcAEvkXrBxerf-fCdr24x-cPiChkSF9kepMdtmRjt7LDSi-5xe8WdGALa8RMGGT6Jey69zFB7z5znYCpinNuzwCghcuzPi99Tr8pejH2JVsbvDpsWJ5pr94gO1rkHp09Phtsj9\" alt=\"quiz type choices\"\/><\/figure><\/div>\n\n\n\n<p>With Interact, you have a choice of an assessment quiz (including identifying right and wrong answers as people are taking the quiz), a personality quiz with its categories, or a scored quiz where each answer is worth a certain number of points and the quiz-taker gets a specific result based on the number of points they earn.<\/p>\n\n\n\n<p>For a Buzzfeed quiz, I choose personality and go to the blank quiz.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/9h-fm5vRCaf1r-T2HG3snMynp5kGkClbrOd5BV0y8-t2Fpp1M02TMa2NRpaWwoEPcuT8uMvz0AUPk6VyvRKW-qHAQWrWdiVP6ktImfVkMZ2qOxZ6LRCS1ehc17w9P7kO9JfRnzr9\" alt=\"blank quiz cover for Interact quiz\"\/><\/figure><\/div>\n\n\n\n<p>And, I mean blank.&nbsp;<\/p>\n\n\n\n<p>There’s nothing on the cover, no results, no questions, no images.<\/p>\n\n\n\n<p>I like to deal with the quiz cover later in the quiz-building process, so I’m ready to create my quiz results.<\/p>\n\n\n\n<h3>Creating your quiz results<\/h3>\n\n\n\n<p>When you’re building a quiz, it’s always a good idea to figure out your quiz results before you move on to the questions and answer choices.<\/p>\n\n\n\n<p>You should always know where you’re going before you figure out how to get there!<\/p>\n\n\n\n<p>I’ll need to create a result for each character in Friends and tie it to email.<\/p>\n\n\n\n<p>To make the connection between these two things, I need to think about what I know about each of the characters.<\/p>\n\n\n\n<p>For example, Monica is interested in cooking, likes things neat, and loves Chandler.&nbsp;Chandler likes a good joke and might be looking for a new job opportunity. Phoebe is creative and a little bit odd and Rachel is into fashion and celebrities. Joey loves food, women, and dirty jokes, while Ross is into learning, teaching, and dinosaurs.<\/p>\n\n\n\n<p>Then I have to think about how those interests would translate into email habits.<\/p>\n\n\n\n<p>On your quiz result page, you can add a description (which makes the quiz result interesting and useful) and an image.<\/p>\n\n\n\n<p>For my Phoebe quiz result, I might create a results page like this:<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/ykach8ZQg-DJFcJA6MCUWQ9y5VQoASV62iWOXdflTw1eZ3kTNPiO1UREO6JO_f9-J_6uwhgy2noQPgRVnbxuIdylbd_2x9_9v2axSqM_wuNv3OFKnXa-EmpfwUMsAI2Qdonn1jvy\" alt=\"Email like Phoebe quiz results\"\/><\/figure><\/div>\n\n\n\n<p>In the Phoebe result, you can see how I incorporate things about Phoebe’s character and relate it to email practices. It gives a brief description and has a positive spin on characteristics that might not be considered positive (inconsistency).<\/p>\n\n\n\n<p>To finish the quiz results, I repeat the same process for each of the other characters.<\/p>\n\n\n\n<ul><li><strong>You email like Ross<\/strong> &#8211; Your emails are chalk full of information on areas where you’re an expert. You know what you’re talking about and you love to help others learn about those topics, too.&nbsp; You’re everyone’s go-to guy when they want to learn something new!<\/li><li><strong>You email like Rachel<\/strong> &#8211; Your emails are packed with the latest fashion news and celebrity gossip. You know what’s cool and like to share what’s #trending. And your shopping tips are to die for!<\/li><li><strong>You email like Monica<\/strong> &#8211; When it comes to useful information, your emails have it covered. You’re known for your organizational tips, productivity hacks, and amazing new recipes. Your mouth-watering emails are always a hit!<\/li><li><strong>You email like Chandler<\/strong> &#8211; Emails are meant to be fun! You share memes, jokes, and all the funniest finds from social media. Your emails make people smile!<\/li><li><strong>You email like Joey<\/strong> &#8211;&nbsp; Your emails always contain great stories, a little off-color humor, and some unexpected wisdom! People can’t predict what the emails will be about, but they can tell they come straight from your heart of gold. Getting an email from you is like getting an email from a BFF.<\/li><\/ul>\n\n\n\n<p>When you’re building a quiz in Interact, you do have the option to add a Call to Action (CTA) button at the bottom.&nbsp;<\/p>\n\n\n\n<p>While I usually recommend including a CTA like “Book a Call” or “Read the Blog” or “Follow on ______” with a link to the appropriate URL, I don’t use one for this quiz.<\/p>\n\n\n\n<p>For this exact reason, Interact gives you the option to hide the CTA button.&nbsp;<\/p>\n\n\n\n<p>You can always include a CTA in your follow-up nurture sequence, which can be even more effective than the one on the results page.<\/p>\n\n\n\n<p>Once the results are added, it’s time to move on to the questions.<\/p>\n\n\n\n<h3>Adding your questions<\/h3>\n\n\n\n<p>When adding questions to your quiz, it’s important to remember quiz best practices. In <a href=\"https:\/\/www.tryinteract.com\/blog\/launch-your-first-quiz\/\">How to Launch Your First Quiz<\/a>, Kayla recommends adding 7-10 questions.&nbsp;<\/p>\n\n\n\n<p>Since a Buzzfeed style quiz doesn’t need to be quite as deep as other quizzes might need to be, I’m going to have 6 questions in my “Friends” quiz.<\/p>\n\n\n\n<p>I need to create questions that will help me see how the quiz-takers interests pair up with the “Friends” characters’ interests.<\/p>\n\n\n\n<p>And each question will have 6 answer choices, one for each character result.<\/p>\n\n\n\n<p>So, my 6 questions are:<\/p>\n\n\n\n<ol><li>When you open your email, which of these will you read first?<\/li><li>What’s your must-read before you go to bed at night?<\/li><li>What are your plans for next Saturday night?<\/li><li>In your circle of friends, which one are you?<\/li><li>Which email are you most likely to forward on to your friends.?<\/li><li>Which “Friends” GIF or meme is your favorite?<\/li><\/ol>\n\n\n\n<p>You’ll notice that 5 of the questions tie directly to the topic of the quiz, and it’ll be easy to see which answer choice goes to which result.<\/p>\n\n\n\n<p>The last question is just for fun!&nbsp;<\/p>\n\n\n\n<p>To add my questions into Interact, I scroll to the Questions section in the menu at the left, and I end up with a blank question.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh5.googleusercontent.com\/oy4x5zcWMgjK3lujmEGUXs0yl59CBaoup23WIPhYVPnCup_iz7fpMJDyZltLE5UBJwKVU_swHAXBxfagrYoNFfG01kv7-n6PvdTvhjTfome-iGmdsF6yDvbhXBmNMZtmP6dXrmOn\" alt=\"Blank Interact question\"\/><\/figure><\/div>\n\n\n\n<p>As a reminder, if you use a template, you won’t have the blank questions. There will be questions there, but you can change it however you want.<\/p>\n\n\n\n<p>I add the question, an image (or images), and my answer choices for each question.<\/p>\n\n\n\n<p>My first question ends up like this:<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh4.googleusercontent.com\/cyIVgvgA4hl048XCRWejAKR7NXVIXZNROIVsrKvFzZaQwud0Pxe9A4qkrxOthEeZBvTKGALmKaiBmYzEodbeDli8lmbFbdYrgz9hHiEidasuXu7cYloiHjR_MtoQyMbW_a81FJcb\" alt=\"quiz question about email habits\"\/><\/figure><\/div>\n\n\n\n<p>When adding a question, make sure to edit the result correlations. That’s what maps your answers to the correct results.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh4.googleusercontent.com\/btt_Ei4uEnvrSlszgGdc6I8g2Vdixm9DhMeunvsZrB2vcsi13DAFelh1ziI1h3-6OaDoKUDsETCJSYILSzTx-XaEC_i5Jcqw3_DHW2RM9sOR2LADhhKKsBQ5ZpKyGtAcUzpTBs0O\" alt=\"quiz question answer correlation \"\/><\/figure><\/div>\n\n\n\n<p>Notice how each answer maps to one of the “Friends” characters.<\/p>\n\n\n\n<p>While the single image on the question works well for a regular quiz, it doesn’t feel very “Buzzfeedy.”<\/p>\n\n\n\n<p>To make my quiz feel even more like a Buzzfeed quiz, I can add in questions that include images for every answer choice.<\/p>\n\n\n\n<p>My last question about “Friends” GIFs and memes is a great example of this.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/HK2ndtgtE1R215XlWRVXFEOUND5VJq2HuM8BNVjZRDzWbjjgQX0Gbepn0AltuZR79GCw4czA3OgxtHrrbI--OUejxtdmoIC36id1ibdybJZzbRAWsF-84tzD4NwnfskWw9AHMeLl\" alt=\"Friends GIF question \"\/><\/figure><\/div>\n\n\n\n<p>If that question doesn&#8217;t make you feel like you&#8217;re taking a BuzzFeed style quiz, I don&#8217;t know what will.<\/p>\n\n\n\n<p>I mean, “Could this question BE anymore fun?”<\/p>\n\n\n\n<p>(If you didn&#8217;t read that in your best Chandler Bing voice, I&#8217;m gonna need you to go back and read it again. I’ll wait!)<\/p>\n\n\n\n<p>With the options for <a href=\"https:\/\/www.tryinteract.com\/blog\/how-to-add-or-edit-images-in-your-quiz\/\">adding images<\/a> and <a href=\"https:\/\/www.tryinteract.com\/blog\/using-gifs-in-quizzes\/\">GIFs<\/a> to your questions, you can make a quiz that’s a blast to take and people love.<\/p>\n\n\n\n<p>And who doesn&#8217;t love a good Friends GIF or six?<\/p>\n\n\n\n<h3>Styling your quiz<\/h3>\n\n\n\n<p>After you’ve finished creating your questions, it&#8217;s time to make the quiz look exactly how you want it to.&nbsp;<\/p>\n\n\n\n<p>With Interact, you can choose the font you want, the colors you want, and you can even add your logo.&nbsp;<\/p>\n\n\n\n<p>While I usually use my brand colors and fonts in quizzes I build, my colors don’t really go with the “Friends” vibe. Staying true to the “Friends” theme, I chose the bright primary red for the button and a light blue for the backgrounds of the answer choices.<\/p>\n\n\n\n<p>I also wanted an informal font that feels as close to the “Friends” font as I could find. It’s not exactly the same, but it gives the quiz more of the Buzzfeed style than other font choices.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh4.googleusercontent.com\/3ycR_zz0CRm7p4VvBl1Q-acRcb98CZrxPLQjDkceu-YHOUGsr11Au2z8K1rN2bGAo3elzHGmsLbzEnThPyxO91VQgp5BGxtKwoA81liu3UUlfwC_kruEfyuRitEM8Gm5HX_Yjouu\" alt=\"quiz styling dashboard\"\/><\/figure><\/div>\n\n\n\n<h2>Increasing the “Buzzfeediness” of your quiz<\/h2>\n\n\n\n<p>The last step in creating a quiz is to finish the quiz cover. With the cover, you want to make sure the title, image, and description grab people’s attention and make them want to find out the answer.<\/p>\n\n\n\n<p>You want your quiz to have all of the appeal of any Buzzfeed quiz out there.<\/p>\n\n\n\n<p>My title of “Which Friends Character is your email twin?” with the picture of the characters and a description will get any “Friends” fan to take the quiz.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh5.googleusercontent.com\/jp8sLDZG0LGZKflLqskUksqyuoPoaRK5Hf8Mo6CIadZTDyghEXHS_TbAH4FfMLK0g7UOxrKqjP0lmAKxTfCXYPS66kLCCJ3FoiTBM1nZGHP00E0dnQMWk3NczXmXTOtqglVS2N5m\" alt=\"Friends email Buzzfeed style quiz cover\"\/><\/figure><\/div>\n\n\n\n<p>It might help my quiz out that it looks like the title is “Which “Friends” character is your EVIL twin?” when you’re scrolling by. 😂<\/p>\n\n\n\n<p>That could get people to take it, too.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https:\/\/www.tryinteract.com\/plans\/\"><img loading=\"lazy\" src=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/make-Your-own-quiz-25.png\" alt=\"\" class=\"wp-image-11922\" width=\"452\" height=\"76\" srcset=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/make-Your-own-quiz-25.png 904w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/make-Your-own-quiz-25-300x50.png 300w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/make-Your-own-quiz-25-768x129.png 768w\" sizes=\"(max-width: 452px) 100vw, 452px\" \/><\/a><\/figure><\/div>\n\n\n\n<h2>Optimizing your quiz for business growth<\/h2>\n\n\n\n<p>While Buzzfeed style quizzes are usually just for fun, you can set yours up to grow your business, too.&nbsp;<\/p>\n\n\n\n<p>There are a few things you can do for business growth:<\/p>\n\n\n\n<ul><li>Create result landing pages that provide value to the quiz-taker;<\/li><li>Build email sequences for each result to nurture a relationship and move the quiz-taker through your funnel;<\/li><li>Encourage social sharing of your quiz;<\/li><\/ul>\n\n\n\n<p>Since business-focused result pages and email sequences are outside of the purpose of this post, I’m not going to discuss them now. You can find all the information you need to build those amazing results pages and email sequences in these posts:<\/p>\n\n\n\n<ul><li><a href=\"https:\/\/www.tryinteract.com\/blog\/quiz-result-landing-pages\/\">How to Create Quiz Result Landing Pages That Dazzle Your Audience<\/a><\/li><li><a href=\"https:\/\/www.tryinteract.com\/blog\/write-the-perfect-followup-email-sequence-for-your-quiz\/\">How to write the Perfect Followup Email Sequence for Your Quiz<\/a><\/li><\/ul>\n\n\n\n<p>The real way a Buzzfeed style quiz can benefit your business growth is it’s a natural fit for social sharing!<\/p>\n\n\n\n<p>Make a quiz that’s fun to take and gives some insight and people will naturally share it.<\/p>\n\n\n\n<p>And you can encourage even more shares on social media on your results page.<\/p>\n\n\n\n<p>My “Friends” result pages don’t have calls to action, so asking for that social media love could be the perfect CTA.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh6.googleusercontent.com\/_XwWUtNTrMtTNfp4qC_FtML7jHm2yN1qqzwdFGtW61aI8qZNa0GCRWM6Po8WysHMtyXjh2Hl7dOU0Bhyg6ouI63j1U7Zrsg5JKwhxB-dEsNXPt-G5jMJ_L3myfBcsd2JZN0GrVCH\" alt=\"quiz results page Friends quiz result\"\/><\/figure><\/div>\n\n\n\n<p>To highlight the sharing CTA, I added white space around it. Since there’s no CTA button at the bottom, the buttons for Facebook and Twitter are easy to see and click on.<\/p>\n\n\n\n<p><a href=\"https:\/\/dashboard.tryinteract.com\/register\">Interact<\/a> even lets you customize the social sharing settings for your quiz.&nbsp;<\/p>\n\n\n\n<p>When you’re building your quiz, click on the Social Sharing Settings at the top left.<\/p>\n\n\n\n<p>Once you’re in the settings, you can customize how your quiz and results appear on social media.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh5.googleusercontent.com\/CiNj9INLmc6EsvxO3u0xknsZmjyVfz3m4Qr6XcdeJOHdylH9aQfbVp5hYXeIMCN1lr27W3S_AV2MLyeRyNylFIxsyIxy6JXGX19IMLGWF1lW7a6RxjKhYjVMirXgz6jqK43_OxHf\" alt=\"Social Sharing settings Interact quiz\"\/><\/figure><\/div>\n\n\n\n<p>Some things you can change are:<\/p>\n\n\n\n<ul><li>Which social media channels people can share to;<\/li><li>Where the buttons are located;<\/li><li>The URL for the quiz (this is important if your quiz is on your own website);<\/li><li>The image that shows up on social media;<\/li><li>The wording for the CTA on the results page;<\/li><li>The text that shows up in the preview on social media;<\/li><\/ul>\n\n\n\n<p>I didn’t change any of the settings, and here’s what my results looked like on Facebook.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh5.googleusercontent.com\/TxPm_p39krT6BxWzfilSKsx-epmcEId6iPW8Ut1RmvgcGiC-2xD3ruyCmn0N2LJnQL38E9enZ0eyG8Obrlwrz0MgqS9K3O8yx010bSe_BvBjzo7m_5vGx3_p2-I4_0pfvIvNo2bP\" alt=\"Facebook share of email quiz results\"\/><\/figure><\/div>\n\n\n\n<p>Because you’re encouraging people to share your quiz and making it easy for them to share, your quiz could go viral.<\/p>\n\n\n\n<p>Just like a Buzzfeed quiz!<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https:\/\/www.tryinteract.com\/plans\/\"><img loading=\"lazy\" src=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Grow-Your-list-5.png\" alt=\"\" class=\"wp-image-11923\" width=\"452\" height=\"76\" srcset=\"https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Grow-Your-list-5.png 904w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Grow-Your-list-5-300x50.png 300w, https:\/\/tryinteract-blog.s3-us-west-1.amazonaws.com\/blog\/wp-content\/uploads\/2021\/06\/Grow-Your-list-5-768x129.png 768w\" sizes=\"(max-width: 452px) 100vw, 452px\" \/><\/a><\/figure><\/div>\n\n\n\n<h2>Final thoughts on building a Buzzfeed style quiz<\/h2>\n\n\n\n<p>Before you go and build your Buzzfeed quiz, there are a few things that you need to consider.&nbsp;<\/p>\n\n\n\n<p>A Buzzfeed style quiz isn’t right for every situation. If it doesn&#8217;t match with the tone of your brand, the purpose of the quiz, or you need highly qualified leads, you might want to make a different type of quiz.<\/p>\n\n\n\n<h3>Brand tone<\/h3>\n\n\n\n<p>If your brand has a more professional tone, you need to consider whether a BuzzFeed quiz is the best option. Because it has such a fun vibe and an informal topic, it might be out of character to use this style of quiz.<\/p>\n\n\n\n<p>When people get your follow-up email sequence, if it doesn&#8217;t have a similar tone to the one in the quiz, they&#8217;ll quickly lose interest and unsubscribe.<\/p>\n\n\n\n<p>For a more serious brand, another type of quiz might be more effective.&nbsp;<\/p>\n\n\n\n<h3>Quiz purpose<\/h3>\n\n\n\n<p>If you&#8217;re in a situation where the quiz results are important and will be used for another purpose, a Buzzfeed style quiz might not be the best choice. These results are more for fun and don&#8217;t have any sort of scientific validity in how they&#8217;re created.&nbsp;<\/p>\n\n\n\n<p>With my background in education, I know it wouldn’t work to use a Buzzfeed quiz to have my students show that they’ve mastered the necessary information.<\/p>\n\n\n\n<p>When you need reliable results for evaluation or marketing purposes, there are other quizzes that do this much more effectively than a Buzzfeed style quiz.<\/p>\n\n\n\n<h3>Qualifying Leads<\/h3>\n\n\n\n<p>As I stated earlier in the quiz, Buzzfeed style quizzes work great at the top of the funnel. They work well to get people to subscribe to your list.<\/p>\n\n\n\n<p>But the people who subscribe won’t necessarily know you or your products and services.<\/p>\n\n\n\n<p>They most likely won’t be the people who are ready to purchase your $5K coaching package (or any other high-ticket items).&nbsp;<\/p>\n\n\n\n<p>While you can potentially nurture them towards the sale through follow-up emails and phone calls, it’s usually not a quick turn-around. It’s more of a long-term investment.<\/p>\n\n\n\n<p>Again, other types of quizzes could perform better for you in identifying and converting people for your high-ticket item than a Buzzfeed quiz.<\/p>\n\n\n\n<p>Although they’re not the right quiz choice for every situation, there’s no denying the appeal and success of a Buzzfeed style quiz!<\/p>\n\n\n\n<h2>Buzzfeed style quizzes for the win<\/h2>\n\n\n\n<p>You now know everything you need to know to create your own Buzzfeed style quiz. With the right combination of fun and marketing appeal, you’ll create a quiz that people will love.<\/p>\n\n\n\n<p>We can’t wait to see what you come up with!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Interested in creating a Buzzfeed style quiz? Here&#8217;s everything you need to know to make a quiz that people love, take, and share!<\/p>\n","protected":false},"author":17,"featured_media":10916,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[9],"tags":[],"_links":{"self":[{"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/posts\/10913"}],"collection":[{"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/comments?post=10913"}],"version-history":[{"count":4,"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/posts\/10913\/revisions"}],"predecessor-version":[{"id":11924,"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/posts\/10913\/revisions\/11924"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/media\/10916"}],"wp:attachment":[{"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/media?parent=10913"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/categories?post=10913"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.tryinteract.com\/blog\/wp-json\/wp\/v2\/tags?post=10913"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}