{"id":210082,"date":"2021-09-01T11:34:33","date_gmt":"2021-09-01T15:34:33","guid":{"rendered":"https:\/\/sharpspring.com\/?p=210082"},"modified":"2021-09-01T11:34:33","modified_gmt":"2021-09-01T15:34:33","slug":"revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey","status":"publish","type":"post","link":"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/","title":{"rendered":"Revenue Rockstars Advice from “Beyond the Pitch” with Mickey Locey"},"content":{"rendered":"<p>Following the popularity of our Agency Growth Series, we launched Revenue Rockstars — our newest webinar series for agencies and digital marketing leaders. We’re showcasing businesses growing revenue using the SharpSpring Revenue Growth Platform and featuring top marketing talents including Jay Baer, Shama Hyder, Seth Godin, Karl Sakas, and more.<\/p>\n<p>Jay Baer kicked off the series with a live-streamed session on August 5. Jay and Chip House, CMO at SharpSpring, announced our series headliners.<\/p>\n<p>We’re thrilled to learn how revenue rockstars grow revenue throughout the entire marketing funnel. You’ll have the opportunity to attend each session live and participate in the Q&amp;As. We’ll also share key takeaways on our blog. Our series will continue through early January 2022.<\/p>\n<p>Our 11 revenue rockstars will solve 11 questions on problems future revenue rockstars encounter. On August 18, Mickey Locey, president and co-founder of mXtr Automation, hosted  “Beyond the Pitch: Rock Star Moves to Not Only Win Business But Deliver on Your Promise.”<\/p>\n<p>Here are some of our favorite <a href=\"\/resources\/revenue-rockstars-mickey-locey\/\">highlights from Mickey’s session<\/a>. Enjoy and let us know your favorite moments of the series!<\/p>\n<h2>Mickey Locey on breaking through the noise to drive real impact<\/h2>\n<p>Yeah, look, I mean, I think when you&#8217;re focusing when you&#8217;re able to identify that one thing which isn&#8217;t always easy to do, right. Again, because there is so much, so many things going on there. What we find is when you have identified it, this really acts as the most common conversation, the center point of your entire strategy as you move forward. Because it allows you to build off that and allows you to then differentiate yourself based on what you&#8217;re going through, because you have this the center track this baseline, if you will, to really focus on.<\/p>\n<p>When we start with a client, when we onboard a client, one of the first things we always do with that client is ask them what success looks like to them. And that helps us get to the root of this one thing. So we ask them, what does success look like at 90 days? What does it look like in six months? What does it look like at one year? As you can imagine the answers for the clients, they differ, right? They&#8217;re different. Certainly, if there&#8217;s one commonality with almost every client, they say I want to sell more widgets, without a doubt. But there&#8217;s other things that come out of that conversation and we&#8217;ll get back to the selling more widgets because that&#8217;s another thing we want to talk about here. There&#8217;s other things that come out of that, other KPIs, other measurable success benchmarks, if you will, that come out of that question that allows us to really focus in on that key factor that we want to make the center point as we move forward. Could be could be something as easy as and as simple as they want to have better connections with their customer base. Could be they&#8217;ve got a small database of customers right now and they&#8217;re looking for ways to grow that database so that they can start to make those connections.<\/p>\n<p>We had one client that told us, look, we&#8217;re struggling to understand our true sales cycle. We don&#8217;t know exactly what it is. We think it&#8217;s X, but it might be Y. So that becomes a focus for them. One of the common ones that we hear a lot is, you know, the last relationship we&#8217;re in the last agency we were working with, our internal marketing team (whatever it might be) we&#8217;re generating leads, but they&#8217;re just not good quality leads. We got to find a way to get better quality leads.<\/p>\n<p>And I think the last one I want to bring up that&#8217;s becoming more and more common with our clients is the data side of things. They want to gain control over their data. Right. And so the list could go on and on and on in terms of other things that they define success as. But when you combine those with all that noise that we talked about at the beginning in terms of the opportunities and you kind of put those together in one thing. It really allows that area of focus to jump out at you, it quickly allows you to understand what that differentiation is and what our opportunity is to drive that biggest impact.<\/p>\n<h2>Mickey Locey on the secret sauce to sustainable growth<\/h2>\n<p>So you asked me that question when we spoke last time and I’ve been thinking a lot about it. And the reality is that&#8217;s really kind of the secret sauce behind what we do. But the reality is, it&#8217;s not a secret. It&#8217;s not something unique to us or anybody else. It&#8217;s just a philosophy, I think, that you need to make need to buy into. And it&#8217;s kind of an understanding that all things in all aspects of what you&#8217;re trying to accomplish, and what the client is trying to accomplish for their business should focus on one thing, and that&#8217;s the consumer. And this is different than the old “customer is always right”. This is focusing on the consumer. A consumer-centric approach to marketing and specifically with marketing automation.<\/p>\n<p>Our belief, and I say this to every client that we talk to and onboard, and I think it’s hard to argue this point, that there was a day when the idea of marketing was you took your soapbox to town, you get on top of that soapbox and you scream at the top of your lungs all the great things that you do. And people would flock to you to do one of the 10 things that you just listed off. And we kind of carried that through in marketing. And, you know, when you think about the days of email newsletters and sending an email newsletter out with 20 things in it and expect the customer to open that newsletter and figure out of 20 things, what&#8217;s most important to them? That&#8217;s not the way it works anymore.<\/p>\n<h2>Mickey Locey on creating moments and connecting with your audience<\/h2>\n<p>Well, that&#8217;s right. And so if you&#8217;re doing that right, if you&#8217;re taking that that consumer-centric approach, as we like to call it, what starts to happen as you start to have these really powerful connections? And we always talk about creating moments with your audience. And I think the best part about this is, is that as marketers, I&#8217;m not the smartest guy in the room. I don&#8217;t have to have all the answers anymore. I can start with this one conversation that we talked about moments ago. I can get it in play and guess how I win as a marketer. I&#8217;ve got this great technology I&#8217;m driving all of this data back to. And so now I can listen. I can watch. I can see how that conversation is performing. And the consumer who I&#8217;ve put at the center of my communication is going to tell me what I should do next.<\/p>\n<h2>Mickey Locey on rockstar agency moves to grow revenue<\/h2>\n<p>We work with a lot of agency partners, as I mentioned. And I and I have this conversation with them all the time. I mean, there is no doubt that if you&#8217;re an agency, if you&#8217;re a marketer at an organization, you have already done the hardest part of what we&#8217;re talking about here today. You have built a website. You have put strategies in place to drive traffic to that website. You&#8217;ve optimized that site to make sure that you&#8217;re getting the most traffic that you can to that site. You&#8217;ve put conversion optimization strategies in place to make sure you&#8217;re putting the leads in the funnel and that you&#8217;re getting as many of them ready for your sales team as you can. So now you convert and a lead enters the funnel. Why would you stop there? Why wouldn&#8217;t you bring that in and then try to continue that conversation and continue having an impact with that consumer all the way through to the sale? We can do that and we should be doing that.<\/p>\n<p>​​That&#8217;s the key to it. Technology puts us in that position now, look, as marketers, we have to make the technology sing, if you will. It&#8217;s the optimization. It&#8217;s the approach that we&#8217;re taking. That&#8217;s the key, the key aspect of all of this. The technology gives us the data, to be able to have those intelligent conversations and ultimately put us in that position to improve with each interaction with our customers.<\/p>\n<h2>Mickey Locey on becoming an iconic revenue rockstar<\/h2>\n<p>Well and I think talk about that short relationship. I mean, again, we talked a little bit about potentially stopping short with putting leads in the funnel and not doing as well. We shouldn&#8217;t also be focused on the fact that we&#8217;re just trying to get these folks to buy from us. Again, we can&#8217;t stop short here. We have to be consistent. We have to be continuing to develop this relationship. I mean, they come in and they buy once super, we win, okay? We can tell the client that we&#8217;ve got some revenue for them this month. But the fact is that relationship is now stronger than it&#8217;s ever been. And the opportunity now for referrals, you know reviews, up sales, cross-sales, I mean, you name it, whatever the next path is for that particular consumer, you&#8217;re in the driver&#8217;s seat now to have that relationship. You&#8217;re in the driver&#8217;s seat to communicate with that.<\/p>\n<p>There is a reason that our communication out of your platform for clients that we manage for any period of time our open rates in our emails are consistently forty-five percent and plus. That&#8217;s because we&#8217;ve made a connection with the consumer. They care about what we&#8217;re talking to them about. I mean, you compare that to a typical e-mail newsletter open rate. It&#8217;s significantly different. And when you have that level of interaction with a customer, you&#8217;ve got them to this point. Just be consistent with it. Don&#8217;t give it up. Keep doing what you&#8217;re doing. Keep providing value to that consumer. And you&#8217;ll have a customer for life as they say.<\/p>\n<p>Revenue Rockstars is for marketing agencies who want their sales and marketing teams to work together to focus on revenue instead of vanity metrics. If you want to grow your revenue, we invite you to <a href=\"\/revenue-rockstars\/\">register for our series<\/a> and add the dates to your calendar to attend the live streams and Q&amp;As.<\/p>\n<p>If you missed Mickey Locey’s session live, you can watch the show <a href=\"\/resources\/revenue-rockstars-mickey-locey\/\">here<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Following the popularity of our Agency Growth Series, we launched Revenue Rockstars — our newest webinar series for agencies and digital marketing leaders. We’re showcasing businesses growing revenue using the SharpSpring Revenue Growth Platform and featuring top marketing talents including Jay Baer, Shama Hyder, Seth Godin, Karl Sakas, and more. Jay Baer kicked off the [&hellip;]<\/p>\n","protected":false},"author":279,"featured_media":210143,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[287],"tags":[329,464],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Revenue Rockstars Advice from “Beyond the Pitch” with Mickey Locey - SharpSpring<\/title>\n<meta name=\"description\" content=\"Revenue Rockstars is the latest webinar series from SharpSpring, created for agency and digital marketing leaders and featuring top marketing talent like Shama Hyder, Seth Godin, Karl Sakas, and more.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Revenue Rockstars Advice from “Beyond the Pitch” with Mickey Locey - SharpSpring\" \/>\n<meta property=\"og:description\" content=\"Revenue Rockstars is the latest webinar series from SharpSpring, created for agency and digital marketing leaders and featuring top marketing talent like Shama Hyder, Seth Godin, Karl Sakas, and more.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/\" \/>\n<meta property=\"og:site_name\" content=\"SharpSpring\" \/>\n<meta property=\"article:published_time\" content=\"2021-09-01T15:34:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2021\/09\/Revenue_Rockstars_New_Featured%402x.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2400\" \/>\n\t<meta property=\"og:image:height\" content=\"1854\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"8 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sharpspring.com\/#website\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"SharpSpring\",\"description\":\"The Revenue Growth Platform\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/sharpspring.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2021\/09\/Revenue_Rockstars_New_Featured%402x.jpg\",\"width\":2400,\"height\":1854,\"caption\":\"Revenue Rockstars Webinar Series Graphic\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/#webpage\",\"url\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/\",\"name\":\"Revenue Rockstars Advice from \\u201cBeyond the Pitch\\u201d with Mickey Locey - SharpSpring\",\"isPartOf\":{\"@id\":\"https:\/\/sharpspring.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/#primaryimage\"},\"datePublished\":\"2021-09-01T15:34:33+00:00\",\"dateModified\":\"2021-09-01T15:34:33+00:00\",\"author\":{\"@id\":\"https:\/\/sharpspring.com\/#\/schema\/person\/12ef81e895cfb69c55ba33cc2a4c9151\"},\"description\":\"Revenue Rockstars is the latest webinar series from SharpSpring, created for agency and digital marketing leaders and featuring top marketing talent like Shama Hyder, Seth Godin, Karl Sakas, and more.\",\"breadcrumb\":{\"@id\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/\",\"url\":\"https:\/\/sharpspring.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/\",\"url\":\"https:\/\/sharpspring.com\/blog\/revenue-rockstars-advice-from-beyond-the-pitch-with-mickey-locey\/\",\"name\":\"Revenue Rockstars Advice from \\u201cBeyond the Pitch\\u201d with Mickey Locey\"}}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/sharpspring.com\/#\/schema\/person\/12ef81e895cfb69c55ba33cc2a4c9151\",\"name\":\"Rebecca Wentworth\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/sharpspring.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/wp.static-cdn-shsp.com\/wp-content\/uploads\/2019\/10\/10801792_10152858793106832_1051322778273948037_n-100x100.jpg\",\"caption\":\"Rebecca Wentworth\"},\"description\":\"With an extensive background in content creation, marketing management, and agency services, Rebecca joined the SharpSpring team as Senior Content Marketing Coordinator. She now leverages her more than 12 years of experience by developing lead-generating content and other marketing materials to help SharpSpring better serve clients.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/posts\/210082"}],"collection":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/users\/279"}],"replies":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/comments?post=210082"}],"version-history":[{"count":4,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/posts\/210082\/revisions"}],"predecessor-version":[{"id":210086,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/posts\/210082\/revisions\/210086"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media\/210143"}],"wp:attachment":[{"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/media?parent=210082"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/categories?post=210082"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sharpspring.com\/wp-json\/wp\/v2\/tags?post=210082"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}