{"id":30313,"date":"2021-03-10T10:29:27","date_gmt":"2021-03-10T10:29:27","guid":{"rendered":"https:\/\/www.xperience-group.com\/?p=30313"},"modified":"2021-08-30T10:19:35","modified_gmt":"2021-08-30T09:19:35","slug":"is-microsoft-teams-more-than-an-online-meeting-app","status":"publish","type":"post","link":"https:\/\/www.xperience-group.com\/is-microsoft-teams-more-than-an-online-meeting-app\/","title":{"rendered":"Is Microsoft Teams more than an online meeting app?"},"content":{"rendered":"<p>Since the beginning of the pandemic Microsoft Teams has become the <a href=\"https:\/\/techcrunch.com\/2019\/07\/11\/microsoft-says-its-slack-competitor-teams-now-has-13-million-daily-active-users\/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAMdMuuzzE65mFJ9M5ff4hFCZV4cSA86HDFJ86bZ0KXqyZIeoC-dpFxyLPMH0KNLofJicaejzL6_q8adCh1LrJpN8Z-fZy_BTIhGj02sFzYD53z33ERcNf7wmjcVduppgiEwqQoELGUb0btzdPVu9ThJ4B8Zbkmx_iv59YR3714MP\">fastest growing application<\/a> in Microsoft’s history, with over 13 million people now using it on a daily basis. Many users, however, are only scratching the surface of Microsoft Teams, using it predominately as an online meeting app..<\/p>\n<h2>What is Microsoft Teams?<\/h2>\n<p>Microsoft Teams is essentially a company-wide ecosystem designed to help you, your teams and your business to collaborate, communicate, file and app share in real-time from any device. Teams allows you to move your company data from a passively shared space such as a server, into a shared and collaborative ecosystem powered by <a href=\"https:\/\/www.xperience-group.com\/cloud-computing-solutions\/microsoft-365\/\">Microsoft 365.<\/a><\/p>\n<h2>Where is Microsoft Teams data stored?<\/h2>\n<p>With Microsoft Teams and Microsoft 365 your data is stored in Azure, which is composed of globally distributed datacentres which support thousands of online resources. The sole purpose of the Azure infrastructure is to bring applications and data closer, allowing you to share and control your content, with the ability to restrict what happens with your business documents. The data that you move into Teams for business use will always reside in the same geographic location associated with your Microsoft 365 licensing.<\/p>\n<h2>Why should I use Microsoft Teams for my key business data?<\/h2>\n<p>When you work passively with your business data, silos form. Information is spread across your business in pockets, whether that be on a server, on a local client, or without you knowing in personal iCloud or Dropbox accounts &#8211; we know because we see it happening.<\/p>\n<p>When you work with passive data you never get the chance to work collaboratively. How many times have you gone to open a spreadsheet on your server only to find it is locked by another user?<\/p>\n<p>Take email attachments for instance, once you send a document via an email attachment you lose control, every recipient of that email now has an independent siloed copy of your original document.<\/p>\n<h2>Can Microsoft Teams help speed up the decision-making process?<\/h2>\n<p>Drowning in emails is typically a staple of any business with a large overflowing inbox a sign of how busy someone is. By switching your internal conversations into Microsoft Teams, and complimenting this with the many approval workflows that exist within the product, you have the ability of mobilising your decision making in real time. What is more, Microsoft Teams allows you to build up a persistent, ever expanded dossier of business information and best practise, that has a massive effect on helping move your business forward.<\/p>\n<h2>How do I collaborate in Microsoft Teams?<\/h2>\n<p>Whether on the move, in the office or working from home, Microsoft Teams allows you to stay connected with your colleagues and your customers, with access to a wide range of applications right across the Microsoft stack and beyond.<\/p>\n<p>Accessible from any device, including the Microsoft Teams mobile app, you have real-time access to all your relevant applications, documents and business information. You can easily respond to chat and conversation, join meetings with one click and continue to collaborate with your colleagues. In short you are always kept in the loop.<\/p>\n<h2>Getting started with Microsoft Teams<\/h2>\n<p>While businesses use Microsoft Teams as their go-to online meeting app, many do not realise its true functionality. To get the most value out of Microsoft 365, you also need to find the right partner, who will not only help map out your own individual approach when migrating to Microsoft Teams, but also help understand its features and benefits.<\/p>\n<p>For more information about Microsoft Teams and the range of Microsoft 365 products please <a href=\"https:\/\/www.xperience-group.com\/cloud-computing-solutions\/microsoft-365\/\">click here<\/a>, alternatively <a href=\"https:\/\/www.xperience-group.com\/contact-us\/\">contact us here.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since the beginning of the pandemic Microsoft Teams has become the fastest growing application in Microsoft’s history, with over 13 million people now using it on a daily basis. Many users, however, are only scratching the surface of Microsoft Teams, using it predominately as an online meeting app.. What is Microsoft Teams? Microsoft Teams is [&hellip;]<\/p>\n","protected":false},"author":25,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[23,50],"tags":[],"_links":{"self":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts\/30313"}],"collection":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/comments?post=30313"}],"version-history":[{"count":4,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts\/30313\/revisions"}],"predecessor-version":[{"id":31680,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts\/30313\/revisions\/31680"}],"wp:attachment":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/media?parent=30313"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/categories?post=30313"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/tags?post=30313"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}