{"id":30456,"date":"2021-03-31T14:50:52","date_gmt":"2021-03-31T13:50:52","guid":{"rendered":"https:\/\/www.xperience-group.com\/?p=30456"},"modified":"2021-08-04T23:39:22","modified_gmt":"2021-08-04T22:39:22","slug":"xperience-partners-with-irish-football-association","status":"publish","type":"post","link":"https:\/\/www.xperience-group.com\/xperience-partners-with-irish-football-association\/","title":{"rendered":"Xperience partners with the Irish Football Association"},"content":{"rendered":"<p>This month, Xperience has become the official partner and supplier of the <a href=\"https:\/\/www.irishfa.com\/\">Irish Football Association<\/a> (IFA). As part of the partnership, Xperience provides the IFA with IT products and services, allowing them to remain efficient, operational and accessible at all times.<\/p>\n<p>Both businesses have shared values and look forward to working together to support local communities and provide local talent with opportunities to harness their passions and develop their skills. <a href=\"https:\/\/www.xperience-group.com\/about-us\/\">Xperience<\/a> has recently run a successful Graduate Development Programme, investing in people for career development. Whereas, the IFA, with its Young Leaders Programme, aims to provide a voice for young people in football and support the development of young leaders.<\/p>\n<p>Iain O’Kane, MD of Xperience, said: “We are proud to join forces with the Irish FA. Together we are building on our shared values of supporting our local communities and developing and empowering local talent in our industries.<\/p>\n<p>“This partnership comes at an exciting time for Xperience as we develop our brand as a digital transformation specialist across the UK. Like us, the Irish FA is renowned for its long and established history, its sense of community and its pursuit of excellence.<\/p>\n<p>“We look forward to achieving shared successes, both on and off the pitch, as we both continue to ensure that our clients receive an excellent customer experience.”<\/p>\n<p>Thomas Fulton, Head of Stadium Technology at the Irish FA, said: “Xperience provides the association with a wide range of IT products, services and support and this partnership gives us great confidence that these services will remain efficient, operational and accessible at all times.<\/p>\n<p>“Xperience has a forward-thinking approach and it has been beneficial to the overall digital transformation at the association in recent years. I’m looking forward to this partnership continuing.”<\/p>\n<p><strong>About IFA<\/strong><\/p>\n<p>Founded in the Queens Hotel, Belfast back on 18th November 1880 the Irish Football Association is the governing body for the Northern Ireland Football Team<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This month, Xperience has become the official partner and supplier of the Irish Football Association (IFA). As part of the partnership, Xperience provides the IFA with IT products and services, allowing them to remain efficient, operational and accessible at all times. Both businesses have shared values and look forward to working together to support local [&hellip;]<\/p>\n","protected":false},"author":25,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[22],"tags":[],"_links":{"self":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts\/30456"}],"collection":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/comments?post=30456"}],"version-history":[{"count":3,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts\/30456\/revisions"}],"predecessor-version":[{"id":30460,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/posts\/30456\/revisions\/30460"}],"wp:attachment":[{"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/media?parent=30456"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/categories?post=30456"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.xperience-group.com\/wp-json\/wp\/v2\/tags?post=30456"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}